{"id":{"0":1.0,"1":2.0,"2":3.0,"3":4.0,"4":5.0,"5":6.0,"6":7.0,"7":8.0,"8":9.0,"9":10.0,"10":11.0,"11":12.0,"12":13.0,"13":14.0,"14":15.0,"15":16.0,"16":17.0,"17":18.0,"18":19.0,"19":20.0},"Title":{"0":"AutoSAR Embedded Software Consultant","1":"Direct Client Opening - Sr. Oracle PL\/SQL Developer - Toronto ON (Hybrid after 2-3 Months)","2":"Solutions Architect","3":"Windows \/ Wintel Hosting","4":"Linux Engineer","5":"Java Developer","6":"Java Developer","7":"Welder - Canada","8":"Human Resources Specialist","9":"Technical Business Analyst","10":"Senior DataStage Developer","11":"React Developer","12":"ARMO Mechanic","13":"Senior DevOps Engineer - 100% remote","14":"Business Analyst","15":"Software Developer","16":"Java Developer","17":"Sr. Developer - 5G Layer 2 DU (Distributed Unit)","18":"FULLY REMOTE Python SDET at Chicago-based University","19":"Performance Engineer"},"Entreprise":{"0":"Forsys Inc.","1":"IRIS Software, Inc.","2":"Global Technical Talent","3":"Cynet Systems","4":"Cynet Systems","5":"Digital Intelligence Systems, LLC","6":"Digital Intelligence Systems, LLC","7":"Qcentum Technologies","8":"Jade Global","9":"BCforward","10":"Cynet Systems","11":"BCforward","12":"Cynet Systems","13":"Motion Recruitment","14":"Global Technical Talent","15":"Global Technical Talent","16":"Digital Intelligence Systems, LLC","17":"Stefanini","18":"Motion Recruitment","19":"eTek IT Services, Inc."},"Type_Employ":{"0":"Contract W2, Contract Corp-To-Corp, 12 Months","1":"Contract W2, Contract Corp-To-Corp, 12 Months","2":"Full Time","3":null,"4":null,"5":null,"6":null,"7":"Contract W2, Contract Independent","8":"Full Time","9":"Contract W2","10":null,"11":"Contract W2","12":null,"13":"Full Time","14":"Full Time","15":"Full Time","16":null,"17":"Contract Independent, 12+ Months","18":"Full Time","19":"Contract W2"},"Location":{"0":"Vancouver, BC","1":"Toronto, ON","2":"Toronto","3":"Mississauga, ON","4":"Mississauga, ON","5":"Mississauga, On, ON","6":"Mississauga, ON","7":"Montreal, QC","8":"Toronto, ON","9":"Mississauga, ON","10":"Toronto, ON","11":"Mississauga, ON","12":"Leduc, AB","13":"Toronto","14":"Toronto","15":"Toronto","16":"Mississauga, ON","17":"Ottawa, ON","18":"Toronto","19":"Toronto, ON"},"Description":{"0":"## Job Description\n\n**About Forsys**\n\n  * Forsys is a Lead-to-Cash company focused primarily on strategy, technology, and business transformation. Forsys is a 400+ people company with employees spread across US, India, Colombia and Brazil. Besides being an Implementation partner for major vendors, Forsys is an incubator at heart. Learn more at forsysinc.com.\n  * Forsys is a global technology firm providing a wide spectrum of enterprise, cloud and analytics services. Forsys’ prime offerings are in the areas of Cloud and Analytics, Supply Chain\n\nAutoSAR Embedded Software Consultant\n\nOverview:\n\nSeeking Embedded Software Designer with proven experience in AutoSAR software\ndevelopment for  \nautomotive infotainment products. The work spans requirements, design,\nimplementation, and  \nvalidation of automotive subsystems including CAN, LIN, and other I\/O.\n\nCandidates must have a strong technical background and be capable of coming up\nto speed with a new  \nteam and new technology quickly. Good analytical, problem solving, and\ncommunication skills are  \nessential as well as the ability to work collaboratively in a team\nenvironment.\n\nYou will need knowledge and experience in AUTOSAR stacks including design and\ndocumentation for  \nsafety (ISO 26262). Practical AUTOSAR microcontroller development experience\nis a firm requirement.\n\n **Responsibilities:**\n\nTakes on a technical leadership role within projects, assists with system\nspecifications and provides  \ntechnical guidance to the team to ensure schedules and objectives are met.\n\nCore development of automotive software for CAN, LIN, and I\/O, including\nAUTOSAR stack integration,  \nmodification, design documentation, driver bring-up, and testing.\n\nAutomotive software performance analysis, measurement, code validation, and\noptimization.\n\nQuickly ramping up and becoming a key contributor within a team of experienced\nEmbedded Designers.\n\nAbility to fix issues and provide technical guidance on AUTOSAR issues.  \nStays abreast of the technical areas and provides knowledge transfer to fellow\nteam members.\n\n **Qualification:**\n\nBachelor’s degree in computer sciences, electrical\/software engineering or\nequivalent. Advanced  \ntechnical degree desirable.\n\nAt least 4-years hands-on automotive infotainment embedded software\ndevelopment experience and  \nautomotive toolchains (e.g., Vector). AUTOSAR Classic experience desirable.\n\nAt least 4-years of C\/C++ experience.\n\nAt least 4-years’ experience in microcontroller embedded software development.\nReal-time (RTOS)  \nperformance analysis, measurement, and tuning desirable\n\nGood understanding of automotive safety standards for embedded systems\nincluding ISO 26262\n\nStrong client and interdepartmental leadership and communication skills\n(written and verbal).\n\nGood problem-solving and diagnostic skills, in a fast-paced environment.\n\nSolid understanding of the software development and project management life\ncycle.\n\n **Advantages for consideration:  \n** As an advantage, experience in the practical integration of a wide range of\nautomotive communication  \ninterfaces is a plus.  \nAs an advantage, safety-critical software development experience (medical,\naerospace, DO-178B) is a  \nplus.\n\nRegards,\n\nAmar  \nTel: +1  \n  \nForsys Inc. is an Equal Employment Opportunity and Affirmative Action\nEmployer. Qualified applicants will receive consideration for employment\nwithout regard to race, color, religion, sex, sexual orientation, gender\nperception or identity, national origin, age, marital status, protected\nveteran status, or disability status.\n\n","1":"## Job Description\n\nHi,\n\nIris client, a Large Financial Firm is looking to hire **Sr. Oracle PL\/SQL\nDeveloper** for a long term contract opportunity.\n\n **Title: Sr. Oracle PL\/SQL Developer**\n\n **Location: Toronto ON (Hybrid after 2-3 months)**\n\n **Duration: Long Term**\n\n**Required Skills**\n\n  * Experience on Client Facing Reports by using Oracle Reports, BI Publisher, Oracle PL\/SQL, Webfocus, OBIEE or any other reporting platform.\n  * Proficient with SQL, working with large relational databases (Oracle, SQL Server) \n  * Cloud native application development – any or all of PCF, OpenShift, Azure\n\n **Nice-to-have**  \n\\- Experience with large enterprise application development. (Wealth\nManagement applications preferred)  \n\\- Docker, Kubernetes, OpenShift experience  \n\\- Experience with NoSQL (Mongo, Cassandra)  \n\\- Quadient, or any other reporting platform\n\nRegards,\n\n **Pankaj Sharma**\n\nSr. Executive (TAG)\n\nIris Software Inc\n\n200 Metroplex Dr, Edison NJ 08817\n\n[www.irissoftware.com](http:\/\/www.irissoftware.com)\n\nCell:\n\nEmail: [](mailto:)\n\n__\n\n","2":"## Job Description\n\nJob Description  \n  \n **Solutions Architect**  \n  \n**Job Description:**  \n  \n\n  * The Solutions Architect for GAML (Global Anti Money Laundering) provides solution architecture and technology guidance to project delivery teams as they develop client solutions. \n  * The incumbent will have key involvement in architecting solutions that will support the GAML business initiatives and provide architectural expertise & counsel to ensure technology teams and business areas understand the architectural options and technology choices. \n  * The Solutions Architect will be accountable for the recommended solutions that account for a total cost of ownership and risk, leveraging and\/or advancing strategic Enterprise Architecture guiding principles, enterprise solutions and\/or assets, and enterprise technology standards. \n\n  \n  \n**Job Responsibilities** :  \n\n  * Meaningful work is fueled by meaningful performance and career development conversations with your manager. Here's some of what you may be asked to perform: \n  * Solutions Architect with specialized knowledge related to architecting solutions for the Global Anti Money Laundering line of business. \n  * The architectural specialist can work autonomously on highly complex, visible, and diverse programs, including multiple related projects and workstreams. \n  * Be a big-picture thinker, with the ability to anticipate architectural gaps and identify emerging trends through both advanced business acumen and highly specialized technical knowledge of: \n  * programming languages, \n  * industry best practices, \n  * Banking standards, \n  * Infrastructure, \n  * and architectural design\/solutions \n  * Through collaboration with Enterprise Architect and Senior GAML Solution Architect, influence product direction and integrates technology from an architectural perspective within the business environment. \n  * Possess exceptional oral and written communication skills. \n  * Ability to formally document and present complex architecture solutions. \n  * Is very familiar with architectural governance to ensure solutions meet architectural boundaries and characteristics. \n  * Collaborates with Enterprise Domain Architects to provide details of technology solutions to the business partner, including annual plan input and Business and Technology Target State (BATTS) collaboration, that aids the development of future LOB initiatives. \n  * Works with external vendors and service providers as needed to ensure compliance with Architectural, Security, Cloud, and Data standards. \n  * Works closely with project stakeholders (IT Managers, Project Managers, Business & Technology Solution teams, etc.) to complete projects. \n  * Provides recommendations on value-added architectural improvements \/ enhancements. \n  * Develops end-to-end (cross-platform\/LOB) solution architecture for projects to address concerns\/issues impacting technology areas within the Enterprise. \n  * Proven leadership and organizational awareness skills and desire to contribute to and drive business strategy considering changing technologies. \n  * In-depth knowledge of regulatory rules and\/or restrictions as they relate to Anti Money Laundering. \n  * Strong research capabilities to find best of breed software, technology, and solutions, \n  * In-depth knowledge in developing mission-critical enterprise systems that support the 24x7 nature of our business environment. \n  * Deep awareness, knowledge, and experience of controls & governance issues affecting LOB and IT. \n\n  \n  \n**Job Requirements**  \nShare your credentials, but your relevant experience and knowledge can be just\nas likely to get our attention. It helps if you have\/are:  \n\n  * 8+ years in the role of a Solutions Architect with experience architecting large and complex initiatives that have a significant impact on the organization. \n  * Considered an expert in architecting solutions for the Financial Crimes domain; specifically, in Global Anti Money Laundering. This includes experience working with major AML vendors that provide enterprise-grade solutions such as Oracle, BAE, NICE, FeatureSpace, SAS, etc. It also includes experience in architecting solutions for Transaction Monitoring, Customer Risk Rating, Negative News, & Customer Screening. \n  * 5+ years of Technical Experience implementing software packages, especially those used to support the detection of money laundering. \n  * Experience in data analytics, model development, data mining, data exploration, statistics, identity linking, and artificial intelligence for use within financial crime detection. \n  * Ability to serve as the top technical individual expert who can impart knowledge of architecture related to specific domains or a broad range of architecture frameworks, technologies, tools, processes, procedures, and broader technologies and relevant issues. \n  * Knowledge of banking applications, programming languages, industry best practices, the business and associated standards, infrastructure, and architectural design and solutions and governance. \n  * Proven ability to work autonomously as an architectural specialist on high-profile, complex, and high-risk technology projects with significant organizational impact. \n  * Ability to translate complex Business and Technology strategies into a meaningful Architecture and document. \n  * Experience architecting solutions for different target topologies: virtualized, private cloud, or public cloud (preferably with Microsoft Azure). \n  * Strong working understanding and experience in Microservice and Event-Driven Architecture. \n  * Strong working understanding of relational database systems: Oracle and MS SQL. \n  * Good understanding of BI Tools such as Tableau, PowerBI, and SSRS. \n  * Knowledge in Security Architecture (Cloud security [specifically with Microsoft Azure], PCI, Data Encryption, Data Obfuscation, SAML, OAUTH2, Vulnerability Management, Data Security, etc.). \n  * Strong understanding of microservice architecture. \n  * Understanding of Hadoop, HDFS, & Hive. \n  * Solid understanding of Architecture frameworks, methodologies, boundaries, and tools. \n  * Deep awareness, knowledge, and experience of controls & governance issues affecting LOB and IT. \n  * Strong research & investigative capabilities to find best-of-breed software, technology, and solutions. \n  * In-depth knowledge in developing mission-critical systems that support the 24x7 nature of our business environment. \n  * Banking and Regulatory experience. \n  * Skilled at working with Vendors and experience assessing products and risk scoring for transaction monitoring and customer risk rating. \n  * Architecture Governance. \n  * Case Management and Workflow Management as it relates to the investigation of financial crimes. \n  * Ability to analyze and scrutinize Business and Technology Strategy in support of the overall architecture. \n  * Solid understanding of Infrastructure, network, telecommunications, Disaster Recovery, Load Balancing, High Availability, and Network Resiliency. \n  * Integration technologies: Message bus, Kafka, MQ, API, Web services, etc. \n\n  \n**Must Haves** :  \n\n  * Architecture within a large organization, preferably an FI - 8years \n  * Financial Crimes - 5years \n  * Executive communication skills, written and spoken \n  * Data architecture - 8years \n  * 5+ years of Technical Experience implementing software packages, especially those used to support the detection of money laundering. \n  * Agile project experience - 4years \n\n  \n  \n**Nice to Have** :  \n\n  * TOGAF \n  * Good understanding of BI Tools such as Tableau, PowerBI, and SSRS. \n  * Knowledge in Security Architecture (Cloud security [specifically with Microsoft Azure], PCI, Data Encryption, Data Obfuscation, SAML, OAUTH2, Vulnerability Management, Data Security, etc.). \n  * Strong understanding of microservice architecture. \n  * Understanding of Hadoop, HDFS, & Hive. \n\n  \n**About the Company** :\n\n  * As a top 10 North American bank, our client aims to stand out from its peers by having a differentiated brand - anchored in a proven business model and rooted in a desire to give its customers, communities, and colleagues the confidence to thrive in a changing world. \n  * Our client engages in providing financial products and services. They offer various financial products and services, telephone, Internet, and mobile banking services, retail and commercial banking services, and wealth management services. The Wholesale Banking segment provides capital markets, investment banking, corporate banking products, and investment needs to companies, governments, and institutions in financial markets. \n\n  \n#tech  \n#LI-GW1  \n#LI-Remote\n\n","3":null,"4":null,"5":null,"6":null,"7":"## Job Description\n\nFor our client in Canada we are looking for Welders\n\nYou should be able to do the below:\n\nRead drawings and take measurements to plan procedures, determine the\nappropriate welding equipment or method based on requirements, set up\ncomponents for welding according to specifications, Repair machinery and other\ncomponents by welding pieces and filling gaps, inspect welded surfaces to\ndiscover flaws, Maintain equipment in safe condition.\n\n_Thanks & Regards,_\n\n _Lisa Stephen_\n\nManager - Talent Acquisition\n\n _Qcentum Technologies LLC_\n\n _1925 E. Belt Line RD_\n\n _Suite 405 Carrollton, TX 75006_\n\n[ _www.qcentum.com_](http:\/\/www.qcentum.com\/)\n\n","8":"## Job Description\n\nJade Global is actively seeking to hire an energetic and dependable Human\nResources Specialist to join our team. We are looking for an HR Specialist to\nperform new hire Onboarding and administratively support our Utah office and\nHR department’s daily activities. Our ideal candidate will be eager to learn\nour systems, and processes and provide assistance to our employees.\n\nHR Specialist responsibilities include updating our employee records,\ncoordinating company events, and Onboarding. Suppose you’re interested in\nkickstarting or growing your career in HR and getting a closer look of how our\ncompany approaches payroll, Onboarding and employee development. In that case,\nwe’d like to meet you.\n\n**_Responsibilities_**\n\n  * Coordinate Onboarding and New Hire Orientation\n  * Update our internal databases with new employee information, including contact details and employment forms\n  * Leave of absence process\n  * Respond to associates’ inquiries regarding HR policies, employee benefits, and other HR-related matters\n  * Prepare Word, Excel, and PowerPoint documents\n  * Proofread HR documents including audits, policies, and handbooks\n  * May be responsible for making meeting and travel arrangements\n  * Participate in organizing and planning company and Wellness events\n\n**_Qualifications_**\n\n  * Experience in customer service or clerical roles.\n  * Experience with MS Office\n  * Organizational solid and Administrative Skills\n  * Ability to demonstrate problem-solving, attention-to-detail, and communication skills\n  * People-oriented and results-driven\n  * Bachelor of Science\/Bachelor of Arts in Human Resource Management or equivalent.\n\n","9":"## Job Description\n\n![](https:\/\/counter.adcourier.com\/UHJ1ZGh2aXJhai5WZW1wYXRpLjg5NDE0LjQwNzNAYmNmb3J3YXJkLmFwbGl0cmFrLmNvbQ.gif)  \n  \n\nTechnical Business Analyst\n\n  \n\n **BCforward is currently seeking highly motivated CA - Business Systems\nConsultant-Supervisory** \\- **Mississauga, ON**\n\n  \n\n  \n\nWe place consultants for end clients all over USA.\n\n  \n\n  \n\n**Job Title: Business Systems Consultant-Supervisory**\n\n  \n\n**Location: Mississauga, ON**\n\n  \n\n **Expected Duration: 11 Months Contract**\n\n  \n\n  \n\n**Job Description:**\n\n  \n\nLooking for an analyst that has experience in the banking domain working with\nreporting and data models.  \nMUST have past programming experience. We will need a mix of coding and\nfunctional expertise.  \nMUST have banking industry experience.  \nMUST have experience with SQL (query writing), working with data models and\nexcel.  \nMUST have a BS degree in an engineering field.  \nIdeal candidate will have an MBA but not required.  \n  \n  \nThis is a Operational role that helps Finance, Risk stakeholders with the\nCapital Planning and Regulatory reporting of CCAR which is a quarterly\nexercise by the US Federal Reserve to assess whether the US based multi-\nnational banks have sufficient capital to perform operations during financial\nand economic stress conditions.  \n  \nResponsibilities  \n  \n\\- Key member of the Model onboarding team that manages Companies forecasting\nand planning platform - RUBY  \n\\- Collaborate with Finance and Statistical Modelling teams by collecting\nbusiness requirements for Model implementation in RUBY  \n\\- Ensure delivery of model outputs that are in line with the expectation of\nstakeholders  \n\\- Work towards building meaningful analytical views on the platform that\nenable Finance and Risk take proper measures and decisions in their respective\nClient businesses  \n\\- End to end product ownership of Companies forecasting platform  \n\\- Appropriately assess risk when business decisions are made, demonstrating\nparticular consideration for the firm's reputation and safeguarding Company,\nits clients and assets, by driving compliance with applicable laws, rules and\nregulations, adhering to Policy, applying sound ethical judgment regarding\npersonal behavior, conduct and business practices, and escalating, managing\nand reporting control issues with transparency  \n\\- Contributes to the global implementation of common data and data standards,\ncommon processes and integrated technology platforms  \n\\- Participates in creating effective and efficient processes and governance  \n\\- Assists in enabling a foundational reporting infrastructure across Company\nbusinesses and global functions by ensuring consistency within Finance and\nRisk  \n  \nQualifications  \n  \n\\- Candidate should have a BE\/B.Tech or equivalent degree  \n\\- Master's degree would be a plus  \n\\- Around 5 years of work experience in the Information Technology and\/or\nBanking & Finance sector  \n\\- Fluent in excel, hands-on experience in SQL and VBA  \n\\- Knowledge of coding platforms like C, Java, Python  \n\\- Basic understanding of banking products like Equity Derivatives, Loans,\nDeposits, Credit Cards  \n\\- Understanding of Balance sheet and P&L\n\n  \n\n ****\n\n  \n\n**About BCforward:**\n\n  \n\nBCforward began as an IT business solution and staffing firm. Founded in 1998,\nBCforward has grown with our customers' needs into a full-service personnel\nsolution's organization. Headquartered in Indianapolis, Indiana, BCforward\nalso operates numerous delivery centers across North America and India. We are\ncurrently the largest consulting firm and largest MBE certified firm in\nIndiana. Our uninterrupted growth has allowed BCforward to deliver uniquely\nconfigured IT staffing and project solutions for over the years of catering to\nour customers' specific needs. BCforward currently maintains a team of over\n5000 global resources. With our additional brand, Stafforward, together we\nhave the capabilities to deliver services for a variety of industries in both\npublic and private sectors which allows us to address your most challenging\nneeds.\n\n  \n\n  \n\n[www.BCforward.com](http:\/\/www.bcforward.com\/)\n\n  \n\n  \n\n[www.facebook.com\/bcforward](http:\/\/www.facebook.com\/bcforward)\n\n  \n\n\"We must inform you that during the hiring process, we may ask for you to\ndisclose and provide us with various categories of your personal information,\nincluding identifiers such as your name and address, professional information,\ncommercial information, education information, and other related information.\nPlease note that we will only use this information to facilitate and complete\nthe recruiting process. This posting is not an offer of employment. The\nsubmission of intentionally false or fraudulent information in response to\nthis job posting shall render the applicant ineligible for the position.\nBCforward is an equal opportunity employer. Any subsequent offer of employment\nshall be considered employment at will regardless of the anticipated\nassignment duration.\"\n\n  \n\n  \n\n  \n\nInterested candidates please send resume in Word format Please reference job\ncode 177788 when responding to this ad.\n\n  \n\n* * *\n\n  \n\n","10":null,"11":"## Job Description\n\n![](https:\/\/counter.adcourier.com\/UHJ1ZGh2aXJhai5WZW1wYXRpLjA4MTgxLjQwNzNAYmNmb3J3YXJkLmFwbGl0cmFrLmNvbQ.gif)  \n  \n\nReact Developer\n\n  \n\n **BCforward is currently seeking highly motivated CA - Java Developer-\nSupervisory** \\- **Mississauga, ON**\n\n  \n\n  \n\nWe place consultants for end clients all over USA.\n\n  \n\n  \n\n**Job Title:** **CA - Java Developer-Supervisory**\n\n  \n\n**Location: Mississauga, ON**\n\n  \n\n **Expected Duration: 18 Months Contract**\n\n  \n\n  \n\n**Job Description:**\n\n  \n\nResponsibilities of this role is building frontend of the applications, and\ndeveloping the REST APIs and supporting the apps. As an application developer,\ncandidate is expected to have good analytical thinking, problem solving, good\nprogramming\/technical fundamentals and eagerness to learn new\ntechnologies\/concepts. Candidate must be open to accept challenges and\nsuggestions.  \n  \nFrontend (Required):  \n1\\. Experience working as a React developer. If only Angular experience, then\ncandidate should be extremely solid in core JavaScript fundamentals and\nwilling to pick-up React work quickly.  \n2\\. Solid knowledge of JavaScript, CSS, HTML, and front-end languages\nincluding Node JS.  \n3\\. Knowledge of React tools including React.js, Web pack, Bootstrap, SASS,\nExpress, Redux, and Flux.  \n4\\. Have thorough knowledge of E2E deployment of an UI application.  \n5\\. Developing and implementing highly-responsive user interface components\nusing React concepts.  \n6\\. Reviewing application requirements and interface designs.  \n7\\. Proficiency with browser based debugging and performance testing.  \n8\\. Converting UX designs and wireframes to high quality code  \n9\\. Experience building responsive and highly accessible applications\ncomplying to AODA\/WCAG\/ADA and knowledge of using web accessibility tools such\nas NVDA\/JAWS\/AXE.  \n10\\. Ability to take initiative to research, learn and recommend emerging\ntechnologies.  \n11\\. Ability to work with global teams and lead them on critical project\ninitiatives.  \n12\\. Responsible for peer code reviews, unit testing, leveraging CICD pipeline\nof an application.  \n13\\. Understanding of integrating WS with third party libraries\/vendors and\nhandle the security around it.  \n  \nBackend (Good to have):  \n1\\. Experience in developing low latency and high throughput APIs using Spring\nBoot.  \n2\\. Strong Core Java and functional programming experience.  \n3\\. Strong experience in data modeling and experience with relational and no-\nsql database, Oracle and MongoDB.  \n5\\. Responsible for server side design & development.  \n6\\. Development of common, reusable components and services.  \n  \nOther areas (Required):  \n1\\. Experience using Git\/BitBucket.  \n2\\. Good communication skills, both written and verbal.  \n3\\. Good troubleshooting skills.  \n  \nOther areas (Good to have):  \n1\\. Unix shell scripting.  \n2\\. Knowledge of Couchbase, ElasticSearch, and GraphQL.  \n3\\. Knowledge of OpenShift Container Platform.  \n4\\. Knowledge of Hazelcast.  \n5\\. Java memory management.  \n6\\. Prior experience with building distributed, multi-tier applications is\nhighly desirable.  \n7\\. Experience with building apps which are highly performant and scalable\nwill be great.\n\n  \n\n ****\n\n  \n\n**About BCforward:**\n\n  \n\nBCforward began as an IT business solution and staffing firm. Founded in 1998,\nBCforward has grown with our customers' needs into a full-service personnel\nsolution's organization. Headquartered in Indianapolis, Indiana, BCforward\nalso operates numerous delivery centers across North America and India. We are\ncurrently the largest consulting firm and largest MBE certified firm in\nIndiana. Our uninterrupted growth has allowed BCforward to deliver uniquely\nconfigured IT staffing and project solutions for over the years of catering to\nour customers' specific needs. BCforward currently maintains a team of over\n5000 global resources. With our additional brand, Stafforward, together we\nhave the capabilities to deliver services for a variety of industries in both\npublic and private sectors which allows us to address your most challenging\nneeds.\n\n  \n\n  \n\n[www.BCforward.com](http:\/\/www.bcforward.com\/)\n\n  \n\n  \n\n[www.facebook.com\/bcforward](http:\/\/www.facebook.com\/bcforward)\n\n  \n\n\"We must inform you that during the hiring process, we may ask for you to\ndisclose and provide us with various categories of your personal information,\nincluding identifiers such as your name and address, professional information,\ncommercial information, education information, and other related information.\nPlease note that we will only use this information to facilitate and complete\nthe recruiting process. This posting is not an offer of employment. The\nsubmission of intentionally false or fraudulent information in response to\nthis job posting shall render the applicant ineligible for the position.\nBCforward is an equal opportunity employer. Any subsequent offer of employment\nshall be considered employment at will regardless of the anticipated\nassignment duration.\"\n\n  \n\n  \n\n  \n\nInterested candidates please send resume in Word format Please reference job\ncode 177754 when responding to this ad.\n\n  \n\n* * *\n\n  \n\n","12":null,"13":"## Job Description\n\nA leading Education software company is looking to add a Senior DevOps\nengineer to their thriving DevOps team in Toronto! This software is used by\nsome of the most prestigious universities in the world. The company uses the\nlatest technology on their software to modernize student needs, curriculum\nmanagement, campus news etc.  \nThey are looking for someone who wants to be apart of the next-generation of\neducation and up to the minute technology! The company has offices all over\nthe world but are pleased to offer 100% remote flexibility upon desire.  \n**Required Skills & Experience**  \n  \n\n  * Experience in dedicated AWS Linux environment\n  * Production Ansible\/Terraform projects\n  * CI\/CD Experience\n  * Exposure to containerization tools (Docker)\n\n  \n**Desired Skills & Experience**  \n  \n\n  * Kubernetes Cluster orchestration experience is a nice to have\n\n  \n**What You Will Be Doing**  \n  \n\n  * 60% Cloud (Amazon Web Services)\n  * 40% Linux Servers\n\n  \n**Daily Responsibilities**  \n  \n\n  * 65% Hands On\n  * 35% team collaboration\n\n  \n**The Offer**  \n  \nYou will receive the following benefits:  \n\n  * Medical, Dental, Vision Insurance\n  * Vacation Time\n  * Stock Options\n\n  \nApplicants must be currently authorized to work in the Canada on a full-time\nbasis now and in the future.  \n  \n#LI-KS1  \n  \n#LI-KS2\n\n","14":"## Job Description\n\nJob Description  \n  \n **Business Analyst**  \n  \n **Job Description** :  \n\n  * The Business Analyst will plan, manage, lead and oversee the end-to-end delivery of requirements throughout the lifecycle of the project in alignment with the business and\/or enterprise needs and strategies. \n  * Provide leadership and work collaboratively with stakeholders including business, technology, and finance partners to support project benefits and changes to business processes, policies, and systems across single or multiple Lines of Business (LoB). \n\n  \n  \n**Customer** :  \n\n  * Recognizing the importance of our customers - anticipating and meeting their evolving needs, as well as providing the kind of Legendary Customer Service that reflects standards and Guiding Principles. \n  * Lead a diverse range of stakeholders; communicates effectively by adapting style and technique to a diverse audience \n  * Analyze impacts on customers, stakeholders, employees, processes, and technology solutions to achieve business results \n  * Understand and clarify work packages of each assigned initiative\/project inclusive of constraints (time, cost, people resources) and maintain a customer-centric approach \n  * Provide recommendations and direction based on the end to end customer experience when making decisions \n  * Lead and own the project deliverables related to business requirements to meet the needs of the customer, employee, and business \n  * Assess and ensure that customer and employee experience\/stakeholder impacts are appropriately managed \n  * Engage appropriate stakeholders to identify and manage required outcomes of projects for the business \n  * Provide ongoing communication to key stakeholders, including the project sponsor, business project owner, and project\/program\/portfolio manager to ensure they are aware of significant changes which impact requirements delivery against the overall project \n  * Respond to inquiries and escalate concerns from stakeholders and partners at all levels in the organization \n  * Identify and lead problem resolution to ensure customer needs are met \n  * The Business Analyst contributes to the application of change management best practices (e.g. stakeholder analysis, gap analysis, change planning, etc.) \n  * Collaborate with the project manager and business sponsor to identify and ensure required resources are assigned to the project for the successful delivery of requirements \n  * Ensure timely notification and escalation of possible issues\/problems while assessing options and recommendations for prompt resolution \n\n  \n  \n**Shareholder - Business Operations** :  \n\n  * Focused on executing better constantly reviewing our processes and finding ways to improve them; collaborating with internal and external business partners to improve operational efficiency and effectiveness. \n  * Lead requirements management on the project(s) which are based on complexity, size, and budget as defined by the project governance levels \n  * Provide leadership\/guidance and support in defining the business need or problem statement based on strategic drivers and identifying potential solutions \n  * Identify scope changes and complete analysis to determine the impact to project benefits and risks \n  * Facilitate and follow a structured approach to plan, elicit, analyze, document, communicate, and manage business requirements with stakeholders by applying a variety of elicitation techniques to probe, challenge, and understand requirements according to the requirements management discipline \n  * Identify, document, and validate current state processes and work with the business and stakeholders to design the desired future state \n  * Establish and maintain full requirements traceability and work with the business to prioritize requirements and scope changes to ensure business needs are met \n  * Collaborate with technology partners and provide recommendations to support the development of system requirements and design, testing plans, and artifacts\/deliverables to ensure business needs are met \n  * Ensure project issues and concerns are addressed for clear articulation of business requirements (eg. Business Systems Analyst) \n  * Proactively identify and track requirements risks, issues, assumptions, dependencies, and constraints and anticipate and effectively manage risks related to requirements. \n  * Align decisions to risk appetite \n  * Develop mitigation plans or lead\/contribute to the completion of necessary compliance\/new process assessment templates \n  * Contribute to Quality Assurance activities by supporting the development of test scripts and testing of developed solutions, including communication of issues and resolution \n  * Adhere to Enterprise project governance controls to ensure projects meet all performance, quality, and compliance standards and conform to appropriate disciplines \n  * Contribute to the development of the project plan and high-level work breakout session (WBS), identify and manage key risks and decisions \n  * Own and complete relevant work packages through collaboration with multiple stakeholders to prepare for operational readiness, manage deadlines and adjust to changing work priorities \n  * Take ownership and communicate progress on work packages, including requirements management, in a concise and timely manner, escalating issues to project manager, partners, and manager where appropriate Assess project change requests and their impacts on requirements, checking for alignment to project benefits at all phases \n  * Develop efficient and effective solutions through analytical problem-solving \n  * Support implementation \/ post-implementation activities as defined in the project plan \n\n  \n  \n**Shareholder - Financial** :  \n\n  * Banks' commitment to financial responsibility and operating our businesses with excellence. \n  * Own the delivery of high-level requirements that drives successful cost estimation for the project and requirements changes due to any project change requests \n  * Forecast, Define and manage the requirements effort including cost and timeline \n  * Support the Request for Information (RFI) or Request for Proposal (RFP) with vendors if required \n  * Contribute to the development of the seed funding request by ensuring project scope and benefits are clearly articulated and risks are identified \n  * Identify risks or issues with technology solutions or design that may impact the realization of project benefits and provide guidance and support to stakeholders in making good decisions to pro-actively resolve or mitigate potential risks\/delays to the project \n  * Ensure accuracy of the business requirements documentation to mitigate against project changes and reduce\/manage costs to the project \n  * Critique and analyze requirement change requests to challenge impact on original business needs as defined by the project charter \n  * Solidify business needs including problem statements, business objectives, and strategic alignment to ensure accurate delivery of business requirements in support of the business case \n  * Deliver detailed level requirements to support downstream estimates and delivery of business case anchored to business requirements \n  * May contribute with the business owner to define measures of success as defined in the project charter \n\n  \n  \n**Must Haves:**  \n  \n\n  * 8 years of experience will be considered as long as the candidate is solid with strong BA experience \n  * Verbal and written communication skills, problem-solving skills, attention to detail, and interpersonal skills. \n  * Basic ability to work independently and manage one time. \n  * Basic knowledge of design techniques and principles involved in the production of drawings and models. \n  * Basic knowledge of computer software, such as Visual Basic, Java, SQL, etc. \n  * The ability to take initiative and drive results. \n  * Good knowledge of Agile methodology \n  * Experience with story Mapping and taking scope with user stories \n  * Expert at diving into complex requirements and developing smaller stories \n  * Able to negotiate and communicate timelines effectively \n  * Good relationship management skills \n\n  \n  \n**Nice Haves:**  \n  \n\n  * Project management experience \n  * Product Owner experience \n  * Experience within the insurance industry\/online sales \n\n  \n**Note** :  \n\n  * Strong leadership skills as the Business Analyst \n\n  \n**About the Company** :\n\n  * As a top 10 North American bank, our client aims to stand out from its peers by having a differentiated brand - anchored in a proven business model and rooted in a desire to give its customers, communities, and colleagues the confidence to thrive in a changing world. \n  * Our client engages in providing financial products and services. They offer various financial products and services, telephone, Internet, and mobile banking services, retail and commercial banking services, and wealth management services. The Wholesale Banking segment provides capital markets, investment banking, corporate banking products, and investment needs to companies, governments, and institutions in financial markets. \n\n  \n#tech  \n#LI-GW1  \n#LI-Remote\n\n","15":"## Job Description\n\nJob Description  \n  \n**Software Developer - Java**  \n  \n**As part of this team, prime responsibility will be to:**\n\n  * Work with other team members to cooperatively design, develop and deploy quality solutions in order to satisfy project objectives and client requirements. Writes, tests, and debugs code. Participates in code reviews. \n  * The Software Developer will comply with System Development Life Cycle (SDLC) methodology. \n  * Take part in the construction of the requirements, design, testing, and deployment documents. \n  * The Software Developer will ensure consistency in coding standards. \n  * The Software Developer will ensure required documentation is housed in the project repository and that knowledge transfer has occurred to full-time staff upon completion of the contract term. \n\n  \n**Job Requirements**  \n**Must-Have Skills:**\n\n  * Minimum 5 Years of work experience developing and deploying apps to prod in Java 8+, Spring Framework, Spring Batch, Autosys Job, Unix\/Linux, GIT (BitBucket), Maven, Jenkins, SQL Database. \n\n**Nice to Have:**\n\n  * Scala 2 , Spark 2, EDPP: Hadoop, Hive, Beeline, IntelliJ \n  * Develop and Deploy applications in Java. \n  * Apply analytical skills to resolve problems and deliver solutions. \n  * Design and develop quality solutions for systems issues consistent with project objectives. Develop, implement and maintain solutions that maximize system availability. \n  * Periodic scope assistance. \n  * A vacancy exists for a developer to join the team in the delivery and development of this project and to eventually contribute to future enhancement, support, and maintenance post-delivery. \n\n  \n**Education\/Experience:**\n\n  * Degree\/Certifications Required: Computer science or related \n  * Years of experience: 8+ years \n\n  \n**About the Company**\n\n  * As a top 10 North American bank, our client aims to stand out from its peers by having a differentiated brand - anchored in a proven business model and rooted in a desire to give its customers, communities, and colleagues the confidence to thrive in a changing world. \n\n  * Our client engages in providing financial products and services. They offer various financial products and services, telephone, Internet, and mobile banking services, retail and commercial banking services, and wealth management services. The Wholesale Banking segment provides capital markets, investment banking, corporate banking products, and investment needs to companies, governments, and institutions in financial markets. \n\n  \n#tech  \n#LI-GW1  \n#LI-Hybrid\n\n","16":null,"17":"## Job Description\n\n  \nStefanini is looking for Sr. Developer - 5G Layer 2 DU (Distributed Unit) for\nOttawa, Canada location (Initially remote) Description:Stefanini provides the\ntechnology that transforms the way we all work and live. But we are more than\na technology company we are a people company. We inspire, challenge, and\nrespect every one of our over 100,000 employees. We also provide them with\nunparalleled growth and development opportunities. We can't wait for you to\ndiscover this for yourself as a Layer 2 Developer on our 5G team in Ottawa, in\na once in a career opportunity to be part of building something from scratch\nand shepherding it into the marketplace.We are also according to Glass Door\nthe best place in Canada to work!We're excited to announce that we're\ncontinuing to build our new 5G wireless O-RAN team from scratch and we're\nlooking for talented embedded software developers to take part. The\nDistributed Unit (DU) team has multiple openings for key roles in a new high-\npowered Ottawa R&D team. If you enjoy working on a new product, new software,\nnew team, deep desire to learn and collaborate with others, then we want to\nhear from you. The successful candidate would be involved with:Implement and\ntest key Layer 2 features, algorithms and integrate them with the CU and RU\nand other features in the DU.LEAN Agile environment, implementing features in\nC++Fixing defects in a timely manner.Working with other team members and\nsoftware architects to determine the high level and detailed designs of the DU\ncomponents.Part of a scrum team responsible for the continuous integration\n(CI) and continuous delivery (CD) of the DU components.Identifying,\ndeveloping, executing, monitoring, and maintaining automated tests in\nPython.Work closely with the other development teams to ensure completeness,\nquality, and performance of the DU functionality.As a Senior Developer you may\nhave additional team leadership responsibilities.  \n  \nMust have Qualifications:Organized, goal-oriented, self-starter, with a team\nfocused mentality.An excellent attitude and desire to work in a collaborative\nteam environment where everybody in the scrum team owns the deliverables and\nquality.Comfortable working in a very dynamic environment.C\/C++ programming\nexperience.10+ years' experience working on carrier grade telecommunications\nproducts. You know what 99.9999% means. Preferred Qualifications:Experience\nworking with wireless technologies, 4G, 5G, and particularly DU.Knowledge of\n3GPP and ORAN standards and interfaces, familiarity with RRC, MAC, scheduler,\nand L1 interfaces.Experience working in a startup type environment would be an\nasset.Experience with Wireshark, gdb, and the Atlassian toolset.  \n\n","18":"## Job Description\n\nA well-known higher education institution is looking to add a Senior SDET to\ntheir growing team. The role entails UI\/API and Database automation testing.\nMust be able to build test cases from scratch and work independently. Must\nhave 3-5 years of experience coding using JavaScript or Python.  \n  \nFully remote. Apply today!  \nRequired Skills & Experience • Python or JavaScript and Pytest • Cucumber or\nSelenium Webdriver • Database testing - SQL Desired Skills & Experience •\nPerformance testing JMeter or K6 • API testing The Offer\n\n  * Competitive salary\n\n  \nYou will receive the following benefits:  \n\n  * Medical Insurance & Health Savings Account\n  * 401(k)\n  * Paid Sick Time Leave\n  * Pre-tax commuter Benefit\n\n#LI-CB4\n\n","19":"## Job Description\n\nPerformance Engineer\n\nLocation - (remote Canada - Toronto, if not then remote US, EST)\n\nDuration – 6 months+\n\nSupport JMeter, New Relic, Load Testing\n\n"},"Salary":{"0":"Depends on Experience","1":"Depends on Experience","2":null,"3":null,"4":null,"5":null,"6":null,"7":"Depends on Experience","8":"$0 - $0","9":null,"10":null,"11":null,"12":null,"13":null,"14":null,"15":null,"16":null,"17":"$150,000 - $155,000 \/yr","18":null,"19":"Depends on Experience"}}