[{"id":"pF6zk","Title":"Rust Developer","Entreprise":"Motion Recruitment","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nJob Description  \nWe a product-based software company looking to revolutionize working\nenvironments in the digital world.  \n  \nWe pride ourselves on having great culture and have won multiple Best Place to\nWork awards in the past few years.  \n  \nWhat we are looking for is as Rust Engineer to add to our growing team and\nhelp shape this team that you will be joining!  \n  \nWhat we are really looking for is someone ready to make an impact in their\ncurrent role, a candidate to deliver on deadlines and be hungry for a fast-\npaced environment, while working within an exciting industry.  \n  \nIf you want to work in a great culture for a modern tech company, then this\nmight be for you!  \nRequired Skills & Experience\n\n  * 1+ years of professional experience with Rust\n\nDesired Skills & Experience\n\n  * Cloud or CI\/CD is a plus, but not neeeded\n\nWhat You Will Be Doing  \nTech Breakdown  \n\n  * 100% Rust coding\n\n  \nDaily Responsibilities  \n\n  * 80% Hands On\n  * 20% Team-collaboration\n\nThe Offer\n\n  * Competitive Salary: Up to $150,000\/year, DOE (Can go higher for right candidate)\n\n  \nYou will receive the following benefits:  \n\n  * Flexible vacation\n  * Benefit coverage (Medical, Dental, Vision, etc) beginning day 1\n  * Stock options\n  * Bonus structure\n\n  \nApplicants must be currently authorized to work in Canada on a full-time basis\nnow and in the future.  \n  \nAccommodation will be provided in all parts of the hiring process as required\nunder Motion Recruitment's Employment Accommodation policy. Applicants need to\nmake their needs known in advance.\n\n","Salary":null},{"id":"96RuZ","Title":"Big Data \/ Hadoop with Data Lake","Entreprise":"K-Tek Resourcing LLC","Type_Employ":"Full Time","Location":"Toronto, ON","Description":"## Job Description\n\n  *     Experience with design and implementation on Hadoop data lake platform and able to define data architecture framework standards and principles including modeling metadata security and reference data\n\n  *     Hands on application design coding and deployment of medium and significant complex data pipelines\n\n  *     Translate business requirements into technical specifications including data streams integrations transformations databases and data warehouses\n\n  *     Experience data modeling and designing data systems and or products using SQL OLAP OLTP and compare contrast the differences\n\n  *     Weighing the trade offs between established and emerging data technologies in columnar and relational databases predictive analytics data visualization and unstructured data Acts as a SME\n\n  *     Trusted day to day advisor to development teams on application portfolio SDLC and development design frameworks components and services re use\n\n  *     Provides key inputs into future technology direction and areas associated stability performance and roadmap strategy and development initiatives for applications in the portfolio Education wise\n\n  *     STEM is preferred but the experience skills is the most important\n\n","Salary":"Depends on Experience"},{"id":"aYbSG","Title":"Senior iOS Developer","Entreprise":"Motion Recruitment","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\n**Senior iOS Developer**  \n  \nJob Description  \n  \nAre you looking to join a dedicated company that's proven its software is not\nonly made to last, but to thrive in a constantly evolving market? Their mobile\napps, at the core of these critical workflows, are powered by reliable,\nscalable, resilient distributed systems that reach people all across the\nworld.  \n  \nRequired Skills & Experience  \n\n  * 2+ years experience as a technical lead or managing engineering teams\n  * 5+ years experience developing and supporting software in a production environment\n  * 4+ years experience programming in object oriented languages such as Java, Python, or C++\n\n  \nDesired Skills & Experience  \n\n  * 3+ years experience developing and supporting scalable, distributed backend services\n  * 3+ years experience working with databases\n\n  \n  \nWhat you will be doing  \n\n  * 100% Hands on\n\n  \nThe Offer  \n\n  * $200k\n  * Benefits (Medical, Dental, Vision)\n  * 4 weeks of vacation\n\n  \n  \nApplicants must be currently authorized to work in Canada on a full-time basis\nnow and in the future. Accommodation will be provided in all parts of the\nhiring process as required under Motion Recruitment's Employment Accommodation\npolicy. Applicants need to make their needs known in advance.\n\n","Salary":null},{"id":"Dj26B","Title":"Machine Learning Engineer","Entreprise":"Info Origin Inc.","Type_Employ":"Full Time","Location":"Toronto, Ontario","Description":"## Job Description\n\n**Find Your Next Challenge…..!**\n\n **Position Title: Machine Learning (ML) Engineer**\n\n **Location: Toronto, ON ; Remote**\n\n **Position Type: Full-Time**\n\n **Job Description:**\n\nWe are looking for a Machine Learning (ML) Engineer to help us create\nartificial intelligence products. One should have the understanding of data\nstructures, data modeling and software architecture.Deep knowledge of math,\nprobability, statistics and algorithms is a must.\n\n **Skills:-**\n\nExperienced in Machine Learning.\n\nMinimum of 3+ years' experience as a Python programmer.\n\nExperience in Python frameworks (like Django, Flask or Pyramid).\n\nExperience with tools like Numpy, SciPy, Pandas, and matplotlib etc.\n\nExperience with machine learning with scikit-learn.\n\nExperience with Tensor Flow, Pytorch and Keras is a plus.\n\n **Why you should apply:-**\n\nEnhance your Knowledge skills\n\nGood Benefits.\n\n **If you are willing to apply for this job , just click on “Apply” and you\nwill reach one step closer to your dream job.**\n\n","Salary":"Depends on Experience"},{"id":"4JtXG","Title":"Senior Software Developer (1 year CT-to-hire)","Entreprise":"Motion Recruitment","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nWe have one more contract opportunity (currently) available with one of our\ntop clients in the business consultation space, and they are very URGENT. This\nis an opportunity to work with one of Canada's largest telecommunications\nproviders on 5G initiatives leveraging the latest technologies.  \n  \nExperience with Java 8+, Spring Boot, Python scripting, and some experience\nwith message brokering\/streaming are requirements for the position.  \n  \nThey are looking for a contractor to come on between 6-12 months, and then to\nconvert to full-time thereafter. The opportunity is also fully remote\nthroughout Canada.  \n  \nSound like a good fit for you? Apply quickly for consideration!  \nRequired Skills & Experience\n\n  * At least three years of professional software development\/engineering experience\n  * Java 8+\n  * Spring Boot\n  * Python scripting\n  * Kafka\n\nDesired Skills & Experience\n\n  * Bachelor of Computer Science\/Engineering or equivalent\n  * Experience with cloud is a plus, though not a requirement\n\nWhat You Will Be Doing  \nTech Breakdown  \n\n  * 70% Java and related tools and technologies\n  * 30% Cloud, Ops work\n\n  \nDaily Responsibilities  \n\n  * 80% Hands On\n  * 20% Team Collaboration\n\nThe Offer\n\n  * Competitive Rate: Up to 90\/hr, DoE\n\n  \nApplicants must be currently authorized to work in Canada on a full-time basis\nnow and in the future.\n\n","Salary":null},{"id":"MIhI2","Title":"Privacy Engineer","Entreprise":"Motion Recruitment","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nJob Description One of the most progressive product-based software companies\nin Toronto is looking to bring on a Privacy Engineer! We are VC-backed digital\nhealth software company that's revolutionizing how diagnoses for certain\nillnesses are being implemented. We have built a platform called Selfie\nDiagnostics that can diagnose illnesses such as an active infection of\nCOVID-19 and others via selfies on everyday phones. We are looking for an\nexceptional talent to help us address the security and privacy challenges of\nour Software as a Medical Device (SaMD) platform as we enter the stage of\ncommercialization. The Privacy Engineer will be a critical member of our team,\nsupporting the company with building and delivering ethical and trustworthy\ntechnology while following healthcare data privacy concerns and regulations.\nWe are looking for a Privacy Engineer with an engineering background. Ideally,\nyou are familiar with Privacy by Design (PbD) Foundational Principles, FIPPS\nand the NIST Privacy Framework. You are IAPP Certified CIPP\/CIPT or in the\nprocess of obtaining & processing data assets.  \nIf you want to work in an exciting industry and exponentially impact the life\nof people around the world while being surrounded by some of the best\nengineers, then this might be for you!  \nRequired Skills & Experience\n\n  * 2+ years as a Privacy Engineer\n  * 5+ years of engineering experience\n  * Strong with either Java, JavaScript or Python\n  * Familiar with Privacy by Design (PbD) Foundational Principles, FIPPS and the NIST Privacy Framework\n  * IAPP Certified CIPP\/CIPT or in the process of obtaining & processing data assets\n\nDesired Skills & Experience\n\n  * Exposure to healthcare regulatory submissions and processes (i.e., FDA premarket authorizations)\n  * Experience in overseeing security principles in clinical validation studies\n  * Experience in decentralized privacy: the use of a blockchain to provide more secure anonymous data management and analysis of healthcare big datasets\n  * Knowledge of Federated Learning, digital health privacy requirements such as FDA and Canada Health\n\nWhat You Will Be Doing  \nTech Breakdown  \n\n  * Java\/JavaScript\/Python\n\n  \nDaily Responsibilities  \n\n  * 70% Product development while following healthcare data privacy concerns and regulations\n  * 20-30% Hands-on\n\nThe Offer\n\n  * Competitive Salary: Up to $120K\/year, DOE\n\n  \nYou will receive the following benefits:  \n\n  * Flexible hours\n  * Paid vacation\n  * Benefits on Day 1\n  * Subsidized gym membership\n  * Mental health plan\n  * Learning and development budget\n\n  \nApplicants must be currently authorized to work in Canada on a full-time basis\nnow and in the future.  \n  \nAccommodation will be provided in all parts of the hiring process as required\nunder Motion Recruitment's Employment Accommodation policy. Applicants need to\nmake their needs known in advance.\n\n","Salary":null},{"id":"y3OQ2","Title":"Program Manager","Entreprise":"Global Technical Talent","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nJob Description  \n  \n **Program Manager**  \n  \n**Job Description:**\n\n  * We are looking for a Technology \/ Program Lead to support the GUM delivery - an upgrade project for our Guidewire Insurance suite products (Policy and Billing Center).\n  * The successful Project Manager would provide technology and program oversight to ensure the successful launch of the application on time and with the expected resiliency of an enterprise platform.\n\n  \n**Day to Day responsibilities:**\n\n  * The Program Manager will coordinate the key technical activities being done a large cloud transformation program eg deployment coordination\n  * Work with various tech leads to coordinate and resolve technical problems at various levels\n  * Understand the processes of organization and ensure that team is following the same\n  * Work as tech lead to support Sr tech delivery lead in accomplishing key technical asks such as access compliance, application currency, infrastructure architecture etc.\n\n  \n**Must Have:**\n\n  * IT tech lead - 4yrs\n  * Cloud - 2 yrs\n  * DevOps - 2yrs \n\n  \n**Nice to Have:**\n\n  * GW Policy & billing center\n  * IT Infrastructure implementation \n\n  \n**About the Company:**  \nAs a top 10 North American bank, our client aims to stand out from its peers\nby having a differentiated brand - anchored in a proven business model and\nrooted in a desire to give its customers, communities, and colleagues the\nconfidence to thrive in a changing world.  \n  \nOur client engages in providing financial products and services. They offer\nvarious financial products and services, as well as telephone, Internet, and\nmobile banking services, retail and commercial banking services, as well as\nwealth management services. The Wholesale Banking segment provides capital\nmarkets, investment banking, corporate banking products, and investment needs\nto companies, governments, and institutions in financial markets.  \n  \n#tech  \n#LI-GW1  \n#LI-Remote\n\n","Salary":null},{"id":"BHdr4","Title":"Computer Systems Validation Analyst","Entreprise":"NTT DATA, Inc.","Type_Employ":null,"Location":"Halifax, NS","Description":null,"Salary":null},{"id":"9iW2F","Title":"Senior Full Stack Developer - C#, .NET, Angular\/React","Entreprise":"Motion Recruitment","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nOur client is a non-profit organization and registered charity that assists\ndonors and charities throughout Canada. If you are looking to work on a\ngrowing and dedicated team in a .NET environment, this is the post for you.\nThis opportunity will focus on utilizing C#, .NET, Angular\/React and\nAzure\/AWS. Our client is looking for professional experience with these\ntechnologies. The application you will be working on will be used by thousands\nof end users.  \n  \nThis is an excellent opportunity to become part of a highly motivated team\nthat works with the latest tech stacks. On top of this, the opportunity\nprovides a competitive salary package. See compensation and benefits details\nbelow.  \n  \nRequired Skills & Experience  \n\n  * 5+ years of experience in C# and .NET.\n  * 5+ years of experience with Javascript, HTML and CSS\n  * 5+ years of experience with Angular or React\n  * 5+ years of experience using Azure or AWS in a professional setting\n  * Critical thinking skills\n  * Excellent communication abilities\n\n  \n  \nWhat You Will Be Doing  \n  \nTech Breakdown  \n\n  * 50% Back-End\n  * 50% Front-End\n\n  \n  \nResponsibilities  \n\n  * 80% Hands On\n  * 20% Team Collaboration\n\n  \n  \nThe Offer  \n  \nCompetitive Salary: Up to $120,000K\/year  \n  \nYou will receive the following benefits:  \n\n  * Full benefits package, including dental, medical and vision\n  * Fully remote, even post-COVID\n  * Flexible hours\n  * Competitive PTO\n\n  \n  \nApplicants must be currently authorized to work in the Canada on a full-time\nbasis now and in the future.  \n  \n#LI-JA1\n\n","Salary":null},{"id":"2XsdQ","Title":"Full Stack Lead Software Engineer","Entreprise":"Motion Recruitment","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nOur client is a global provider of investment and financial services and\nsoftware for the financial services and healthcare industries. It was named to\nFortune 1000 list as a top company based on revenue. Some 18,000 financial\nservices and healthcare organizations, from the world's largest institutions\nto local firms, manage and account for their investments using their products\nand services.  \n  \nSeeking a Lead - Java software developer who is a talented problem solver,\npassionate about technology and working for a company that thrives on solving\nbusiness needs with people and technology. Although part of a multinational\nlarge financial software company, you will have the opportunity to work in an\nenvironment that promotes new ideas, and fresh innovative solutions. Your\nopinion is listened, and the enthusiasm is welcomed.  \n  \nTechnical Skills and Requirements  \n\n  * Java\n  * SpringBoot\n  * Strong SQL knowledge\n  * Exposure to Angular\/React\/Vue\n  * Experience with source code management systems (Git, SVN)\n  * Knowledge of Software Development Life Cycle methodologies\n\n  \nWhat you will be doing  \n\n  * Manage project pipeline and production support\n  * Design, build maintain modern software applications\n  * Develop REST APIs and micro services to integrate with client applications \n  * Work with Project Managers, Business Analysts and QAs teams to implement projects\n\n  \nCompensation  \n\n  * Up to 160K base salary with bonuses DoE\n\n  \nBenefits  \n\n  * Hybrid flexibility\n  * Excellent health benefits\n  * RRSP matching\n  * Eligible for annual performance based bonus program\n  * Business casual dress code\n\n  \n  \n*** Applicants must be authorized to work in Canada on a full-time basis. ***\n\n","Salary":null},{"id":"iAHWg","Title":"Windows Integrator","Entreprise":"Purple Drive Technologies LLC","Type_Employ":"Contract W2, Contract Independent","Location":"Toronto, ON","Description":"## Job Description\n\n**Role: Windows Integrator**\n\n **Canada - remote**\n\n7+ years’ experience with integration, configuration, Windows Server\n2012\/2016\/2019 – MUST\n\n• Proficient with Services\/monitoring (Windows) Active Directory, GPO, SCOM –\nMUST\n\n• General infrastructure knowledge (backup, clustering, networking,\nmonitoring) – MUST\n\n• Cloud, Infrastructure as Code, Containers - ASSET\n\n• SQL Server and IIS (INTERNET INFORMATION SERVICES) – ASSET\n\n• French and English (spoken and written)\n\n","Salary":"Depends on Experience"},{"id":"ZoIj4","Title":"Senior MERN Developer (React, Node)","Entreprise":"Motion Recruitment","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nWe're working with an established tech forward company in the capital markets\nsector; they partner with a famous fruit. They are looking to expand one of\ntheir core products and need a Senior MERN Developer to help grow the team.\nThey are open to React\/Redux heavy or Node\/TypeScript, or true full stack.\nThis is a full time, 100% remote position offering $150K DOE.  \n  \nThis opportunity is ideal for those currently leading a team unofficially and\nlooking for opportunities to move into leadership within the year. However if\nyou are more interested in moving to a staff or architect career path there is\nroom for those as well. Prior experience working in smaller environments is a\nplus however all candidates are encouraged to apply.  \nRequired Skills & Experience\n\n  * 6+ years of professional experience in software\n  * 4 years working with React, Redux and Node\n  * CI\/CD experience\n  * B.S. in Computer Science or related field\n\nDesired Skills & Experience\n\n  * Previous experience working in a start up\n  * Knowledge of capital markets field\n  * Cloud experience (AWS, Google Cloud Platform, etc)\n  * B.S. in Computer Science or related field\n\nWhat You Will Be Doing  \nTech Breakdown  \n\n  * 50% Front End (React, redux)\n  * 50% Back End (Node, Postgres, etc)\n\n  \nDaily Responsibilities  \n\n  * 65% Hands On\n  * 10% Leadership Responsibilities\n  * 25% Team Collaboration\n\nThe Offer\n\n  * Competitive Salary: Up to $160K, DOE\n\n  \nYou will receive the following benefits:  \n\n  * Medical, Dental, Vision Insurance\n  * Unlimited PTO\n  * Stock Options\n  * Bonus DOE\n  * Flexible working hours (within your team)\n  * Monthly Work Stipend\n\n  \nApplicants must be currently authorized to work in the Canada on a full-time\nbasis now and in the future.\n\n","Salary":null},{"id":"Rtcq1","Title":"Automation Tester","Entreprise":"Cynet Systems","Type_Employ":null,"Location":"Montreal, QC","Description":null,"Salary":null},{"id":"BpiBg","Title":"QA Engineer","Entreprise":"Motion Recruitment","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nQA Engineer  \n**About the job**  \n  \nA stellar opportunity to have massive impact in the banking community. As a QA\nEngineer for our organization, you will establish the foundations of QA\npractice and pave the way to ensure sustainable growth for all the features in\nour Business Unit. You will be working directly with business stakeholders to\nestablish a quality strategy and roadmap and you'll collaborate with our\nproduct development team to promote a customer-centric approach, using\nautomation whenever possible.  \n  \n**Minimum qualifications**  \n  \n• Ability to define a test strategy for all our products and put in place the\nprocesses, methods and tools to realize this strategy.  \n  \n• Solid understanding of at least one modern programming language (i.e. Java,\nPython, Scala, RoR, etc)  \n  \n• Hands-on experience with various test automation frameworks for API REST and\nMobile UI, whether in a QA or Software Development role  \n  \n• Hands-on experience with modern software QA tooling suite like Appium,\nSelenium, QTP  \n  \n• Successfully led a Software Development or QA Specialist team  \n  \n• Excelled in cross-functional teams, working fluidly with Product Managers,\nData Scientists, Software Developers, and other highly skilled specialists  \n  \n• Experience with Continuous Integration \/ Continuous Deployment environments\nand tools  \n  \n• Hand on Performance testing skills  \n  \n• A solid understanding of microservices architectures and distributed systems  \n  \n **What would your day-to-day look like:**  \n\n  * Define and continuously improve our QA strategy \n  * Drive agile adoption of best testing practices, tools and frameworks, including test automation, across the product development team \n  * Create and maintain quality dashboards and metrics\n  * Lead the QA practice across multi-disciplinary teams and support \/ coach the QA specialists\n  * Develop and own QA processes, strategy, solutions and roadmap\n  * Perform issue triage, regression testing and exploratory testing, especially in the early phases of our growth\n  * Coordinate app software releases - planning, QA, release notes\n  * Act as the customer advocate for application quality and performance\n\n  \n**Perks of working with us:**  \n\n  * Well-funded and proven startup with large ambitions, competitive salary and stock options\n  * Unlimited PTO\n  * WeWork All Access Pass OR Work-from-home stipend\n  * Entrepreneurial culture where pushing limits and taking risks is everyday business\n  * Open communication with management and company leadership\n  * Small, dynamic teams = massive impact\n  * 100% employer-paid telemedicine, medical, dental, vision, disability and life insurance plans\n  * Access to a Retirement Savings Plan\n\n","Salary":null},{"id":"hnafQ","Title":"Full Stack, AWS Software Engineers @ AWS IoT, SaaS Partner","Entreprise":"Jefferson Frank","Type_Employ":"Full Time","Location":"Vancouver, BC","Description":"## Job Description\n\n![](https:\/\/counter.adcourier.com\/YS5jaHJpc3RvcGhlbC45MjkyMS40MDczQG5pZ2VsZnJhbmsuYXBsaXRyYWsuY29t.gif)  \n  \n\nOne of our best clients is looking to hire immediately for multiple Full Stack\nDevelopers\/Engineers, Software Engineers and Cloud Developers to join their\ngrowing teams. These are expected to be fully-remote, full-time positions and\na brand new job opportunity for you to join an emerging, publically-traded AWS\nISV Partner that manufactures safety tools and develops custom SaaS solutions\nfor these products using IoT\/AI\/ML cloud technologies.\n\n  \n\nPerfect time to join a brilliant software engineering team and work closely\nwith advanced cloud technologies in a Full Stack, Platform Engineer or\nSoftware Developer capacity.\n\n  \n\n **Job Requirements, Experience Required:**\n\n  \n\n  \n\n  * 3 - 5+ years of developing scalable web applications using Java or Python in a SaaS IoT environment dealing with real-time streaming data, web portals, and analytics.\n  \n\n  * Designing, developing and owning AWS Cloud software platforms and SaaS solutions. \n  \n\n  * Supporting highly-available, highly-scalable, globally-supported cloud environments. \n  \n\n  * Hands-on with AWS (API Gateway, Lambdas, Cognito, CloudFormation, Microservices).\n  \n\n  * Familiarity with Big Data tools, data analytics pipelines in AWS.\n  \n\n  * Knowledge and passion for mainline development, CI\/CD and high-quality software.\n  \n\n  * Familiarity with the following cloud services and tech stack:\n  \n  \n\n    * Angular, Python, Java, AWS, (legacy) PHP, MySQL, RedShift, Elasticsearch, Aurora, Spark, EMR, Kinesis (Streams, Firehose, Analytics), Lambda, Docker\/Kubernetes\n  \n  \n\n  \n\n **Company, Employee Benefits:**\n\n  \n\n  \n\n  * Working with a well-established, highly-valued company with a world-class team of senior developers and software professionals to act as mentors as you develop.\n  \n\n  * Working with an array of interesting products to own and an entrepreneurial environment to thrive in.\n  \n\n  * Exposure to a wide variety of modern web technologies.\n  \n\n  * 401K Match & Annual Contribution \n  \n\n  * Excellent Employee\/Family Benefits (Medical, Dental, Health)\n  \n\n  * Unlimited PTO\n  \n\n  * Remote work capacity \n  \n\n  * Flexible Salary Compensation depending on position\/experience.\n  \n\n  \n\nIf you or someone you know is interested in this position, please send your\nresume directly to **a.christophel** **@jeffersonfrank.com** or call ******.**\n\n  \n\n  \nJefferson Frank is the global leader for Amazon Web Services recruitment,\nadvertising more AWS roles than any other agency. We deal with both AWS\nPartners & End Users throughout North America. By specializing solely in\nplacing candidates in the AWS market we have built relationships with most of\nthe key employers in North America and have a complete understanding of where\nthe best opportunities and AWS jobs are.  \n  \nJefferson Frank is acting as an Employment Agency in relation to this vacancy.\n\n","Salary":"$150000 - $200000 per annum"},{"id":"KtMao","Title":"Information Security Administrator","Entreprise":"Jobot","Type_Employ":null,"Location":"Ottawa","Description":null,"Salary":null},{"id":"dyaLh","Title":"Business Analyst","Entreprise":"Global Technical Talent","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nJob Description  \n  \n **Business Analyst**  \n  \n**Department Overview:**\n\n  * We believe in visionary leadership and insights. We believe in using every resource at our disposal to better serve our clients, and this includes our vast data.\n  * The Insurance Data & Insights group delves into our data, past and present, to develop crucial metrics and reporting functionality that better informs and optimizes key businesses decisions across the organization.\n  * This is the team building the tools, reports, dashboards, cubes and scorecards that deliver and process vital data to business partners across the enterprise.\n  * Joining us in Insurance Data & Insights is an opportunity to advance and deepen your career and to help serve our customers in a way we never have before.\n\n  \n**Job Description:**\n\n  * Are you a big picture thinker? Fantastic! This is exactly the kind of thinking of our company needs when it comes to our business intelligence support and analytics.\n  * In this role, we need you to take a holistic, high level approach to collection and reporting of data for major projects and initiatives across the company.\n  * As data's role in providing extraordinary products and services to our customers grows, we'll look to the valued expertise you'll provide in this role, to develop, adopt and evolve the best in class reporting and business intelligence capability.\n  * Does this sound like you? You're a natural leader, and can lead major initiatives and projects, joining business owners and partners to determine business needs and recommend solutions. Moreover, you have a talent for looking at a collection of data and drawing rare insights. In this role, we'll need you to include those insights and commentary within the existing reporting packages you deliver. Finally, you'll fit in well if you like to own your space and execute with speed and precision, relishing all challenges as opportunities to dig in, collaborate and take our company into the future of banking.\n\n  \n**As a Senior Business Intelligence & Reporting Analyst, you will:**\n\n  * Produce specialized reporting packages, dashboards and scorecards for businesses\n  * Lead the implementation of initiatives in support of overall business\/function strategy\n  * Conduct analysis to provide improved BI to inform management leadership team Internal\n  * Craft complex and comprehensive BI reporting packages and dashboards utilizing data infrastructure, localized datamarts and external data sources\n  * Validate the quality and integrity of the data included in all reporting\n  * Develop substantial and insightful commentary\/insights on new and existing reporting packages.\n  * Work with business partners to understand business objectives and develop valuable reporting and provide ad-hoc data extracts\n  * Understand business drivers, definitions and metrics in order to interpret findings, take action and provide relevant direction\n  * Lead the development and implementation of portfolio reporting (e.g. acquisition, attrition, portfolio growth, profitability, etc.)\n  * Provide (and may develop) complex reporting, analysis, and assessments at the functional or enterprise level\n  * Work independently as the senior analyst \/ expert and may provide technical support to others\n  * Maintain expert knowledge of all main data sources for the data used within the business unit and ability to effectively utilize these data sources for reporting purposes\n  * Ideally have or acquire knowledge of broader enterprise reporting platforms and data sources and ability to integrate data across the enterprise\n\n  \n**Job Requirements:**  \nWhat can you bring to our company? Share your most relevant experience,\ncredentials and knowledge for this role, as well as these essential\nrequirements and attributes:\n\n  * Undergraduate degree in Business, Math, Computer Science, Engineering or a related discipline\n  * The ideal candidate should have at least 5 years relevant experience\n  * Proficient with programming languages and working in various data environments (e.g. SQL, SAS, Hadoop, R, Python, etc.)\n  * Expertise using business intelligence, analytics and\/or data visualization tools (e.g. Tableau);\n  * Reporting Analyst - 4 years\n  * Exp with SAS - 3 years\n  * Exp with SQL - 4 years\n  * Exp with Hadoop based platforms\n  * Tableau experience is preferred but not required.\n\n  \n**About the Company:**  \nAs a top 10 North American bank, our client aims to stand out from its peers\nby having a differentiated brand - anchored in a proven business model and\nrooted in a desire to give its customers, communities, and colleagues the\nconfidence to thrive in a changing world.  \n  \nOur client engages in providing financial products and services. They offer\nvarious financial products and services, as well as telephone, Internet, and\nmobile banking services, retail and commercial banking services, as well as\nwealth management services. The Wholesale Banking segment provides capital\nmarkets, investment banking, corporate banking products, and investment needs\nto companies, governments, and institutions in financial markets.  \n  \n#tech  \n#LI-GW1  \n#LI-Remote\n\n","Salary":null},{"id":"fe4H3","Title":"DevOps Engineer","Entreprise":"Jobot","Type_Employ":null,"Location":"Winnipeg","Description":null,"Salary":null},{"id":"axlXc","Title":"QA Test Lead","Entreprise":"Motion Recruitment","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nQA LEAD (HYBRID)  \n  \nJob Description  \n  \nMy client is a publicly traded fortune 500 company that specializes in banking\nand credit management. For years, they've tailored innovative credit solutions\nwhich are specific to the individual needs of Canadians. By serving millions\nof people daily, to build opportunities to learn and secure a stronger\nfinancial future.  \n  \nMust have:  \n\\- 3+ years of relevant QA technical experience.  \n\\- 3-5 years of experience in testing Salesforce platform  \n\\- Extensive test process knowledge with regards to test cycles, releases and\ntest types (system, integration, end-to-end, User Acceptance Testing), and the\nSoftware Test Life Cycle  \n\\- Plan test schedules or strategies in accordance with project scope or\ndelivery dates  \n\\- Experience with Agile methodologies  \n  \nNice to have:  \n\\- Good understanding of SF architecture, concepts and SOQL (Salesforce Object\nQuery Language)  \n\\- Familiarity of database systems and SQL queries  \n\\- Proven experience in the creation of end to end test scenarios  \n  \nSoft skills:  \nStrong diagnostic, analysis, troubleshooting, problem-solving skills  \nAbility to analyze\/interpret test results and provide recommendations to\nimprove testing  \n• Strong communication skills - must be able to explain things clearly to\nproject team members  \n  \nEducation:  \nAssociate's degree in a technical field such as computer science, computer\nengineering or related field required  \n  \n **Applicants must be currently authorized to work in Canada on a full-time\nbasis now and in the future. Accommodation will be provided in all parts of\nthe hiring process as required under Motion Recruitment's Employment\nAccommodation policy. Applicants need to make their needs known in advance.**\n\n","Salary":null},{"id":"rYmOW","Title":"Consultant, Managed Security Services - Network Security focus","Entreprise":"Sirius Computer Solutions Inc","Type_Employ":null,"Location":"Mississauga, ON","Description":null,"Salary":null}]