{"id":{"0":"8Toiv","1":"ZD7u7","2":"VZCp7","3":"UZkZz","4":"qhNtK","5":"0gKR6","6":"YTmih","7":"xWPpg","8":"MtNo8","9":"FI5B5","10":"Gfwb0","11":"7aWHP","12":"tcSL5","13":"X6IIi","14":"xYM5M","15":"qGJuy","16":"R2n4h","17":"XTfRw","18":"GS0tX","19":"iv8er"},"Title":{"0":"DevSecOps Engineer","1":"Sales Representative, IT Solutions","2":"Product Manager with e-commerce","3":"JDE Finance - Business analyst","4":"Senior Salesforce Developer - Canada - 140-160k","5":"Data Integration Developer","6":"Software Developer - Java","7":"React UI Developer","8":"Salesforce Solution Architect - Canada - 170k-200k CAD","9":"QUMAS \/ GxP Compliance Consultant","10":"Senior JD Edwards Business Analyst","11":"Senior Software Developer","12":"DevOps Engineer","13":"Cloud Specialist","14":"Senior R&D Engineer (C++ Software Developer)","15":"#2021-D-0035 Software Developer","16":"Java Spring Full Stack Developer","17":"Java React Developer - Remote \/ Telecommute","18":"Scrum Master","19":"Adobe Campaign Manager\/Business Analyst"},"Entreprise":{"0":"Atos Syntel Inc.","1":"Thoughtfocus","2":"K-Tek Resourcing LLC","3":"Systems Recruiters, LLC","4":"Mason Frank","5":"Global Technical Talent","6":"Global Technical Talent","7":"Cynet Systems","8":"Mason Frank","9":"Cynet Systems","10":"Epiq Infotech LLC","11":"Jobot","12":"Datamatics Global Services, Inc.","13":"Cynet Systems","14":"Jobot","15":"Invidi Technologies Corp","16":"Cynet Systems","17":"Cynet Systems","18":"Atos Syntel Inc.","19":"Mastech Digital"},"Type_Employ":{"0":"Full Time","1":"Full Time","2":"Contract W2, Contract Independent, Contract Corp-To-Corp, 6 Months","3":"Full Time","4":"Full Time","5":"Full Time","6":"Full Time","7":null,"8":"Full Time","9":null,"10":"Full Time","11":null,"12":"Contract W2, Contract Independent, Contract Corp-To-Corp","13":null,"14":null,"15":"Full Time","16":null,"17":null,"18":"Full Time","19":null},"Location":{"0":"Toronto, ON","1":"Toronto, ON","2":"Vancouver, BC","3":"Brampton, ON","4":"Toronto, ON","5":"Toronto","6":"Toronto","7":"Toronto, ON","8":"Toronto, ON","9":"Mississauga, ON","10":"Markham, ON","11":"Vancouver","12":"Toronto, ON","13":"Toronto, ON","14":"Vancouver","15":"Edmonton","16":"Toronto, ON","17":"Toronto, ON","18":"Markham, ON","19":"Toronto, CDA"},"Description":{"0":"## Job Description\n\n**Role :** **DevSecOps Engineer  \n** **Location : Toronto, ON  \n** **Hire Type : Full-Time with Atos Syntel  \n**\n\n **Description:**\n\n  * Good Knowledge of Devsecops Process and implementation of CI\/CD pipeline by leveraging jenkins to build scripts that will automate GIT SECRETS, SSL Checker, TruffleHog, OWASP Dependency Checker, Static & Dynamic tools\n  * Build end to end secure Devsecops pipeline\n  * Integration & troubleshooting of Devsecops Tools in the SDLC Lifecycle\n  * Perform merge requests and reviews using Github and other Devsecops tools\n  * Support Devsecops pipeline that will perform quality assurance and validation\n  * Good Knowledge of AWS\/Azure Devsecops pipelines\n  * AKS Azure Kubernetes exp\n  * Using Kubernetes to orchestrate the deployment, scaling and management\n\n","1":"## Job Description\n\n**Job description:**\n\nThis role is hunting into new accounts for Thought Focus. We are looking for a\nSales associate who can open doors for new opportunities in the marketplace\n(west coast).\n\n **Role:**\n\n  * 3-4 years of relevant business development experience selling IT services.\n  * Must have demonstrated ability to sell and build relationships with C-Level executives\n  * Demonstrate the ability to build and expand on new relationships\n  * Must have a working knowledge of the global delivery model.\n  * Identifying prospective clients & create the go-to-market plan for the identified territory & industry vertical.\n  * Generating business from new accounts\n  * Building credibility and gaining market share in the territory and make their way in for new areas of growth with our customers\n  * Ability to lead clients in defining their digital transformation journey, identifying opportunities for business, lead conversations\n  * Be able to work well with internal stakeholders.\n\n","2":"## Job Description\n\nHi,\n\nHope you’re doing good !!\n\nI am **Ritu** from **K-Tek Resourcing** , having an excellent job opportunity.\n\nPlease go through the below mentioned Job Description and send your updated\nresume if you are interested in this position at [Ritu.tiwari\n_@ktekresourcing.com_](https:\/\/mail.google.com\/mail\/u\/0\/#SignatureSanitizer_inbox\/_blank)\nor give me a call at **.**\n\n  * **Job Position :** **Product Manager with e-commerce**\n  *  **Location :** **** **Vancouver, Canada**\n  *  **Type :** **contract**\n\n  *  **Job Description:**\n\nWe are looking for candidates with the below experience:\n\n  * Experience in Ecommerce marketplaces e.g.: Amazon, Shopify, eBay, or Etsy.\n  * Experience with Fraud, trust, security areas for ecommerce\n  * Understanding of Payments and cross-border payments for shopping \/ retail industry\n  * Ability to define product requirements related to Payments, Fraud, Security for ecommerce sites\n  * Ability to work across teams\n  * Technical Ability to work with engineering teams\n  * Analytical and data driven \n  * Experience in onboarding sellers - seller management, seller support\n\nSome more points for Vancouver,\n\n  * Candidate to be based out of Vancouver, BC\n  * Required experience – Experience in cash backs, credit cards and payments – Fintech industry experience\n  * Preferred experience –Worked in mobile applications\n\nThe Shopping and Commerce Team brings in insatiable curiosity, challenging\nitself to re-imagine what is and what can be accomplished with our products\nand services.\n\nWe are helping to shape the future of shopping and commerce with the latest\nset of powerful consumer services and solutions across a variety of formats to\ndelight our customers.\n\nOur team is looking for a highly skilled and passionate individual to help\nevangelize features in our consumer facing Shopping & Commerce solutions.\nWorking closely with the rest of our development team you will identify,\ndesign, prioritize and drive new features\/capabilities on innovative and novel\nopportunities for this business.\n\nd mobile shall be an additive advantage.\n\n **Core Responsibilities:**\n\n\\- Drive analysis and support for investment decisions through market and\ncompetitive research\n\n\\- Understand unexpressed user needs and turn those into products and features\n\n\\- Identify, design, prioritize and drive new features and capabilities to\nhelp create break-through end-user experiences\n\n\\- Work closely with your feature crews throughout the engineering lifecycle\n\n **We Value:**\n\n\\- Ability to build comprehensive and compelling presentation and\ncommunication materials that span functions and groups  \n\\- Strong communication skills including ability to distill information into\nconcise communication materials\n\n\\- Strong product management skills and ability to lead high-profile projects\nof varying timelines simultaneously with feature crews and product teams\n\n **We Require:**  \n\\- Minimum 2 years experience of pure Product Management experience at a\nconsumer-facing software product organization\n\n","3":"## Job Description\n\nJob Description: My client is seeking candidates with significant experience\nwith JDE modules (GL, AP, and Purchasing) to provide ongoing end-user support,\nand lead continuous improvement projects, and further expansion of their\nProcure to Pay focused applications.\n\nThe Business Analyst proactively works with user communities and leads\nprojects to improve business processes, and delivers solutions, all while\nmaintaining a focus on quality customer service.\n\nThe successful candidate will bring a strong Business System Analyst knowledge\nof EnterpriseOne JDEdwards 9.1 or higher as well as functional Finance or\nAccounts Payable expertise from previous roles within the business. Proven\ntechnical skills to design integrations to other systems from JDE.\n\nThis position is onsite and is base din Edmonton AB or Brampton ON  \n  \n---  \n  \n.\n\n","4":"## Job Description\n\n![](https:\/\/counter.adcourier.com\/YS5mcmVzc2xlLjgzOTQwLjQwNzNAbmlnZWxmcmFuay5hcGxpdHJhay5jb20.gif)  \n  \n\n**REQUIREMENTS**\n\n  \n\n  \n\n  * 2-3 full life cycle Salesforce implementations\n  \n\n  * Salesforce Platform Developer I, Developer II or Any architecture certifications are strong asset.\n  \n\n  * Experience with one or more of the salesforce clouds: Sales, Service, Experience (Formally Community cloud).\n  \n\n  * -Experience building Custom UI with Aura components or LWC.\n  \n\n  * -Hands on experience with SFDX, GIT and CI\/CD.\n  \n\n  \n\n  \n\nAs a solution specialist, you are responsible for\n\n  \n\n  \n\n  * Solution Design, development and Delivery.\n  \n\n  * Act as the Subject Matter Expertise for Salesforce development (OOTB and Custom).\n  \n\n  * Work closely with business stakeholders, business analysts, implementation partners and integration\/development, and quality assurance teams.\n  \n\n  * Peer Review Code, Recommend and follow Best practices.\n  \n\n  * Will be doing more of the coding, delivery of the Salesforce, and integration development\n  \n\n  \n\n  \n **Benefits**\n\n  \n\n  \n\n  * Working for a leading globally known Salesforce consultancy!\n  \n\n  * Fully remote + PTO + Benefits\n  \n\n  * Great work life balance\n  \n\n","5":"## Job Description\n\nJob Description  \n  \n**Data Integration Developer**  \n  \n**Job Description:**\n\n  * The Solutions Developer is part of the Corporate Platform - Retail Risk Management Data Mart team within the Corporate Platform RRMDM group of our client Canada Trust. \n  * Reporting to the Manager Development, this role is responsible for developing data and reporting solutions to support the data infrastructure management. \n  * This position must work proactively and effectively with the Risk Management group, business partners, and technology business partners to provide support and expertise in data management and business intelligence initiatives. \n\n  \n**Job Responsibilities:**\n\n  * The Data Integration Developer will deliver effective and efficient solutions by meeting key project milestones and overall project deliverables on time, and adhering to development and quality standards \n  * Support the tracking and the reporting of decision models and strategies through the creation of databases and management reporting \n  * Improve the infrastructure necessary to develop and implement effective predictive models and decision strategies \n  * Data Integration Developer will develop and document data-mart developments\/enhancements including System Test Plans and Production Acceptance Test Plans for new and modified systems based on technical and business specifications \n  * Comply with the system development life cycle (SDLC) and project management methodology (PMLC) by participating in scope assessment, risk and cost analysis \n\n  \n**Nice to Haves:**\n\n  * Experience in TALEND is an asset \n  * Experience and expertise in Tableau driven dashboard design is an asset \n  * Work well independently as well as within a team \n  * Proactive, organized, excellent analytical and problem-solving skills \n  * Flexible and willing to learn, a can-do attitude is key \n  * Strong verbal and written communication skills \n\n  \n**Must Haves:**\n\n  * Deliver effective and efficient solutions by meeting key project milestones and overall project deliverables on time, and adhering to development and quality standards \n  * Support the tracking and the reporting of decision models and strategies through the creation of databases and management reporting \n  * Improve the infrastructure necessary to develop and implement effective predictive models and decision strategies \n  * Develop and document data-mart developments\/enhancements including System Test Plans and Production Acceptance Test Plans for new and modified systems based on technical and business specifications \n  * Comply with the system development life cycle (SDLC) and project management methodology (PMLC) by participating in scope assessment, risk and cost analysis \n\n  \n**Note:**\n\n  * Financial industry exposure will be better. Who has worked in big data warehouse environments? \n\n  \n**About The Company:**  \nAs a top 10 North American bank, our client aims to stand out from its peers\nby having a differentiated brand - anchored in a proven business model and\nrooted in a desire to give its customers, communities, and colleagues the\nconfidence to thrive in a changing world.  \n  \nOur client engages in providing financial products and services. They offer\nvarious financial products and services, as well as telephone, Internet, and\nmobile banking services, retail and commercial banking services, as well as\nwealth management services. The Wholesale Banking segment provides capital\nmarkets, investment banking, corporate banking products, and investment needs\nto companies, governments, and institutions in financial markets.  \n  \n#LI-Hybrid  \n#LI-GW1  \n#tech\n\n","6":"## Job Description\n\nJob Description  \n  \n**Software Developer - Java \/ Senior Engineer**  \n  \n**Job Description:**\n\n  * The team is looking for a Senior Engineer to work on a new funding management platform as part of a project for the dealer to optimize our funding expenses. \n  * The role will be based in Toronto and will be part of a new product team based in Toronto. \n  * The successful candidate would be responsible for Java server-side development on a new calculation engine and data service to drive a web-based UI. \n  * The role will be highly visible to senior executives as the product will be used by senior business users and the P&L impact from this application will be significant. \n\n  \n**Must-Have:**\n\n  * 5+ years of experience using Java along with test-driven development \n  * The The Software Developer - Java must have working experience with MS SQL Server \n  * Working experience with MS SSIS (Integration Services), .NET and store procedures \n  * Jira\/Bitbucket\/Confluence to collaborate \n  * Database: SQL Server and Oracle \n  * Middleware: .NET (SSIS) and Java \n  * The Software Developer - Java must have Frontend: JSP \n\n  \n**Nice To Have:**\n\n  * 3+ years of experience using Spark and other HDP components (Kafka, Druid, HDFS, etc.) Experience \n  * 3+ years of experience using JavaScript with React or any other similar UI libraries (nice to have) \n  * Good understanding of Financial Products - FX, Securities (FI\/EQ), Commodities, EQ\/FI Derivatives, Secured Finance Transactions (nice to have) \n\n  \n**Note:**\n\n  * Fixed income\/FX experience; capital markets experience; technically proficient; knows core java very well; good team player; working with. \n\n  \n**About The Company:**  \nAs a top 10 North American bank, our client aims to stand out from its peers\nby having a differentiated brand - anchored in a proven business model and\nrooted in a desire to give its customers, communities, and colleagues the\nconfidence to thrive in a changing world.  \n  \nOur client engages in providing financial products and services. They offer\nvarious financial products and services, as well as telephone, Internet, and\nmobile banking services, retail and commercial banking services, as well as\nwealth management services. The Wholesale Banking segment provides capital\nmarkets, investment banking, corporate banking products, and investment needs\nto companies, governments, and institutions in financial markets.  \n  \n#tech  \n#LI-Remote  \n#LI-GW1\n\n","7":null,"8":"## Job Description\n\n![](https:\/\/counter.adcourier.com\/YS5mcmVzc2xlLjk1NTUzLjQwNzNAbmlnZWxmcmFuay5hcGxpdHJhay5jb20.gif)  \n  \n\nWhat will your typical day look like?\n\n  \n\nAs a Salesforce Architect, you will:\n\n  \n\n  \n\n  * Drive successful and winning Salesforce solutions for our clients\n  \n\n  * Act as key contact for estimating and project scope\n  \n\n  * Liaise with clients for estimation, technical design, project status, etc.\n  \n\n  * Architect, Design and be accountable for the development of solutions\n  \n\n  * Develop reference architectures and end to end industry based productivity scenarios\n  \n\n  * Identify suitable solutions within the Salesforce ecosystem\n  \n\n  * Understand the roadmap of Salesforce products and the major releases within each\n  \n\n  * Act as a billable resource on engagements where complex design needs to be managed throughout the project\n  \n\n  * Understand at a high level how various products within the Salesforce ecosystem should be utilized\n  \n\n  * Understand at a high level the Deloitte Salesforce product offerings\n  \n\n  * Understand at a high level the more popular or commonly used apps within the Salesforce appexchange\n  \n\n  * Understand how Salesforce Cloud features, apps or products interact with each other\n  \n\n  * Participate in project retrospectives to understand what worked and didn't work from a solution perspective\n  \n\n  \n\nAbout the team\n\n  \n\nThe Salesforce Architect is responsible for translating customer requirements\ninto an architecture and design that will ultimately constitute the blueprint\nfor the solution. This role is ultimately responsible for ensuring the\ndelivery team delivers consistent and efficient results to the customer. The\nSolution Architect will be the main point of contact for the sales and\ndelivery teams for project design for any Salesforce implementations utilizing\nany custom solution.\n\n  \n\nEnough about us, let's talk about you\n\n  \n\nAs a Salesforce Architect, you will have :\n\n  \n\n  \n\n  * A post-secondary degree or certificate\n  \n\n  * 7+ years of experience in a senior development role\n  \n\n  * Experience with producing conceptual and logical architecture diagrams\n  \n\n  * Proven leadership skills, including effective coaching of other team members and demonstrated experience working with clients\n  \n\n  * Experience estimating project work and creating appropriate roadmaps and leading technical projects through to execution\n  \n\n  * Excellent communication and strong interpersonal skills to facilitate meetings and complex concepts\n  \n\n  * Experience working in an agile software development as well as extensive experience with [Salesforce.com](https:\/\/salesforce.com\/)\n  \n\n  * Understanding of CRM solutions and how they translate into business impact\n  \n\n  * Thorough understanding of what may drive business priorities, strategy and direction, and what may drive customer business needs\n  \n\n  * Excellent problem solving, troubleshooting skills and ability to prioritize tasks effectively with a high level of attention to details\n  \n\n  \n\n **Benefits**\n\n  \n\n  \n\n  * Working for a globally known Salesforce consultancy\n  \n\n  * Fully remote!\n  \n\n  * PTO + Benefits\n  \n\n  * Work life balance\n  \n\n","9":null,"10":"## Job Description\n\nThe JD Edwards Business Analyst provides analytical and technical expertise in\nimplementing, designing, developing, supporting, and\/or analyzing solutions\nfor customers through an appropriate blending of business and technical\nknowledge. Participate in the implementation and development of solutions\nusing expertise for problems to include maintenance, modification, or\ndevelopment of inter-related applications\/solutions. Solutions link technical\nknowledge with business solutions and may range from consulting services\n(software recommendations) to developing integrated-automated systems.\nResponsible for providing functional, technical assistance and support for ERP\nsoftware. Duties include customer needs assessments as well as evaluating\nsoftware requirements.\n\nResponsible for the design and support of JD Edwards and other related ERP\nSoftware. Maintain strong working relationships with customers by listening,\nunderstanding, and responding to identified needs. Ability to present\ninformation to individuals or groups; deliver presentations suited to the\ncharacteristics and needs of the audience. Align personal efforts and outcomes\nto achieve long-range goals to meet the vision of the organization.\n\nDuties & Responsibilities\n\n  * Ensure the security and confidentially of all information managed by the Information Technology department in support of the company’s operations.\n  * Ensure the ongoing protection and integrity of the information systems, technology assets, and artifacts of the company.\n  * Analyze Tier 1 & 2 business requirements; perform process analysis of customer activities to determine business solutions or process improvement opportunities across business functions and recommend solutions. Oversee and assist with the gathering and documentation of requirements. Develop and maintain comprehensive documentation of business requirements.\n  * Assess reported issues, provide regular and timely incident updates and work to drive them to closure\n  * Create working procedures, build up knowledge databases, and functional documentation\n  * Develop functional requirements and system design specifications that align with proposed or existing business solutions. Work with developers to ensure optimal solution delivered.\n  * Implement enhancements, change requests, break-fixes, patches and updates. Develop test plans, test, coordinate user acceptance testing (UAT), and approve changes to ensure alignment with business objectives and test plans. Develop and deliver end-user training materials as well as document solutions.\n  * Communicate software updates and changes to affected stakeholders.\n  * Contribute to the development of project plans, participate, lead, assign and monitor tasks when required.\n  * Ability to meet deadlines, control scope, and identify and manage project risks. Provide regular updates on task completions, issue resolution, system readiness, and other metrics identified.\n  * Liaise with management, functional leaders, department heads, and end-users to ensure system functionality meets business requirements.\n  * Apply working knowledge of the organization's roles and relationships, as well as utilize available resources to resolve issues.\n  * Pursue new knowledge on a continuous basis and implement best practices of the profession.\n  * Articulate technical knowledge in a language that is understandable and appropriate for users.\n  * Train and mentor junior team members\n\nCompetency Requirements\n\n  * Maintains a professional demeanor at all times with fellow employees, vendors, sub-contractors, and clients\n  * Ability to cope under pressure and maintain focus, dealing effectively with setbacks while remaining positive\n  * Portrays a positive image and motivates colleagues at all times to ensure continued success\n  * Embraces change and are always willing to adopt new practices\n  * Holds self and others accountable\n  * Ability to approach problems logically, under pressure, and seek innovative solutions\n  * Communicates effectively (verbally and written) at all levels within an organization and with external parties including enforcing authorities\n  * Understands the needs and perspectives of both internal and external customers\n  * Promotes teamwork and collaboration\n  * Values and respects others encourages and supports diversity\n  * Ability to work independently with limited supervision\n\nEducation & Skill Requirements\n\n  * Post-secondary education preferably in the field of business, finance, computer science, or software engineering\n  * Minimum of 5 years of JD Edwards (JDE) support and business analysis experience\n  * Government Services Canada (PWGSC) clearance at the Secret level preferred OR alternatively must be able to obtain Secret level clearance upon commencing employment\n  * Knowledge of finance, construction, service, or facility management\n  * Ability to multi-task and work in a fast-paced environment\n  * Excellent written and oral knowledge of English\n  * French-speaking is considered an asset\n  * Excellent communication, documentation, planning, prioritization, organization, and interpersonal skills\n  * A customer-first attitude to maintain and improve satisfaction\n  * Ability to work effectively in a goal-oriented team environment\n  * Ability to quickly grasp, articulate, and document complicated business and technical issues\n  * Advanced knowledge of all standard PC software applications (e.g., Microsoft Office Suite, SharePoint, Lync, etc.) and Microsoft Project, Visio, or equivalent other mapping or planning tools.\n  * Lean Six Sigma or other process improvement certifications\/experience would be an asset.\n\nDue to many mandatory vaccination requirements at client projects\/facilities,\nin order to provide substantial employment by ensuring compliance with our\nclient's mandates, the successful candidate may be required to validate full\nvaccination prior to hire.\n\n","11":null,"12":"## Job Description\n\n**Fulltime \/ Contract**\n\n **Remote role - Toronto, ON**\n\n**NOTE - ONLY LOOKING FOR CANADA CANDIDATES.**\n\n**\\-----------------------------------------------------------------------------**\n\n **What You’ll Do**\n\no Automate the platform provisioning process to enhance DevOps culture in\ndevelopment teams.\n\no Oversee continuous delivery and integration pipelines to maximize\nproductivity.\n\no Design, implement, maintain, and support platform services associated with\nthe CI\/CD pipelines.\n\no Configure monitoring and alerting systems for the applications and platform\nservices.\n\no Monitor site stability and performance and troubleshoot platform issues.\n\no Identify and proactively solve problems to ensure a seamless experience for\nour clients.\n\n**What You Know**\n\no Need 8 years of experience as a CI\/CD DevOps Engineer.\n\no Good experience in Shell scripting, GitHub, Artifactory, configuration\nmanagement, Gradle, maven, etc.\n\no Hands-on experience in Jenkins or any equivalent CI tool.\n\no Strong experience in Continuous Deployment experience using Kubernetes and\nDocker.\n\no Experience in SRE support for client product teams.\n\no Experience in Infrastructure as a code using Terraform\n\no Need experience in providers (AWZ, Azure, Google Cloud Platform)\n\n","13":null,"14":null,"15":"## Job Description\n\nSoftware Developer  \n  \nLocation: Corporate Office - Edmonton, AB  \n  \nWho we are:  \n  \nINVIDI Technologies is the world's leading developer of software transforming\ntelevision all over the world. Our two-time Emmy® Award-winning technology is\nwidely deployed by cable, satellite, and telco operators. We provide a device-\nagnostic solution delivering ads to the right household no matter what program\nor network you're watching, how you're watching, or whether you're in front of\nyour TV, laptop, cell phone or any other device. INVIDI created the multi-\nbillion-dollar addressable television business that today is growing rapidly\nglobally.  \n  \nINVIDI is right at the heart of the very exciting and fast-paced world of\ncommercial television; companies benefiting from our software include DirecTV\nand Dish Network, networks such as CBS\/Viacom and A&E, advertising agencies\nsuch as Ogilvy and Publicis, and advertisers such as Chevrolet and Verizon.  \n  \nINVIDI's world-class technology solutions are known for their flexibility and\nadaptability. These traits allow INVIDI partners to transform their video\ncontent delivery network, revamping legacy systems without significant capital\nor hardware investments. Our clients count on us to provide superior\ncapabilities, excellent service, and ease of use.  \n  \nThe goal of developing a unified video ad tech platform is a big one and the\nright developers--like you--flourish in INVIDI's creative, inspiring, and\nsupportive culture. It is a demanding, high-energy, and fast-paced\nenvironment. INVIDI's developers are self-motivated quick studies, can-do\nindividuals who embrace the challenge of solving difficult and complex\nproblems.  \n  \nAbout the role:  \n  \nYou'll be contributing to INVIDI's SaaS solution that provides targeted\nadvertising for online streaming platforms. In addition to this core service,\nyou will help shape the technology powering INVIDI's overall monitoring\nsolution that allows customers to gain insights into their campaigns.  \n  \nWe're agile, with a dedicated Scrum Master, whose only job is to make sure we\nhave everything we need to keep focused on our tasks. We strive to choose the\nbest tool for the job and we're looking for people who love to learn fast and\nget things done. We are supported by a great SRE team and prefer to use shared\ncommon tooling.  \n  \nKey Responsibilities:  \n\n  * You will design, develop, deploy and operate backend services in Kotlin or Java that are scalable, durable and performant. \n  * You will collaborate closely with peers and product owners in an autonomous, cross-functional team. \n  * You will help other team members grow as engineers through code review, pairing, and mentoring. \n  * You will drive and run major initiatives cross-team and locations \n  * Strong experience working within Agile methodology and a Scrum environment. \n  * As a part of the DevOps team, you will be on-call for the services that the team owns. You are on-call for one week, approximately once per month. While On-call, you are required to be reachable by telephone and able to act upon alarm using your laptop. \n\n  \nOur Requirements:  \n\n  * You have a degree in Computer Science or equivalent \n  * You have 3+ years of backend engineering experience \n  * You are an outstanding Java\/Kotlin developer who loves to develop distributed high volume systems. \n  * You care about the craft and cherish the opportunity to work with smart, supportive, and highly motivated colleagues. \n  * You like to learn new things, mentor, and share knowledge with team members. \n  * Deep understanding of object-oriented design, data structures and analytics, and algorithms. \n  * Experience working with database technologies such as PostgreSQL, TSQL, DynamoDB, Redis .   \n\n  \nHighly Preferred:  \n\n  * Industry knowledge of big data and distributed systems. \n  * Build tools such as Maven. \n  * Containerization with Docker and Kubernetes. \n  * Developing and deploying RESTful web services. \n  * Cloud experience with Google Cloud Platform and AWS and their services. \n  * Infrastructure as code, Cloud\/Kubernetes configurations \n\n  \n  \nINVIDI offers competitive benefits and total rewards:  \n\n  * Paid Time Off (PTO) Vacation \n  * Company Holidays \n  * Medical & Prescription \n  * Dental & Vision \n  * RRSP, STD, LTD, AD&D and Life \n  * Corporate Discounts \n  * Tuition Reimbursement Program \n  * Employee Referral Bonus Program \n\n  \n  \nPhysical requirements:  \n\n  * INVIDI is a conscious, clean, well-organized, and supportive office environment. \n  * Prolonged periods of sitting at a desk and working on a computer are normal. \n\n  \n  \nNote:  \n\n  * INVIDI is working 100% remotely until a return-to-office date is determined. \n  * All candidates must pass compliance background screening and drug testing. \n  * Visa sponsorship is not available for this position; you must be legally authorized to work in Canada. \n\n  \n  \nAt INVIDI we don't just accept differences-we celebrate diversity, we support\nit, and we thrive on it for the benefit of our employees, our products and our\ncommunity. INVIDI is proud to be an equal opportunity employer. We are\ncommitted to equal employment opportunity regardless of race, color, ancestry,\nreligion, sex, national origin, sexual orientation, age, citizenship, marital\nstatus, disability or gender identity consistent with legal requirements.\nINVIDI welcomes veterans. If you have a disability or special need that\nrequires accommodation, please let us know by email at: .\n\n","16":null,"17":null,"18":"## Job Description\n\n**Role : Scrum Master  \n** **Location : Markham, ON, Canada  \n** **Hire Type : Full-Time with ATOS Syntel**\n\n **Responsibilities:**\n\n  * Experience working with scrum team in using Agile methodology and scrum practices\n  * Helping the product owner and development team to achieve customer satisfaction\n  * Remove impediments and coach the scrum team on removing impediments\n  * Help the scrum and development teams to identify and fill in blanks in the Agile framework\n  * Resolve conflicts and issues that occur\n  * Help the scrum team achieve higher levels of scrum maturity\n  * Should be able to understand technical life cycle of the product and technology to better gel and understand team.\n\n","19":null},"Salary":{"0":"Depends on Experience","1":"Depends on Experience","2":"$50 - $80","3":"$100,000 - $110,000","4":"$105092.40 - $105843.06 per annum","5":null,"6":null,"7":null,"8":"$135118.80 - $135869.46 per annum","9":null,"10":"$40,000 - $100,000","11":null,"12":"Depends on Experience","13":null,"14":null,"15":null,"16":null,"17":null,"18":"Depends on Experience","19":null}}