{"id":{"0":1.0,"1":2.0,"2":3.0,"3":4.0,"4":5.0,"5":6.0,"6":7.0,"7":8.0,"8":9.0,"9":10.0,"10":11.0,"11":12.0,"12":13.0,"13":14.0,"14":15.0,"15":16.0,"16":17.0,"17":18.0,"18":19.0,"19":20.0},"Title":{"0":"Full Stack Developer","1":"Solutions Developer","2":"Senior React Software Engineer","3":"Quality Engineer","4":"IT Recruiter","5":"Senior Quality Engineer","6":"Software Developer","7":"IBM Cognos Developer","8":"Business Analyst IT","9":"System Test Analyst","10":"Senior .NET Software Engineer - Remote (Canada)","11":"Senior Silicon Design Engineer","12":"Infor LN Business Analyst","13":"Application Production Support Specialist","14":"Senior Agile Engineer (Remote position)","15":"EDRMS Administrator","16":"Android Engineer","17":"AWS Full Stack Software Developer","18":"C++, software optimization engineer","19":"Java Developer"},"Entreprise":{"0":"Global Technical Talent","1":"Global Technical Talent","2":"Motion Recruitment","3":"Cynet Systems","4":"SPECTRAFORCE TECHNOLOGIES Inc.","5":"BCforward","6":"Global Technical Talent","7":"Cynet Systems","8":"Bath Fitter","9":"Myticas Consulting","10":"Infinity Consulting Solutions","11":"Cynet Systems","12":"FRG Technology Consulting","13":"TekWissen LLC","14":"Emerson Climate Technologies, Inc.","15":"Cynet Systems","16":"Motion Recruitment","17":"Jobot","18":"Jobot","19":"Cynet Systems"},"Type_Employ":{"0":"Full Time","1":"Full Time","2":"Full Time","3":null,"4":"Contract W2, 6 Months","5":"Contract W2, 12 Months","6":"Full Time","7":null,"8":"Full Time","9":"Full Time","10":null,"11":null,"12":"Full Time","13":"Contract W2, 12 Months","14":"Full Time","15":null,"16":"Full Time","17":null,"18":null,"19":null},"Location":{"0":"Toronto","1":"Toronto","2":"Toronto","3":"Toronto, ON","4":"Toronto, ON","5":"Mississauga, ON","6":"Toronto","7":"Toronto, ON","8":"Terrasse-vaudreuil, QC","9":"Ottawa","10":"Sherbrooke, QC","11":"Markham, ON","12":"Orillia, ON","13":"Montral, Qubec","14":"Montreal, INT","15":"Mississauga, ON","16":"Toronto","17":"Vancouver","18":"Toronto,","19":"Toronto, ON"},"Description":{"0":"## Job Description\n\nJob Description  \n  \n**Full-Stack Developer**  \n  \n**Summary**\n\n  * The main function of a Full stack developer (Other Specialty) is to design, develop, and implement applications using in-demand languages and technologies (e.g. - WebSphere, Informatica, etc.) to support business requirements. \n\n  \n**Job Responsibilities:**\n\n  * The Full-stack developer will need to analyze highly complex business requirements; generate technical specifications to design or redesign complex software components and applications \n  * The Full-stack developer will act as an expert technical resource for modeling, simulation, and analysis efforts Leverage industry best practices to design, test, implement and support a solution \n  * Assure quality security and compliance requirements are met for supported area Be flexible and thrive in an evolving environment \n  * Adapt to change quickly and adjust work accordingly in a positive manner \n\n  \n**Qualifications:**\n\n  * Bachelor's degree in a technical field such as computer science, computer engineering, or a related field required 2-4 years of experience required \n  * Development experience in needed language or technology (e.g. - WebSphere, Informatica, etc.) \n  * Hands-on experience in designing, developing, and successful deployment of large scale projects from end-to-end \n  * Hands-on experience in following the iterative and agile SDLC \n\n  \n**Must-Have:**\n\n  * Full Stack developer - 2-4 year \n  * Exp in Java - 2-3 years \n  * Exp with Angular - 1year \n  * Agile \n\n  \n**Nice to have**\n\n  * Node.js \n  * Database - MS SQL, SQL server \n  * Virtual environment \n  * Github, Jenkins \n  * Jira \n\n  \n**About the Company**\n\n  * As a top 10 North American bank, our client aims to stand out from its peers by having a differentiated brand - anchored in a proven business model and rooted in a desire to give its customers, communities, and colleagues the confidence to thrive in a changing world. \n\n  * Our client engages in providing financial products and services. They offer various financial products and services, telephone, Internet, and mobile banking services, retail and commercial banking services, and wealth management services. The Wholesale Banking segment provides capital markets, investment banking, corporate banking products, and investment needs to companies, governments, and institutions in financial markets. \n\n  \n#Tech  \n#L1-GW1  \n#L1-Remote\n\n","1":"## Job Description\n\nJob Description  \n  \n**Solutions Developer**  \n  \n**Key Accountabilities**\n\n  * Responsible for developing microservices\/APIs based Fraud Integration Platform solution design to modernize the Canadian Fraud Detection portfolio \n  * Utilize the latest in client technologies for best-in-class detection and scaling capabilities to meet enterprise needs \n  * The Solutions Developer will participate in requirements, design, and architecture reviews to understand product capabilities and end-to-end functionality. \n  * Accountable for applications\/systems development, programming \/coding ranging from highly complex and multifaceted, performing unit\/component test for new application development \n  * Utilize appropriate tooling for the DevOps pipeline for code promotion \n  * Adhere client's standard security coding practices to ensure the application is free of most common coding vulnerabilities and conduct scans to identify and address issues \n  * Provide input into work estimates for upcoming sprints related to the development components, contributing to the overall project plan by working with relevant team members\/stakeholders \n  * Produce high quality functional, technical, and user interfaces that are aligned to target state architecture taking into consideration business, Enterprise Architecture, system performance, and development standards\/requirements \n  * Consult on the development of User Story creation & Story Refinement \n  * Respect the client's technology delivery practices and standards, project management disciplines, business technology architecture, and risk and production capacity - this includes thorough project requirements, documentation, scope estimates, and costs. \n  * The Solutions Developer will deliver effective and efficient solutions by meeting milestones and ensuring project deliverables are on time, within budget, and adhere to the corporate quality and security standards \n  * Complete code walkthroughs with design team members\/peers to address quality, standards compliance, reusability and ease of maintenance, Operational Readiness Reviews, and support gating \n  * Support knowledge management processes and ensure knowledge is codified, monitored, tracked, and managed \n  * Identify and address any issue that affects the integrity of the application ( e.g. cross-capability\/release issues) \n  * Correct and re-test defects identified during each testing cycle \n  * Provide technical expertise in support of promptly resolving escalated incidents\/outages \n  * Communicate with key stakeholders about any issues that may impact other areas of the project and resolve or escalate issues as required \n  * Support business inquiries and business activities through execution of small enhancements and break\/fix implementations (e.g. source code changes) \n  * Ensure both state-of-health monitoring and monthly SLA targets are in place and are being met \n  * Continuously enhance knowledge\/expertise in own area and keep current with leading-edge technologies, emerging trends\/developments and grow knowledge of the business, applications, infrastructure, analytical tools, and techniques \n  * Prioritize and manage own workload in order to deliver quality results and meet timelines as assigned \n  * The Solutions Developer will support a positive work environment that promotes service to the business, quality, innovation, and teamwork and ensures timely communication of issues\/ points of interest \n  * Prepared to obtain knowledge of the business, technical environment, standards, processes, procedures, programming languages, and operating systems \n  * Performs complex to difficult technical tasks independently \n  * Advanced knowledge of technology, tools, various programming languages, processes, and procedures \n\n  \n  \n**What can you bring to the Client? It helps if you have:**\n\n  * Undergraduate degree or Technical Certificate and\/or 5+ years of relevant experience \n  * Graduate Degree preferred \n\n  \n**Nice to Have:**\n\n  * OAuth and Event-Driven messaging, Postman, O\/S (Windows, Linux), prior FI experience \n  * Readiness and motivation to work both autonomously and under the guidance of senior design\/development team members on development activities and ability to provide guidance to junior development resources \n  * Extensive knowledge of the business, broader organization, technical environment, standards, processes, tools, procedures, multiple programming languages, operating systems, solutions design, and other relevant technology areas from a development\/support perspective \n  * Provide key subject matter expertise; counseling clients and project teams on multiple aspects of development issues \n  * Key subject matter expert who consults with and may lead clients and\/or project teams on multiple aspects of development issues \n  * Works as the senior or lead developer and coaches\/guides team members within their area of expertise \n  * Public cloud experience \n  * SQL\/ Database \n  * Jboss scripting \n  * O\/S (Windows, Linux \n  * FI experience \n\n  \n**Must-Have:**\n\n  * Java \n  * Spring\/Springboot \n  * REST API - JAVA \n  * Confluent Kafka, VMC cloud, JBOSS \/ NODE.JS, SQL, MQ \n  * Jboss scripting\/CLI \n  * MS Azure (Kubernetes, Azure API, Azure Development) or AWS equivalent \n  * Working Knowledge: GIT, Confluence, JIRA \n  * Strong experience in DevOps pipeline, CI\/CD, and related tools \n\n  \n**Note:**\n\n  * Strong developer skills \n\n  \n**About the Company**\n\n  * As a top 10 North American bank, our client aims to stand out from its peers by having a differentiated brand - anchored in a proven business model and rooted in a desire to give its customers, communities, and colleagues the confidence to thrive in a changing world. \n  * Our client engages in providing financial products and services. They offer various financial products and services, telephone, Internet, and mobile banking services, retail and commercial banking services, and wealth management services. The Wholesale Banking segment provides capital markets, investment banking, corporate banking products, and investment needs to companies, governments, and institutions in financial markets. \n\n  \n#tech  \n#LI-GW1  \n#L1-Onsite\n\n","2":"## Job Description\n\nInterested in working for a world renounced travel agency that's goal is to\nsave travelers money? Well, our client is looking for a full-time senior\nsoftware engineer to join their team. Primarily working with React, this\nposition requires someone with drive to solve complex integration projects\nwhile supporting interfaces to bring valued services to the cloud offerings.\nOur client is offering a fully remote position. However, employees would have\nthe opportunity to work in office if they please.  \n  \nWith over 70 million users worldwide this application was the number 1 most\ndownloaded OTA in America within 2021. Now that the pandemic is slowly behind\nus their business is booming even more than ever with no sight in slowing down\n(5B$ was their valuation most recently) Not only is business expanding but the\nopportunities this client supply are exponential. Joining a team of likeminded\npeople who strive to deliver quality customer satisfaction is the main goal\nfor this business to succeed.  \nDesired Skills & Experience\n\n  * 4+ years React \n  * University Degree in Computer Science, Engineering, Information Tech, Math or Stats\n  * Backend microservices experience - Java, Scalam GoLang are a plus\n  * AWS or Google Cloud Platform\n\n  \n  \nWhat You Will Be Doing  \nTech Breakdown  \n\n  * 100% React\n\n  \n  \nDaily Responsibilities  \n\n  * 80% Hands On\n  * 20% Team Collaboration\n\nThe Offer  \nYou will receive the following benefits:  \n\n  * 100% Medical, Dental, Vision Insurance\n  * RRSP Plan\n  * Stock Options\n  * Unlimited PTO\n  * WFH OR WFO choice\n  * Small Dynamic Team\n  * \\+ more and competitive pay\n\n  \n  \nApplicants must be currently authorized to work in the Canada on a full-time\nbasis now and in the future.\n\n","3":null,"4":"## Job Description\n\n**Position Title: IT Recruiter** **Working Location: FCP, remote** **Working\nHours: Monday – Friday 9am – 5pm** **Duration: 6 months** **Possibility of\nextension: Yes** **Possibility of FTE: Yes**\n\n######  _NOTE:_  \n_Technology and operations\/data and analytics hiring_ _3-5 years in technology\nrecruiting – not engineering_ _Experience recruiting Daytime analytics,\nsoftware development, Developers who have experience developing AWS\napplications, Using Lamda functions, serverless stack, building API Gateway\n(WS Development), Cloud engineering (Not mechanical or electrical sense),\nMachine learning, AI, Data scientists\/engineers_\n\n **Job Description:** Role Responsibilities Include (but are not limited to):\n\n  * Responsible for end-to-end recruitment lifecycle including sourcing, screening, and evaluating candidates, short-listing, and offer management. Candidate will also ensure accurate documentation of the process.\n  * Candidate must have outstanding communication skills and the ability to manage both the candidate and hiring manager experience.\n  * Candidate will collaborate with a senior recruiter to support a large growth portfolio of technical roles for the Commercial Banking Technical group, looking to expand in Chicago, Dallas, and Toronto.\n\n **Must-Have Skills:**\n\n  * 3-5 years recruiting in Technology and Operations\n  * 3-5 years' experience working in an agency environment\n  * Superior client management skills, able to effectively & persuasively present information\n  * Strong business acumen, with an ability to interpret business direction and realign\/develop\/recruiting strategies and refine tactics accordingly\n  * Agility: an individual who can follow a process and move quickly through technology.\n  * Proven track record in a relationship management \/ sales environment, experience advising a business.\n  * Tech savvy\n  * Able to present BMO and job offers in a compelling manner\n  * Highly organized and able to manage multiple requests at one time and work in a fast-paced environment\n  * Able to deal with ambiguity and reprioritize tasks in response to unexpected changes in priorities\/requests\n  * Highly motivated, with strong investigative abilities.\n  * Experience with data and analytics a nice to have (DnA)\n\n**Soft skills:**\n\n  * Ability to work with deadlines and prioritize tasks\n  * Ability to work independently, with little direction in a virtual environment\n  * Strong analytical skills\n\n","5":"## Job Description\n\n![](https:\/\/counter.adcourier.com\/U3JpZGhhci5HYW5nYWRoYXJhLjgzNTk5LjQwNzNAYmNmb3J3YXJkLmFwbGl0cmFrLmNvbQ.gif)  \n  \n\nSenior Quality Engineer\n\n  \n\n  \n  \n  \n\n  \n\n**BCforward is currently seeking highly motivated Senior Quality Engineer in\nMississauga, ON**\n\n  \n\n ****\n\n  \n\n**We place consultants for end clients all over Canada.**\n\n  \n\n ****\n\n  \n\n****\n\n  \n\n**Job Title: Senior Quality Engineer**\n\n  \n\n **Location: Mississauga, ON**\n\n  \n\n **Anticipated Duration:12 Months Contract with possible extension or\npermanent depending on the performance of the candidate and client needs**\n\n  \n\n  \n\n**Job Description:**\n\n  \n\n **Key Responsibilities:**\n\n  \n\n* Design and implement testing strategies for ICGA applications within CODST\/ISG space\n\n  \n\n* Provide regular testing metrics and management reporting on risks and issues\n\n  \n\n* Responsible for selecting\/maintaining and integrating the appropriate set of tools, processes, and procedures to ensure overall testing efficiency and effectiveness in the operations\n\n  \n\n* Identify, recommend, and implement framework, strategies, and toolsets to optimize test execution, expand test coverage, and reduce risk\n\n  \n\n* Establishes and maintains strong working relationships with Development, Project Management and Users\n\n  \n\n* Produce and maintain Key Performance Indicators (KPIs) around the testing performed. Manage best in class service quality and manage SLAs accordingly\n\n  \n\n* Lead a continuous process improvement program within the team and at the project level reviewing trends, data, etc- Partner with Technical Project Management in the development of project plans, status communications, and the management of software solutions\n\n  \n\nDevelopment Value:\n\n  \n\n* Candidate will get an opportunity to work directly with global technology teams.\n\n  \n\n* Candidate will get an opportunity to work with various technology stacks within the ICGA space.\n\n  \n\n ****\n\n  \n\n**Person Specification**\n\n  \n\n **Knowledge\/Experience:**\n\n  \n\n* 8 Plus Years' Experience in software quality assurance\n\n  \n\n* Adept at developing data validation solutions\n\n  \n\n* Strong knowledge data storage and data processing environments using databases and big data\n\n  \n\n* Skilled at testing reporting solutions. Good understanding of financial industry is an asset\n\n  \n\n* Excellent functional, analytical, interpersonal and communication skills Skills:\n\n  \n\n* Automation testing using Selenium, Appium\n\n  \n\n* Write shell scripts and complex database queries\n\n  \n\n* Databases (MS Sql Server, Oracle, MongoDb)\n\n  \n\n* Understand DB design, SSIS, Stored procedures\n\n  \n\n* Understand Big Data ecosystem (Hadoop, Hive, Sqoop, HBase, Spark, Flume, etc.,)\n\n  \n\n* Strong Performance Tuning and troubleshooting\n\n  \n\n* Experience with Tableau, Microstrategy, QlikView, SSRS, etc., a plus\n\n  \n\n  \n\n**Qualifications:**\n\n  \n\n* Bachelors' degree in Computer Science or equivalent Competencies\n\n  \n\n* Excellent written, presentation and communication skills\n\n  \n\n* Excellent problem-solving skills to identify creative ways to achieve solutions\n\n  \n\n  \n\n**About BCforward:**  \nBC _forward_ began as an IT business solution and staffing firm. Founded in\n1998, BC _forward_ has grown with our customers' needs into a full-service\npersonnel solutions organization. Headquartered in Indianapolis, Indiana, BC\n_forward_ also operates numerous delivery centers across North America and\nIndia. We are currently the largest consulting firm and largest MBE certified\nfirm in Indiana. Our uninterrupted growth has allowed BC _forward_ to deliver\nuniquely configured IT staffing and project solutions for over years of\ncatering to our customers' specific needs. BC _forward_ currently maintains a\nteam of over 5000 global resources. With our additional brand, Stafforward,\ntogether we have the capabilities to deliver services for a variety of\nindustries in both public and private sectors which allows us to address your\nmost challenging needs.\n\n  \n\n[www.BCforward.com](http:\/\/www.bcforward.com\/)  \n  \n[www.facebook.com\/bcforward](http:\/\/www.facebook.com\/bcforward)  \nThis posting is not an offer of employment. All applicants must be authorized\nto work in the United States. The submission of intentionally false or\nfraudulent information in response to this job posting shall render the\napplicant ineligible for the position. BCforward is an equal opportunity\nemployer. Any subsequent offer of employment shall be considered employment at\nwill regardless of the anticipated assignment duration.\n\n  \n\nInterested candidates please send resume in Word format Please reference job\ncode 178172 when responding to this ad.\n\n  \n\n* * *\n\n  \n\n","6":"## Job Description\n\nJob Description  \n  \n**Software Developer  \n  \nSummary Of Day To Day Responsibilities:**\n\n  * The Software Developer will design, develop and deploy FE applications using the toolset described for the prototype that is being built. \n  * FE Developer will work with senior Tech Leads who will be developing the middle and backend services to power the UI. \n  * Work with other team members to cooperatively design, develop and deploy quality solutions in order to satisfy prototype objectives\/requirements. \n  * Work with BA Product Owner to make refinements to UI\/UX. \n  * Comply with Agile (iterative change) methodology working in a POD that is led by a Scrum Master. \n  * The Software Developer will assist with the refinement of requirements to develop a suitable design, testing, and deployment documents. \n  * The Software Developer will ensure consistency in coding standards. \n  * Ensure required documentation is created and maintained throughout project work and stored in the team's Confluence site and that knowledge transfer occurs to full-time staff upon completion of the contract term. \n\n  \n**Must-Have :**\n\n  * Angular \n  * HTML5 \n  * CSS \n  * JavaScript \n  * Java \n  * J2EE \n  * bootstrap (must) \n  * web components \n\n  \n**Nice To Have**\n\n  * React \n  * node.js \n\n  \n**Education\/Experience**\n\n  * Degree\/Certifications Required: Computer science or related exp \n  * Years of experience: 5-7 years \n\n  \n**About the Company**\n\n  * As a top 10 North American bank, our client aims to stand out from its peers by having a differentiated brand - anchored in a proven business model and rooted in a desire to give its customers, communities, and colleagues the confidence to thrive in a changing world. \n  * Our client engages in providing financial products and services. They offer various financial products and services, telephone, Internet, and mobile banking services, retail and commercial banking services, and wealth management services. The Wholesale Banking segment provides capital markets, investment banking, corporate banking products, and investment needs to companies, governments, and institutions in financial markets. \n\n  \n#tech  \n#LI-GW1  \n#LI-Remote\n\n","7":null,"8":"## Job Description\n\nJob Summary :  \nThe Business Analyst (BA) engage with business leaders and users to understand\nbusiness requirements and propose technologically feasible and financially and\nfunctionally reasonable, solutions and changes to process, products, services,\nsoftware, and hardware. The Business Analyst (BA) works in collaboration with\nthe personnel of the head office, the plants, corporate stores, franchises,\nand other Bath Fitter's partners.  \n  \nTasks and Responsabilities :  \nLead the capture and review of business needs as well as preparing detailed\nrequirements;  \nOrganize meetings with clients and coordinate communications concerning the\ndevelopment tasks and tests;  \nWork with clients to establish approval test criteria;  \nParticipate in defining integration, user approval and regression tests;  \nEnsure requirement traceability for version deliveries;  \nCarry out functional analyses to identify information, procedures and decision\nflows;  \nTranslate the business needs into technical objectives for the development\nteams;  \nTo be part of an agile team;  \nIn cases of integrating systems: define and document interfaces and\nintegration points.  \n  \nProject Coordination  \n  \nManage short term projects (2-3 weeks);  \nCoordinate development team and client requests;  \nInform all stakeholders of any changes brought to the different processes and\nsystems;  \nComplete all the documentation by using the project scope definition model and\nensure its tracking;  \nParticipate in system approval tests.  \n  \nJob Requirements :  \nBachelor's degree in computer sciences, software engineering, information\ntechnology.  \n5 to 8 years of experience as a business analyst.  \nExperience with CRM project, an asset.  \nExperience with ERP projects, an asset.  \nExperience with Mobile application development projects, an asset  \nExperience with system integration (APIs) projects, an asset  \nExperience with the business analysis model (BMA) and the organizational\nprocess documentation.  \nSolid knowledge of retail sales systems management and\/or of manufacturing.  \nProfessional accreditation in business analysis, an asset.  \nCRM Certification, an asset.  \nProficiency with MS Office applications (Word, Excel, PowerPoint) and Visio\n(BPMN formalism).  \nExperience with the Atlassian suite.  \nVery good understanding of interactions between systems.  \n  \nDemonstrated Skills :  \nExcellent listening skills and interpersonal relations to understand the end\nusers' needs.  \nExcellent communication skills in both speaking and in writing French and\nEnglish.  \nAble to influence, convince and initiate changes.  \nStrong analytical sense and synthesizing skills  \nProblem resolution and innovative abilities.  \nEasily establish priorities, meet deadlines and work inside a rapidly changing\nenvironment.  \nCapable of working in collaboration with different sectors of the enterprise\nand ITs.  \nAptitude for teamwork.  \n  \nPandoLogic.Category: Technology, Keywords: Business Systems Analyst\n\n","9":"## Job Description\n\nThe recruitment team at Myticas Consulting is looking for 2 System Test\nAnalysts for 6 month engagements offered within the Ottawa region over a\n12-month period.  \n  \n **The position is required to be onsite the majority of the time (75%)**  \n  \nThe System Test Specialist will support the testing of real-time, mission and\nsafety-critical Air Traffic Management Software. The consultant will focus on\ndeveloping and executing system test protocols and participation in\ncertification activities. The consultant's activities shall be in accordance\nwith Corporate Safety and Quality policies and practices, and the Engineering\nSafety and Quality policies and practices.  \n  \n **2\\. Responsibilities**  \n  \nUnder the overall direction of the Manager, the contractor, working with the\nother project team members, shall perform the following tasks:  \n\n  * Work closely with developers working in an Agile software development environment.\n  * Raise and triage of defects, and participation in defect management activities.\n  * Ensuring high quality and accuracy is maintained through to software release.\n  * Ensuring project activities are conducted in a timely manner and following established processes.\n  * Drafting and\/or validating test plans, test cases, and test scripts as required for operational validation.\n  * Execution of manual and automated testing.\n  * Ensuring test plans, cases and scripts are repeatable and reusable.\n  * Comparing test findings and results to business requirements and methods and procedures.\n  * Support\/Execute software certification activities.\n\n  \n **3\\. Qualifications**  \n\n  * Degree from a recognized university or community college with an acceptable specialization in computer, electrical engineering, systems engineering, computer science or information systems.\n  * Experience in system testing of complex integrated systems (Desktop applications, Server applications and web applications)\n  * Knowledge of Windows operating system. Knowledge of LINUX operating system an asset.\n  * Solid knowledge of test methodologies, writing test plans, creating test cases and troubleshooting (Agile, SAFe, DevOps, Waterfall).\n  * Experience and knowledge in security testing techniques and tools.\n  * Experience with automated testing tools and frameworks such as Robot Framework and Test Complete an asset.\n  * Use of test management tools (such as IBM Jazz) for managing test artefacts, defect management and software configuration management.\n  * Knowledge of Air Traffic Managements systems an asset.\n  * Develops effective and positive interpersonal relationships through respect for others, fairness, tact, persuasiveness, effective expression, and open communication.\n  * ISTQB or CSTE certification an asset.\n  * SAFe certification an asset.\n  * Effective English language written and verbal communication skills.\n\n  \n#PandoCA  \nPandoLogic.Category: Technology, Keywords: Software QA Analyst\n\n","10":null,"11":null,"12":"## Job Description\n\n![](https:\/\/counter.adcourier.com\/UC5NY0h1Z2guNDYzMjkuNDA3M0BuaWdlbGZyYW5rLmFwbGl0cmFrLmNvbQ.gif)  \n  \n\nSUMMARY:  \nThe ERP Business Analyst works closely with users and managers to gather\nsystem requirements, document  \nspecifications and requirements, communicate to business teams, management and\nvendors. Responsible for systems  \nand functional process documentation, application QA testing, user training,\nand primary support for ERP and MES  \napplications to production departments.  \nInitially the main focus of the role will be to consult, analyze, and help\ndevelop the requirements for the upgrade or change  \nof the ERP platform. A team member in developing the project ROI and\nimplementing industry 4.0 projects.  \nBusiness areas would include:  \nEngineering; BOM, routings, item management  \nProduction planning and scheduling  \nProduction & shop floor activities  \nWarehouse and materials management  \nShipping & receiving  \nQuality management\n\n  \n\nMAJOR RESPONSIBILITIES (not limited to):  \nThe ERP Business Analyst with primarily support the production and engineering\nareas of the business.  \nDocument business processes and workflows to develop a comprehensive\nrequirements document for  \nprocurement and implementation of new ERP & MES platform  \nDevelopment of ROI and business cases for ERP and MES solutions  \nConfiguration and testing of new ERP and MES deployment  \nGap analysis of current systems and processes vs new ERP and MES solutions,\ndevelop mitigation strategies  \nCreate and implement end user training, develop work instructions and training\ndocumentation  \nAssist with development of project teams to move projects through lifecycle  \nDevelop implementation strategy and implement ERP and MES solution  \nContinuous improvement of technology solutions  \nEnd user support of ERP and MES systems  \nAdministration of ERP and MES systems  \nPerform other duties as required\n\n  \n\nEDUCATON, EXPERIENCE & QUALIFICATIONS:  \nCollege diploma or university degree in information technology, computer\nscience, computer engineering  \n3 years experience implementation and support of ERP systems in manufacturing  \nDetailed knowledge of manufacturing processes; Bill of Material (BOM),\nRoutings and production scheduling  \nStrong technical knowledge of databases and reporting applications; MS SQL\nServer, Oracle, SQL, MS SSRS etc.  \nSolid written and oral communication skills and ability to multi- task\nefficiently  \nAbility to effectively prioritize and execute tasks in a high-pressure\nenvironment  \nFinance Knowledge\n\n","13":"## Job Description\n\n**Overview: **\n\nTekWissen Group is a workforce management provider throughout the USA and many\nother countries in the world. Our client is a company who is a provider of\nbanking and financial services. The company operates through two divisions,\nRetail Banking and Services, and Corporate and Institutional Banking.\n\n **Job Description:**\n\n**The position**\n\n  * As an APS specialist, you will be responsible for Level 1 support of the IFSO ecosystem of application (SimCorp Dimension, Confluence Unity, Lambo as well as the suite of supporting desktop tools). \n\n  * Reporting functionally to the head of Midscale APS and regionally to the APS manager, the specialist will work also on a dotted line to the APS manager based in Denver in a follow the sun support model. \n\n  * As APS, you are part of the day-to-day operational activities. You will deliver functional stability and quality to our SimCorp Dimension ecosystem. Concentrated around the core system SimCorp Dimension with direct satellite systems such as Confluence Unity, Financial reporting tooling, and batch & interface workflow systems. You act on events and incidents. Besides these day-to-day activities, you will play an important part in our change cycle by consulting, defining, and deploying a change in the correct way. \n\n**Responsibilities**\n\n  * Support availability of SimCorp Dimension ecosystem mainly on automated interfaces and automated batch processes \n\n  * Implementing and changing Simcorp Dimensions functional framework \n\n  * Deliver support for business changes \n\n  * Deliver user and authorization management \n\n  * Monitor and react to incidents of automated batch processes and interfacing to support the functionality of the system \n\n  * Participate in projects, initiatives, and analyses to cover the functional overview, needs, and challenges as needed. \n\n  * Create clear and comprehensive regular reporting on incidents, SOD statistics, and Overall incident trends to name a few. \n\n  * Comply with relevant work instructions, processes, and regulatory controls and reviews; update instructions, processes, and controls, if applicable. \n\n**The requirements**\n\n  * Higher educated degree in Financial or Technical education \n\n  * Minimum of 2 years of relevant work experience \n\n  * Demonstrate strong working knowledge of Service management processes \n\n  * Experience in processes, ITIL \n\n  * Experience in IT architecture \n\n  * Key Technical Skills \/ Knowledge; general competencies: \n\n  * Strong technical skills (mainly Excel, Visual Basic, and SQL) \n\n  * The ability to create a bridge between process (input\/ execution) and functional and technical possibilities \n\n  * Preferably experience in SimCorp Dimension \n\n  * Fluent in English (spoken and written) \n\n  * Organized and team player \n\n  * Ability to develop efficient working relationships with various stakeholders abroad and locally \n\n**Job-related competencies:**\n\n  * Accurate \n\n  * Structured \n\n  * Analytical \n\n  * Collaborative \n\n  * Strong communication skills \n\n  * Result-driven \n\n  * Ownership of issues \n\n**Work Type:** Hybrid (at least one day per week in the office or open to\nrelocation)\n\n **Tek Wissen® Group is an equal opportunity\/affirmative action Employer\n(m\/f\/d\/v) supporting workforce diversity.**\n\n","14":"## Job Description\n\nAt Emerson, we are innovators and problem-solvers, focused on a common\npurpose: leaving our world in a better place than we found it. Each and every\nday, our foundational valuesintegrity, safety and quality, supporting our\npeople, customer focus, continuous improvement, collaboration and\ninnovationinform every decision we make and empower our employees to keep\nreaching higher. As a global technology and engineering leader, we provide\ngroundbreaking solutions for customers in industrial, commercial, and\nresidential markets. Our Emerson Automation Solutions business helps process,\nhybrid, and discrete manufacturers maximize production and protect personnel\nand the environment while optimizing their energy and operating costs. Our\nEmerson Commercial & Residential Solutions business helps ensure human comfort\nand health, protect food quality and safety, advance energy efficiency and\ncreate sustainable infrastructure. Emerson, a Fortune 500 company with $15.3\nbillion in sales and 200 manufacturing locations worldwide, is committed to\nhelping employees grow and thrive throughout their careers. Whether youre an\nestablished professional looking for a career change, an undergraduate student\nexploring options or a recent MBA graduate, youll find a variety of\nopportunities at Emerson. Join our team and start your journey today.  \n  \n\nIf you are an Agile Engineerprofessional looking for an opportunity to grow,\nEmerson has an exciting opportunity for you! Remote position with some travel\nrequired..\n\n  \n  \n\nAre you looking to develop your engineering career and skills in a position\nwhere you are challenged to produce tangible results on key projects that make\na difference?\n\n  \n  \n\nVerdant Energy Management Solutions is one of the fastest growing divisions in\nthe Emerson Commercial & Residential Solutions portfolio and we need team-\noriented, driven engineers to feed our software and product development.\n\n  \n  \n\nIf you enjoy working with a friendly, creative, and dynamic engineering team\nlead by aseniorleadership group of engineers, then we need to talk to you!\n\n  \n  \n\n **Position Description:**\n\n  \n  \n\nSoftware engineers develop and support a cloud based real time IoT device\nnetwork management system.Your work will help develop a multi-layered\narchitecture spanning thousands of locations, each with several hundred IoT\ndevices, all controlled in a real time SaaS environment.\n\n  \n  \n\n **AS A Senior Aglle Engineer You WILL:**\n\n  \n  \n\n  * Execute software architecture, design, implementation, debugging, release management and maintenance\n  \n\n  * Handle streams of real time big data\n  \n\n  * Design and implement robust and secure REST APIs\n  \n\n  * Analyze systems to cover performance benchmarking, reliability, security and scalability\n  \n\n  * Optimize code to handle a large number of concurrent requests in real time\n  \n\n  * Utilize the AWS platform extensively to build scalable, robust systems.\n\n  \n  \n\n**WHO YOU ARE:**\n\n  \n  \n\n  * You look for and implement new technical skills, knowledge or capabilities that can benefit the business or personal performance\n  \n\n  * You readily learn and adopt new technologies\n  \n\n  * You identify and create the processes necessary to get work done\n  \n\n  * You separate and combine activities into an efficient workflow\n  \n\n  * You work cooperatively with others across the organization to achieve shared objectives\n  \n\n  * You are detail oriented and willing to roll up your sleeves\n  \n\n  * You are able to operate in a fast growth, entrepreneurial environment with shifting priorities\n\n  \n  \n\n**_Required Education, Experience & Skills_**  \nBachelors degree or higher in system-level software development\n\n  \n  \n\n  * Intermediate Java Developer with 10+ years overall experience with Java frameworks such as Springboot, Spring, or J2EE\n  \n\n  * Experience in software design, development, implementation and software engineering which also includes integration, maintenance and testing of various client\/server, cloud, and web applications.\n  \n\n  * Experience in writing Testsusing Junit or similar libraries\n  \n\n  * Advanced knowledge of Design Patterns, code refactoring, service-oriented architecture and domain-driven design\n  \n\n  * Experience with RESTful APIs and API tools like Swagger or OpenAPI\n  \n\n  * Experience with relational databases.\n\n  \n  \n\n#LI-remote\n\n  \n  \n\n  \n  \n\nVerdant Environmental Technologies is a focus business unit in the Commercial\nand Residential platform of Emerson based in Montreal. Our goal is to\nquadruple sales in the next 3-5 years and we will need strong engineering\ntalent to continue our dominance and aggressive growth in our industry\nsectors.\n\n  \n  \n![\n](https:\/\/ars2.equest.com\/?response_id=1a9155543316a32be1de476cde96f979&view)\n\n","15":null,"16":"## Job Description\n\n**Android Engineer**  \n  \n**Job Description**  \n  \nMy client is a global technology platform that helps customers and communities\novercome their most important financial challenges. Serving millions of\ncustomers worldwide with their tax and financial saving solutions, their\nbelief is that everyone should have the opportunity to prosper while they work\ntirelessly to find new, innovative ways to deliver on this belief.  \n  \n**Required Skills and Experience**  \n\n  * 4+ years of experience developing Kotlin Java mobile native apps. \n  * Excellent debugging skills with ability to produce high quality code. \n  * Curiosity and interest in learning new technologies, patterns and diving deep into issues. \n  * Dynamic UI experience and an eye to precisely replicate screen designs. \n  * Meticulous, organized, analytical, innovative, and able to think strategically. \n  * Highly effective at working in cross-functional groups and with minimal supervision. \n\n  \n**Nice to Haves:** **It's okay if you don't have these, we're happy to teach**  \n  \n\n  * Experience building Digital Wallet or Payment applications or an understanding of blockchain is a plus. \n  * Understanding of clean code, dependency injection (Dagger, Koin), and TDD\n  * Creating UI with Compose \n  * Using Kotlin Coroutines, and Flow \n\n  \n**What you will be doing**  \n\n  * Develop, test, and deploy new features to production \n  * Work together with cross-functional teams to define, design, and ship new features \n  * Integrate third-party data sources and APIs \n  * Create and execute unit tests on your code, to ensure its robustness, including edge cases usability, and general reliability \n  * Troubleshoot issues, fix bugs and improve application performance \n  * Explore and utilize new technologies to maximize development efficiency\n\n  \n**Benefits**  \n\n  * PTO\n  * Bonuses\n  * Remote\n  * 4 weeks vacation\n  * Competitive benefits\n\n  \n  \nApplicants must be currently authorized to work in Canada on a full-time basis\nnow and in the future. Accommodation will be provided in all parts of the\nhiring process as required under Motion Recruitment's Employment Accommodation\npolicy. Applicants need to make their needs known in advance.\n\n","17":null,"18":null,"19":null},"Salary":{"0":null,"1":null,"2":null,"3":null,"4":"Depends on Experience","5":null,"6":null,"7":null,"8":null,"9":null,"10":null,"11":null,"12":null,"13":"$65 - $70","14":"-","15":null,"16":null,"17":null,"18":null,"19":null}}