{"id":{"0":1.0,"1":2.0,"2":3.0,"3":4.0,"4":5.0,"5":6.0,"6":7.0,"7":8.0,"8":9.0,"9":10.0,"10":11.0,"11":12.0,"12":13.0,"13":14.0,"14":15.0,"15":16.0,"16":17.0,"17":18.0,"18":19.0,"19":20.0},"Title":{"0":"Vice President of Technology","1":"Senior R&D Engineer (C++ Software Developer)","2":"SDK Team Lead","3":"Product Manager - Private Markets","4":"Information Security Analyst","5":"SDK Team Lead","6":"Senior React Native Developer","7":"Senior Information Security Analyst","8":"Java Full Stack Developer - Remote \/ Telecommute","9":"Specialist, Managed Security Services - Network Security and Palo Alto focus","10":"System Validation Engineer","11":"Sr. Analyst, Managed Security Services (Network Security focus)","12":"SDK Team Lead","13":"Senior React Native Developer","14":"SDK Team Lead","15":"Senior React Native Developer","16":"Vice President of Technology","17":"Senior React Native Developer","18":"Senior Oracle DBA with Exadata","19":"Network Data Engineer"},"Entreprise":{"0":"Jobot","1":"Jobot","2":"Jobot","3":"Computershare","4":"Global Technical Talent","5":"Jobot","6":"Jobot","7":"Global Technical Talent","8":"Cynet Systems","9":"Sirius Computer Solutions Inc","10":"HCL America Inc.","11":"Sirius Computer Solutions Inc","12":"Jobot","13":"Jobot","14":"Jobot","15":"Jobot","16":"Jobot","17":"Jobot","18":"Infolob Solutions Inc","19":"Cynet Systems"},"Type_Employ":{"0":null,"1":null,"2":null,"3":"Full Time","4":"Full Time","5":null,"6":null,"7":"Full Time","8":null,"9":null,"10":"Full Time","11":null,"12":null,"13":null,"14":null,"15":null,"16":null,"17":null,"18":"Contract W2, Contract Independent, 12 Months","19":null},"Location":{"0":"Winnipeg","1":"Calgary","2":"Calgary","3":"Toronto","4":"Toronto","5":"Montreal","6":"Toronto","7":"Toronto","8":"Toronto, ON","9":"Mississauga, ON","10":"Vancouver, BC","11":"Mississauga, ON","12":"Winnipeg","13":"Calgary","14":"Toronto","15":"Montreal","16":"Calgary","17":"Winnipeg","18":"Toronto, ON","19":"Victoria, BC"},"Description":{"0":null,"1":null,"2":null,"3":"## Job Description\n\n**Location: Toronto, Ontario (Hybrid)** Work from the comfort of your own\nhome! This position can be mostly remote for candidates based anywhere in\nOntario with occasional travel to the Toronto office, or if you prefer a\nhybrid model, you can work part-time from the Toronto office and part-time\nfrom your home office.  \n  \n **We give you a World of Potential** Computershare has an exciting\nopportunity for a permanent full-time Product Manager, Private Markets to join\nour Computershare Technology Services (CTS) team. Fuelled by Venture Capital\nand Private Equity investment, Private Markets has become the growth engine\nfor economies around the globe. Serving many of the world's fastest growing\ncompanies, from start-up through IPO and beyond, Computershare provides the\nwidest range of equity, governance and compliance services to help founders\nachieve their dreams. Our flagship SaaS solution, GEMSpm, provides our clients\nand their investors visibility into cap tables, employee equity plans and\nassociated financial reporting.There are a few things that make this\nopportunity truly fantastic:  \n\n  \n\n  * We work in a fun and collaborative team environment, offering the opportunity to work on new and exciting projects. \n  \n\n  * Mentor Business Analysts and influence the overall strategy. \n  \n\n  * We offer continuous learning and education opportunities and put emphasis on continued improvement and growth. \n  \n\n  * Enjoy flexibility with the hours that works best for you and the team, ensuring that you can find the right work-life balance. \n  \n\n  * We offer a competitive total compensation package, with further details found below. \n  \n\n  \n  \n**A role you will love** The Product Manager is a matrixed leadership role\nresponsible for influencing the product strategy and driving execution of the\nprioritized roadmap. The successful candidate will manage an existing product\nset while identifying, building, and launching new product initiatives to\nmarket.The Product Manager is an integral role that sets priorities, gains\nalignment, synthesizes feedback, all to create experiences that delight our\ncustomers while also realizing our financial goals. **Key responsibilities\ninclude:** Product Innovation  \n\n  \n\n  * Identify new product development initiatives. \n  \n\n  * Develop business cases, including financial\/usage forecasting and ROI metrics. \n  \n\n  * Support product pricing - collaborating with the business to define the pricing model, based on market research, production costs and anticipated demand. \n  \n\n  \nProduct Optimization  \n\n  \n\n  * Partner with business analysts to map all processes for each of the products. \n  \n\n  * Stay abreast of regulatory and competitive changes in each market that could impact our products. \n  \n\n  * Manage existing and assessment of new vendor partner relationships to accelerate growth. \n  \n\n  \nProduct Owner  \n\n  \n\n  * Lead execution of quarterly missions created from our strategic roadmaps acting as Product Owner in our agile delivery framework. \n  \n\n  * Define go-to-market strategies including aspects of growth marketing, client success and refining value propositions leveraged with sales. \n  \n\n  \nMarket Scan and Penetration  \n\n  \n\n  * Keep a finger on the market pulse through research of competitor analysis and industry trends. \n  \n\n  * Engage with focus-groups and key reference clients to understand the voice of the customer, elevating empathy towards their needs across the teams. \n  \n\n  \n  \n**What will you bring to the role?**  \n\n  \n\n  * Minimum of 3 years' experience developing products from idea, build, launch and growth in a financial services, technology or professional services sector, with ownership over a diverse portfolio of products and services. \n  \n\n  * Expert coordination between multiple stakeholders, designers, engineers, QA and vendors. \n  \n\n  * Comfortable with leveraging data to generate insights, identify business opportunities, and execute them. \n  \n\n  * Mastery over product management principles, frameworks and processes. \n  \n\n  * Experience developing SaaS B2B\/B2C products and technologies. \n  \n\n  * Executive communication skills with both technical and non-technical partners. \n  \n\n  \n  \n**A company to be proud of** Computershare (ASX:CPU) is a world leader in\nfinancial administration with over 14,000 employees across 21 different\ncountries delivering expertise to over 40,000 clients. At Computershare, it's\nmore than just a job, our open and inclusive culture means that we will help\nyou to grow, to move forward and make the most of the world of opportunities\nwe have available. With infinite possibilities, we could take you anywhere.  \n  \n **Rewards designed for you** **Employee Share Plan.** Set aside salary to\npurchase shares in our company and you'll increase your investment when you\nreceive a generous company contribution towards additional shares. **Health\nand Wellbeing.** Our health and wellbeing rewards can be tailored to support\nyou and your family. **Save for Your Future.** We will support you along your\nretirement savings journey. **Paid time away from work.** Our employees enjoy\na competitive paid time off package, including a day each year to volunteer\ntime for a good cause that is important to you. **Employee Discounts.** We've\npartnered with other organisations to offer you extra savings. Enjoy discounts\nwith banks, car manufacturers, on flights, accommodation, and days out as well\nas with many big brand shops. **Extra Rewards.** From tuition reimbursement to\ncash bonus recruitment referral programs, our comprehensive benefits package\noffers a multitude of options. **Compensation.** $100,000 - $120,000 per year\nCAD, depending on experience.  \n  \n **A diverse and inclusive place to work** Computershare celebrates the\ndiversity of our people, and we welcome applications from everyone.We believe\nthat having a culture of inclusion is essential in delivering good results.\nAttracting, retaining, and developing a diverse workforce where employees feel\nvalued, respected, and empowered allows people to reach their full potential.\nAs a business this diversity helps us to better reflect and understand our\ncustomers' needs to allow us to drive better outcomes.We are happy to\naccommodate individual needs during your application journey. If you require\ndisability accommodations or adjustments, please email us at detailing your\nrequirements and contact information.Computershare is an equal opportunity\nemployer. Qualified applicants will receive consideration for employment\nregardless of race, color, religion, sex, sexual orientation, gender identity\nor expression, national or ethnic origin, age, disability, protected veteran\nstatus, or other characteristics protected by applicable law.  \n  \n **Covid-secure** We've kept our business running during the pandemic by\nmoving most of our employees to remote working, and by creating and\nmaintaining a safe environment for those people who need to be in the office.\nWe carefully limit the amount of people at our locations and ensure that those\nwho cannot work remotely are kept safe with proper distancing and protective\nequipment.In most circumstances we are currently performing all interviews,\nassessments, and background checks online to ensure the safety of everyone\ninvolved. Should you be successful in securing a role and it can be performed\nfrom home, we will arrange for equipment to be sent to you and your onboarding\nand training will be provided remotely.#CPUIT\n\n","4":"## Job Description\n\nJob Description  \n  \n**Information Security Analyst**  \n  \n**Note:**\n\n  * Degree\/Certifications Required: CISSP is a bonus, Azure certifications and Splunk Certifications are also a bonus \n  * Years of experience: 5+ years \n\n  \n**Summary Of Day-To-Day Responsibilities:**\n\n  * Project work with Microsoft Azure is the focus. \n  * Information Security Analyst will be identifying data sources and metrics within the environment around tech risk. \n  * Speaking with stakeholders daily on how to access data sources and analytics. \n  * Information Security Analyst will create metrics and dashboards. \n  * Provide leadership for the provision of technical expertise in development and support of activities, processes, procedures and tools for protecting information security with a focus on application security \n  * Research, design and implement application security solutions and practices. \n  * Direct testing of security plans. \n  * Information Security Analyst will lead the evaluation of new and proposed security systems and technologies. \n\n  \n**Skills:**\n\n  * Knowledge of IT standards and procedures. \n  * Knowledge of process and tools for assuring adherence to standards. \n  * Thorough knowledge of existing and planned infrastructure security platforms and architecture components \n\n  \n**Must Have:**\n\n  * Info Security Analyst \n  * Splunk \n  * Microsoft Azure \n  * Tech Risk and Reporting \n  * Agile Experience \n\n  \n**Nice To Have:**\n\n  * Microsoft sentinel tool \n  * PowerBI \n  * Tableau \n  * Data modeling \/ Data Architect \n  * CISSP cert \n  * Azure cert \n  * Splunk cert \n\n  \n**About The Company:**  \nAs a top 10 North American bank, our client aims to stand out from its peers\nby having a differentiated brand - anchored in a proven business model and\nrooted in a desire to give its customers, communities, and colleagues the\nconfidence to thrive in a changing world.  \n  \nOur client engages in providing financial products and services. They offer\nvarious financial products and services, as well as telephone, Internet, and\nmobile banking services, retail and commercial banking services, as well as\nwealth management services. The Wholesale Banking segment provides capital\nmarkets, investment banking, corporate banking products, and investment needs\nto companies, governments, and institutions in financial markets.  \n  \n#tech  \n#LI-Hybrid  \n#LI-GW1\n\n","5":null,"6":null,"7":"## Job Description\n\nJob Description  \n  \n**Senior Information Security Analyst**  \n  \n**Note** :\n\n  * Someone working in the security domain in cloud technology, especially with Azure cloud \n\n  \n**Job Description** :\n\n  * Strong understanding of cloud environments \n  * Senior Information Security Analyst will be identifying processes\/procedures for how to handle a cloud security event, including forensic isolation and mitigation with Digital Forensics and Incident Response (DFIR\/IR) teams. \n  * Working knowledge in incident and problem management \n  * Experience in roles and performing technical delivery tasks as part of an Agile team \n  * good communications skills, you have the ability at mapping business needs to technology solutions and help non-technical audiences understand the benefits of these solutions. \n  * Have a good understanding of the architecture and design of security in order to identify and recommend improvements in the methodologies and processes used within the business units and technical teams that you support. \n  * Senior Information Security Analyst will be planning and gathering security solutions for the monitoring and protection of company assets in the cloud. \n  * Detailed understanding of securing the end-to-end image\/container lifecycle from image build to production deployment. \n  * Identifying gaps in current processes, tools, and implementation. \n  * Understanding of logging mechanisms available on Cloud Platforms\/SIEM and building use cases for forensics-related to Cloud environment. \n\n  \n**Must Haves** :\n\n  * Information security analyst - 6 years \n  * Cloud experience - 3 years \n  * Agile experience - 2 years \n  * DFIR\/IR experience - 3 years \n  * Strong communication skills \n\n  \n**Nice to Have** :\n\n  * MS Azure \n  * Banking experience \n  * Cloud certification \n\n  \n**About the Company** :\n\n  * As a top 10 North American bank, our client aims to stand out from its peers by having a differentiated brand - anchored in a proven business model and rooted in a desire to give its customers, communities, and colleagues the confidence to thrive in a changing world. \n  * Our client engages in providing financial products and services. They offer various financial products and services, as well as telephone, Internet, and mobile banking services, retail and commercial banking services, as well as wealth management services. The Wholesale Banking segment provides capital markets, investment banking, corporate banking products, and investment needs to companies, governments, and institutions in financial markets. \n\n#tech  \n#LI-GW1  \n#LI-Remote\n\n","8":null,"9":null,"10":"## Job Description\n\n**Overview:**\n\n· 5+ years of proficiency in C, C++ and python\n\n· 3+ year of experience of validation test development to validate NVMe, CXL\nbased IP.\n\n· Have Knowledge of PCIe gen4\/gen5\/gen6 specification.\n\n· have knowledge of ethernet protocol.\n\n· Have development experience on Free RTOS\n\n· Strong analytical problem solving skills, innovative thinking, and a mindset\nof continuous improvement\n\n· Effective verbal and written communication skills\n\n","11":null,"12":null,"13":null,"14":null,"15":null,"16":null,"17":null,"18":"## Job Description\n\n**Position: Senior Lead Oracle DBA with Exadata**\n\n **Location: Toronto, Canada**\n\n **Duration: Long Term**\n\n **Rate: $ Open\/Hour** ****\n\n**Job Description:**\n\nLead Oracle DBA with Exadata\n\nMinimum 10+ years Database admin at mission critical applications with high\navailability.\n\nExperience of minimum 2 Data Migration projects on Exadata machines.\n\nMinimum 2 Years’ experience in Oracle RAC.\n\nMinimum 2 years of experience with Oracle Enterprise Manager, with knowledge\nof Fleet Maintenance pack.\n\nMinimum 2 years of experience with Database migration\/upgrade to new hardware\nExadata.\n\nUp to 5 years’ experience\/Knowledge of Data Guard and Golden Gate.\n\nProficient in coordinating activities with off-site team and with customer.\n\nMinimum of 2 years’ experience with ZDRLA, both configuring backup and\nrestoring backup as DG instance.\n\nGood understanding of Oracle Grid, Cluster ware and ASM.\n\nDeployment of disaster recovery plans using Data Guard (Logical\/Physical).\n\nExperience with optimization techniques.\n\nExperience at Oracle performance tuning Should be able to analyze execution\nplans, TKPROF and AWR reports.\n\nStrong communication skills.\n\nPlease send your resume in word format, following details to [](mailto:) or\ncall me @ for more information:\n\nName in Full:\n\nContact Details:\n\nEmail ID:\n\nCurrent Location:\n\nRelocation:\n\nAvailability:\n\nExpected Billing Rate:\n\nWork Authorization:\n\nLinkedIn Profile:\n\nDOB(Month and Day):\n\nZip Code:\n\nSkype ID:\n\nEmployer Details if Any:\n\n","19":null},"Salary":{"0":null,"1":null,"2":null,"3":null,"4":null,"5":null,"6":null,"7":null,"8":null,"9":null,"10":"Depends on Experience","11":null,"12":null,"13":null,"14":null,"15":null,"16":null,"17":null,"18":"Depends on Experience","19":null}}