{"id":{"0":1.0,"1":2.0,"2":3.0,"3":4.0,"4":5.0,"5":6.0,"6":7.0,"7":8.0,"8":9.0,"9":10.0,"10":11.0,"11":12.0,"12":13.0,"13":14.0,"14":15.0,"15":16.0,"16":17.0,"17":18.0,"18":19.0,"19":20.0,"20":21.0},"Title":{"0":"Full Stack Developer","1":"Sr Pega developer \/ Lead","2":"Senior Guidewire, Software Engineer","3":"Senior Software Developer","4":"#2022-D-0019 Member of Technical Staff (Site Reliability Engineer)","5":"Risk Analyst","6":"Software QA Engineer - Bilingual - Remote","7":"Front End Developers and Backend Developers","8":"Software Engineer","9":"Senior Agile Engineer (Remote position)","10":"Senior .NET Software Engineer - Remote (Canada)","11":"UX Designer","12":"#2022-D-0036 Member of Technical Staff (Site Reliability Engineer)","13":"Data Architect with MS Dynamics","14":"Informatica and SAS Lead Developer","15":".Net Developer","16":"Senior Application Support Specialist","17":"Pega Developer","18":"Customer Service Representative\/Helpdesk - Bilingual","19":"C++, software optimization engineer","20":"UI Developer"},"Entreprise":{"0":"Global Technical Talent","1":"Atyeti","2":"Travelers","3":"Jobot","4":"Invidi Technologies Corp","5":"Global Technical Talent","6":"Infinity Consulting Solutions","7":"ReqRoute, Inc","8":"Travelers","9":"Emerson Climate Technologies, Inc.","10":"Infinity Consulting Solutions","11":"Thoughtfocus","12":"Invidi Technologies Corp","13":"Myticas Consulting","14":"NTT DATA, Inc.","15":"Thoughtfocus","16":"Aegistech Inc.","17":"Atyeti","18":"BCforward","19":"Jobot","20":"BCforward"},"Type_Employ":{"0":"Full Time","1":"Contract W2, Contract Independent, Contract Corp-To-Corp, 24 Months","2":null,"3":null,"4":"Full Time","5":"Full Time","6":null,"7":"Contract Corp-To-Corp, 6 Months","8":null,"9":"Full Time","10":null,"11":"Contract W2, Contract Independent, Contract Corp-To-Corp, 6 Months","12":"Full Time","13":"Full Time","14":null,"15":"Contract W2, Contract Independent, Contract Corp-To-Corp, 6 Months","16":"Full Time","17":"Contract W2, Contract Independent, Contract Corp-To-Corp, 24 Months","18":"Contract W2","19":null,"20":"Contract W2"},"Location":{"0":"Toronto","1":"Montreal, QC","2":"Toronto, ON","3":"Edmonton","4":"Edmonton","5":"Toronto","6":"Ottawa","7":"Edmonton, Alberta","8":"Toronto, ON","9":"Montreal, INT","10":"Sherbrooke, QC","11":"Toronto, ON","12":"Edmonton","13":"Ottawa","14":"Halifax, NS","15":"Toronto, ON","16":"Toronto Ontario","17":"Montreal, QC","18":"Mississauga, ON","19":"Toronto,","20":"Mississauga, ON"},"Description":{"0":"## Job Description\n\nJob Description  \n  \n**Full-Stack Developer**  \n  \n**Summary**\n\n  * The main function of a Full stack developer (Other Specialty) is to design, develop, and implement applications using in-demand languages and technologies (e.g. - WebSphere, Informatica, etc.) to support business requirements. \n\n  \n**Job Responsibilities:**\n\n  * The Full-stack developer will need to analyze highly complex business requirements; generate technical specifications to design or redesign complex software components and applications \n  * The Full-stack developer will act as an expert technical resource for modeling, simulation, and analysis efforts Leverage industry best practices to design, test, implement and support a solution \n  * Assure quality security and compliance requirements are met for supported area Be flexible and thrive in an evolving environment \n  * Adapt to change quickly and adjust work accordingly in a positive manner \n\n  \n**Qualifications:**\n\n  * Bachelor's degree in a technical field such as computer science, computer engineering, or a related field required 2-4 years of experience required \n  * Development experience in needed language or technology (e.g. - WebSphere, Informatica, etc.) \n  * Hands-on experience in designing, developing, and successful deployment of large scale projects from end-to-end \n  * Hands-on experience in following the iterative and agile SDLC \n\n  \n**Must-Have:**\n\n  * Full Stack developer - 2-4 year \n  * Exp in Java - 2-3 years \n  * Exp with Angular - 1year \n  * Agile \n\n  \n**Nice to have**\n\n  * Node.js \n  * Database - MS SQL, SQL server \n  * Virtual environment \n  * Github, Jenkins \n  * Jira \n\n  \n**About the Company**\n\n  * As a top 10 North American bank, our client aims to stand out from its peers by having a differentiated brand - anchored in a proven business model and rooted in a desire to give its customers, communities, and colleagues the confidence to thrive in a changing world. \n\n  * Our client engages in providing financial products and services. They offer various financial products and services, telephone, Internet, and mobile banking services, retail and commercial banking services, and wealth management services. The Wholesale Banking segment provides capital markets, investment banking, corporate banking products, and investment needs to companies, governments, and institutions in financial markets. \n\n  \n#Tech  \n#L1-GW1  \n#L1-Remote\n\n","1":"## Job Description\n\n  * The Senior Pega Developer will be a part of a dynamic Commercial Lending Operations Technology team responsible for designing, building, testing, and implementing new workflows and enhancements to the system.\n  * The developer is expected to work with the functional team to create technical designs, create code to build functionality, test the functionality, provide technical support for existing functionality to ensure that it meets defined criteria, and work with the deployment team to implement the functionality.\n\n**Job Responsibilities:**\n\n  * Work directly with different Product Owners to review roadmap, design solutions and ensure final product meets the needs of stakeholders\n  * Lead product design sessions with the development team.\n  * Drive technology architecture to build resilient, responsive and scalable platform.\n  * Create innovative solutions for complex problems, leveraging advanced understanding of engineering principals.\n  * Champion the Agile\/Scrum process, scheduling and leading Agile team sessions.\n  * Understand the work being done by the team, helping the team optimize their delivery.\n  * Ensure quality presentation of the team's work in the sprint demos.\n  * Mentor team members in design, coding practices, and software development policies and guidelines.\n\n**Required Skills:**\n\n  * 5+ years of experience in software development as PEGA.\n  * Development experience with Pega Rules and BPM engine.\n  * Demonstrated success in full lifecycle PEGA implementations (preferably PEGA 7 and 8) including live implementation in PEGA.\n  * Pega Certified Senior System Architect (CSSA).\n  * Strong understanding & knowledge of PEGA concepts and implementation experience with PEGA connectors, performance tuning, decision trees, listeners, UI design, Integration, Security Model etc.\n\n**Specific Pega skills\/experience:**\n\n  * PEGA PRPC Use Case Development minimum 5 years’ experience preferred.\n  * Converting business into process flow minimum 5 years’ experience preferred.\n  * Prefer Pega 8.x.\n\n**Other Required Skills\/ Experience.**\n\n  * Experience in all phases of software development lifecycle including analysis, design, implementation, testing and deployment\n  * Ability to troubleshoot and resolve complex production issues.\n  * Ability to create reusable components that can be leveraged across the enterprise for providing top-notch customer experience.\n  * Perform regular code and design reviews.\n  * Business Process Modeling.\n  * Workflow Diagramming.\n\n","2":null,"3":null,"4":"## Job Description\n\nMember of Technical Staff (Site Reliability Engineer)  \n  \nWho we are:  \n  \nINVIDI Technologies Corporation is the world's leading developer of software\ntransforming television all over the world. Our two-time Emmy® Award-winning\ntechnology is widely deployed by cable, satellite, and telco operators. We\nprovide a device-agnostic solution delivering ads to the right household no\nmatter what program or network you're watching, how you're watching, or\nwhether you're in front of your TV, laptop, cell phone or any other\ndevice.INVIDI created the multi-billion-dollar addressable television business\nthat today is growing rapidly globally.  \n  \nINVIDI is right at the heart of the very exciting and fast-paced world of\ncommercial television; companies benefiting from our software include DirecTV\nand Dish Network, networks such as CBS\/Viacom and A&E, advertising agencies\nsuch as Ogilvy and Publicis, and advertisers such as Chevrolet and Verizon.  \n  \nINVIDI's world-class technology solutions are known for their flexibility and\nadaptability. These traits allow INVIDI partners to transform their video\ncontent delivery network, revamping legacy systems without significant capital\nor hardware investments. Our clients count on us to provide superior\ncapabilities, excellent service, and ease of use.  \n  \nThe goal of developing a unified video ad tech platform is a big one and the\nright Product Owner --like you--flourish in INVIDI's creative, inspiring, and\nsupportive culture. It is a demanding, high-energy, and fast-paced\nenvironment. INVIDI's Product Owners are self-motivated quick studies, can-do\nindividuals who embrace the challenge of solving difficult and complex\nproblems.  \n  \nThe Opportunity:  \n  \nDo you want to be part of the team that is revolutionizing addressable\nadvertising? At INVIDI Technologies our teams share a passion to solve the\nproblems of today and to innovate for tomorrow. INVIDI has developed a cross-\nscreen platform we call INVIDI Edge. This platform allows advertisers to\ncontrol the reach, frequency and separation of their ads across linear mobile,\nover-the-top (OTT) or ad-supported video-on-demand (VOD) channels.  \n  \nAt INVIDI Development, we're agile. We work in teams of highly dedicated,\nmotivated, and passionate individuals, striving to find the best solutions to\nproblems using the right tools. It is a high energy and fast-paced\nenvironment, and often demanding, so we are seeking people who are self-\nmotivated, love to learn fast, can get things done and embrace challenges to\nsolve difficult and complex problems.  \n  \nKey Responsibilities:  \n\n  * You will design, develop, deploy and operate backend services in Java that are scalable, durable and performant.\n\n  * Proven track record of delivering incremental value continuously\n  * Proven track record of network automation\n  * Proven track record of infrastructure development\n  * Troubleshoot and resolve complex production issues within defined SLA\n  * Operational experience in high-availability environments\n  * Support strategic architectural vision of quality, scalability, performance and function.\n  * Write test and automation code to test the key parts of the system.\n  * Help investigate issues and support production systems.\n\n  \n  \nOur Requirements:  \n\n  * Bachelor's Degree in Computer Science or similar.\n  * 5+years of SRE related experience (with On call experience).\n  * Experience and understanding on Scaling, Capacity Planning and Disaster Recovery\n  * Experience automating infrastructure, testing, and deployments using tools like Terraform, Jenkins, Ansible & other industry recognized tools to deliver Infrastructure as Code.\n  * Experience troubleshooting networking protocols such as TCP\/IP, HTTPS \/TLS\/ WebSockets, Multicast and Broadcast messaging and previous experience working as a Systems Engineer, DevOps and\/or SRE capacity.\n  * Experience with scalable networking technologies, software-defined networking, network virtualization, open protocols, App acceleration, Load Balancers, DNS, virtual private networks and their application in SaaS technologies.\n  * Experience working with technologies such as SQL, Kafka, Kafka Streams, Flink, Spark, AWS, AWS Analytics Services, Google cloud (GKE, app engine, pubsub), Riak, Columnar storage and Go.\n  * Experience with languages such as Python, Unix shell, Java, C, C++, JavaScript.\n  * Experience in cloud infrastructure, storage, platforms and data. \n  * Possess experience working in a UNIX environment, Linux is preferred.\n  * Strong interpersonal, analytical, verbal and written communication skills.\n  * Excellent problem solving, teamwork and collaboration skills.\n\n  \n  \nHighly Preferred:  \n\n  * Knowledge of Cable subsystems and Satellite Systems.\n  * Broader video engineering experience such as MPEG encoding and transport, multiplexing and ad insertion.\n  * Great attitude to learn, respect for fellow employees, think out of the box, respectfully challenge ideas & hungry for innovation.\n  * Good Leadership skills and a sense of ownership and drive.\n  * Have a software-centric mindset and capable of understanding the full software stack - and beyond.Embrace automation over manual effort\n  * Experience debugging complex problems and view problems as an opportunity to improve\n  * Experience designing, building, and operating large-scale production systems\n  * Experience working in enterprise scale internal or customer centric projects to completion, developing technical solutions in collaboration with other development and engineering teams.\n  * Provide attention to detail to design, problems, KPI's, demonstrate ability to stay focused during critical production events and champion resolutions.\n  * Experience using Agile methodologies and using ALM tools like Confluence and JIRA. \n\n  \n  \nINVIDI offers competitive benefits and total rewards:  \n\n  * Paid Time Off (PTO) Vacation\n  * Company Holidays\n  * Medical & Prescription\n  * Dental & Vision\n  * RRSP, STD, LTD, AD&D and Life\n  * Corporate Discounts\n  * Tuition Reimbursement Program\n  * Employee Referral Bonus Program\n\n  \n  \nPhysical requirements:  \n\n  * INVIDI is a conscious, clean, well-organized, and supportive office environment.\n  * Prolonged periods of sitting at a desk and working on a computer are normal.\n\n  \n  \nNote:  \n\n  * All candidates must pass compliance background screening and drug testing.\n  * Visa sponsorship is not available for this position; you must be legally authorized to work in Canada.\n\n  \n  \nSalary Range Disclaimer:  \n  \nSalary is commensurate with experience, skills and education .  \n  \nEqual Opportunities and Accommodations Statement  \n  \nINVIDI is proud to be an equal opportunity employer, seeking to create a\nwelcoming and diverse environment. All qualified applicants will receive\nconsideration for employment without regard to race, color, religion, gender,\ngender identity or expression, family status, marital status, sexual\norientation, national origin, genetics, neurodiversity, disability, age, or\nveteran status, or any other non-merit based or legally protected grounds.\nINVIDI is committed to providing reasonable accommodations to qualified\nindividuals with disabilities in the employment application process. To\nrequest an accommodation, please contact Human Resources by email at at least\none week in advance of your interview.\n\n","5":"## Job Description\n\nJob Description  \n  \n**Risk Analyst**  \n  \n**Description**\n\n  * Market Risk & Model Development (MRMD) is responsible for managing the ever-changing and dynamic world of trading and non-trading market risk, counterparty credit, margin management, liquidity risk, and model development. \n  * Within MRMD, Capital Markets Risk Management (CMRM) is accountable for supporting client Securities and TBSM business objectives in accordance with the Client's risk appetite and regulatory expectations. \n  * CMRM provides independent oversight of the enterprise-wide market, counterparty credit, and liquidity risks; ensuring all significant risks are appropriately measured, reported, analyzed, and transparent. \n  * As a Liquidity Risk Projects Senior Analyst in CMRM - Risk and Valuations, you will be part of a group that is responsible for a number of activities related to the analysis and reporting of market risk, liquidity, and Independent Price Verification, Valuation adjustments, P&L Attribution, and policy implementation. \n  * The team executes infrastructure changes with regard to the implementation of new or revised risk policies, system migration, model implementations, valuation methodologies, and analysis of the key measures used by The Bank to monitor and control market and liquidity risk. \n  * CMRM is a global business supporting offices in Toronto, Calgary, New York, Singapore, Dublin, and London. \n\n  \n**Department Overview**\n\n  * The Risk Analyst will support in identifying innovative opportunities and help drive these initiatives. \n  * Evolve analytical and attribution capabilities and business knowledge, and develop skills required for today and the future, while understanding, identifying, and responding proactively to current and emerging risks. \n  * The Risk Analyst will collaborate with business partners which includes, sharing knowledge and identifying opportunities to leverage complementary skills. \n  * Partner with our stakeholders to drive and support change and to assist in meeting the bank's objectives. \n  * Develop and maintain a good understanding of the analytical principles underlying the pricing and risk management of financial derivatives, including issues that arise regarding the financial modeling of products for Risk and P&L Valuations. \n  * The Risk Analyst will help facilitate leadership, direction, advice, and empowerment of the team, alongside management. \n  * Develop analysts through cross-training, indirect coaching (Leading by example), and acting as the go-to person for daily processes and ad-hoc tasks. \n  * Work alongside management during the recruitment process. \n  * Help identify high-caliber candidates that will integrate successfully within the team. \n\n  \n**Must-Have:**\n\n  * Strong communication (interacting with stakeholders and teams) \n  * Financial Product Knowledge - liquidity risk\/ Knowledge of financial instruments, regulations, and market risk metrics, gained through academic study, or practical experience. \n  * Project Management Experience \n  * Relevant risk management exp \n  * Excel (macros and pivot tables) \n  * Previous work in an Agile environment \n\n  \n**Nice To Have**\n\n  * Python, Alteryx, SQL - An a strong asset \n  * Production reporting, understanding complex source system, impact assessment \n  * Pursuit or completion of CFA\/FRM is an asset. \n\n  \n**About the Company**\n\n  * As a top 10 North American bank, our client aims to stand out from its peers by having a differentiated brand - anchored in a proven business model and rooted in a desire to give its customers, communities, and colleagues the confidence to thrive in a changing world. \n\n  * Our client engages in providing financial products and services. They offer various financial products and services, telephone, Internet, and mobile banking services, retail and commercial banking services, and wealth management services. The Wholesale Banking segment provides capital markets, investment banking, corporate banking products, and investment needs to companies, governments, and institutions in financial markets. \n\n  \n#tech  \n#LI-GW1  \n#LI-Hybrid\n\n","6":null,"7":"## Job Description\n\nOur client a trusted Digital Engineering and Enterprise Modernization IT\nServices company with clients in 18 countries including 30 most innovative US\ncompanies, 80% of the largest banks in the US and India, and numerous\ninnovators across the healthcare ecosystem is hiring in Canada to support some\nof their large engagements.\n\nThis will be a Contract 2 Hire position and the new hires will be required to\nwork out of their Edmonton office.\n\n **Title: Front End Developers and Backend Developers**\n\n **Location: Edmonton, AL**\n\n **Experience Level: Minimum 6 Months**\n\n **Type of Hire: 6 Months Contract to Hire.**\n\n **Number of Positions: 10**\n\n ** _Job Title: FrontEnd Developers_**\n\n **Good to have Skills:**\n\n  * Good knowledge of HTML5 and CSS3\n  * Good knowledge in JavaScript or TypeScript\n  * A high level of understanding of JavaScript frameworks such as jQuery, React JS\n  * A high level of experience with UI layouts, SASS, LESS, Bootstrap, and the CSS GRID system\n  * Experience in using a complex REST API from the client-side\n  * Understanding of cross-browser compatibility issues\n  * Good knowledge and practical experience of client-side build\/config management\n  * Good understanding of code versioning tools, such as Git\n  * Good understanding of asynchronous request handling, partial page updates, and Ajax significant experience of debugging using JavaScript-based tools like Chrome Developer Console\n\n **Job Title: BackEnd Developers**\n\n **Location: Edmonton, AL**\n\n **Good to Have Skills:**\n\n  * Must have a good understanding of Java\/J2EE. Hands-on experience with injection frameworks like Spring, SpringBoot is a must.\n  * Hands-on experience and a good understanding of web services paradigms like REST\/SOAP\n  * Experience with Spring-based application development\n  * Must have good experience with Java stack and build tools like GIT, and understanding of tools for code quality and coverage\n  * Should be hands-on coding.\n  * Experience working with microservices architecture would be beneficial\n  * Should be strong in Algorithms and understanding of Database concepts\n  * Strong passion for learning and positive can-do attitude\n\n **Education:** entry level in Computer Science with 3-6 months of development\nexperience.\n\n","8":null,"9":"## Job Description\n\nAt Emerson, we are innovators and problem-solvers, focused on a common\npurpose: leaving our world in a better place than we found it. Each and every\nday, our foundational valuesintegrity, safety and quality, supporting our\npeople, customer focus, continuous improvement, collaboration and\ninnovationinform every decision we make and empower our employees to keep\nreaching higher. As a global technology and engineering leader, we provide\ngroundbreaking solutions for customers in industrial, commercial, and\nresidential markets. Our Emerson Automation Solutions business helps process,\nhybrid, and discrete manufacturers maximize production and protect personnel\nand the environment while optimizing their energy and operating costs. Our\nEmerson Commercial & Residential Solutions business helps ensure human comfort\nand health, protect food quality and safety, advance energy efficiency and\ncreate sustainable infrastructure. Emerson, a Fortune 500 company with $15.3\nbillion in sales and 200 manufacturing locations worldwide, is committed to\nhelping employees grow and thrive throughout their careers. Whether youre an\nestablished professional looking for a career change, an undergraduate student\nexploring options or a recent MBA graduate, youll find a variety of\nopportunities at Emerson. Join our team and start your journey today.  \n  \n\nIf you are an Agile Engineerprofessional looking for an opportunity to grow,\nEmerson has an exciting opportunity for you! Remote position with some travel\nrequired..\n\n  \n  \n\nAre you looking to develop your engineering career and skills in a position\nwhere you are challenged to produce tangible results on key projects that make\na difference?\n\n  \n  \n\nVerdant Energy Management Solutions is one of the fastest growing divisions in\nthe Emerson Commercial & Residential Solutions portfolio and we need team-\noriented, driven engineers to feed our software and product development.\n\n  \n  \n\nIf you enjoy working with a friendly, creative, and dynamic engineering team\nlead by aseniorleadership group of engineers, then we need to talk to you!\n\n  \n  \n\n **Position Description:**\n\n  \n  \n\nSoftware engineers develop and support a cloud based real time IoT device\nnetwork management system.Your work will help develop a multi-layered\narchitecture spanning thousands of locations, each with several hundred IoT\ndevices, all controlled in a real time SaaS environment.\n\n  \n  \n\n **AS A Senior Aglle Engineer You WILL:**\n\n  \n  \n\n  * Execute software architecture, design, implementation, debugging, release management and maintenance\n  \n\n  * Handle streams of real time big data\n  \n\n  * Design and implement robust and secure REST APIs\n  \n\n  * Analyze systems to cover performance benchmarking, reliability, security and scalability\n  \n\n  * Optimize code to handle a large number of concurrent requests in real time\n  \n\n  * Utilize the AWS platform extensively to build scalable, robust systems.\n\n  \n  \n\n**WHO YOU ARE:**\n\n  \n  \n\n  * You look for and implement new technical skills, knowledge or capabilities that can benefit the business or personal performance\n  \n\n  * You readily learn and adopt new technologies\n  \n\n  * You identify and create the processes necessary to get work done\n  \n\n  * You separate and combine activities into an efficient workflow\n  \n\n  * You work cooperatively with others across the organization to achieve shared objectives\n  \n\n  * You are detail oriented and willing to roll up your sleeves\n  \n\n  * You are able to operate in a fast growth, entrepreneurial environment with shifting priorities\n\n  \n  \n\n**_Required Education, Experience & Skills_**  \nBachelors degree or higher in system-level software development\n\n  \n  \n\n  * Intermediate Java Developer with 10+ years overall experience with Java frameworks such as Springboot, Spring, or J2EE\n  \n\n  * Experience in software design, development, implementation and software engineering which also includes integration, maintenance and testing of various client\/server, cloud, and web applications.\n  \n\n  * Experience in writing Testsusing Junit or similar libraries\n  \n\n  * Advanced knowledge of Design Patterns, code refactoring, service-oriented architecture and domain-driven design\n  \n\n  * Experience with RESTful APIs and API tools like Swagger or OpenAPI\n  \n\n  * Experience with relational databases.\n\n  \n  \n\n#LI-remote\n\n  \n  \n\n  \n  \n\nVerdant Environmental Technologies is a focus business unit in the Commercial\nand Residential platform of Emerson based in Montreal. Our goal is to\nquadruple sales in the next 3-5 years and we will need strong engineering\ntalent to continue our dominance and aggressive growth in our industry\nsectors.\n\n  \n  \n![\n](https:\/\/ars2.equest.com\/?response_id=1a9155543316a32be1de476cde96f979&view)\n\n","10":null,"11":"## Job Description\n\n**Job Summary**\n\nThoughtFocus’ innovation center brings the technology of the future to solve\nthe business challenges of today. Our business solutions are built by experts\nwho understand the unique challenges to our client's organizations and\nindustries. As a UX Design Engineer at ThoughtFocus, you will be regarded as\nan expert product and service designer, as well as a user experience, and\nthought leader with strong business acumen. Uses advanced knowledge and\nexperience to conceptualize and craft ideas into tangible, usable, and useful\nexperiences. Influences evolves and improves design standards and guidelines\nto improve the overall user experience quality\n\n**Essential Job Functions**\n\n  * Provide strategic thinking around user-research and UX\n  * Collaborate with leadership to drive strategy and develop product roadmap\n  * Capable of driving interviews, negotiate with leadership for a design that drive business objectives\n  * Create interactive mockups with tools like Figma\n  * Ability to interview and facilitate workshops with product owners\n  * Partners with research team to facilitate various user research tests\n  * Excellent written and spoken communication skills\n  * Effectively uses established Design System standards and contributes to it\n  * Create delightful online and offline experiences that are suitable for our target customers\n\n**Required Education, Skills, and Experience**\n\n  * Bachelor’s Degree in computer science or any other applied discipline\n  * 8+ years’ experience as a UX Designer\n  * Expert in 1 or more Visual Design Tools (Sketch, Axure, Figma, Adobe Creative Suite, Mural etc.)\n  * Proficient in design\/wire framing\/mock-up tools\n  * Expert in whiteboarding and Storyboarding\n  * Experience working in HTML, CSS, and JavaScript\n  * 5+ years in interview techniques\/feedback session facilitation and teamwork\n  * Professional written, verbal, and interpersonal skills \n  * Ability to translate user needs into business-process workflows and identify elements of user experience\n  * A solid grasp of user-centered design and user testing methodologies and accessibility concerns\n  * Experience creating customer personas, customer journey maps, empathy maps, story maps, prototypes, and wireframes\n\n","12":"## Job Description\n\nMember of Technical Staff (Site Reliability Engineer)  \n  \nWho we are:  \n  \nINVIDI Technologies Corporation is the world's leading developer of software\ntransforming television all over the world. Our two-time Emmy® Award-winning\ntechnology is widely deployed by cable, satellite, and telco operators. We\nprovide a device-agnostic solution delivering ads to the right household no\nmatter what program or network you're watching, how you're watching, or\nwhether you're in front of your TV, laptop, cell phone or any other\ndevice.INVIDI created the multi-billion-dollar addressable television business\nthat today is growing rapidly globally.  \n  \nINVIDI is right at the heart of the very exciting and fast-paced world of\ncommercial television; companies benefiting from our software include DirecTV\nand Dish Network, networks such as CBS\/Viacom and A&E, advertising agencies\nsuch as Ogilvy and Publicis, and advertisers such as Chevrolet and Verizon.  \n  \nINVIDI's world-class technology solutions are known for their flexibility and\nadaptability. These traits allow INVIDI partners to transform their video\ncontent delivery network, revamping legacy systems without significant capital\nor hardware investments. Our clients count on us to provide superior\ncapabilities, excellent service, and ease of use.  \n  \nThe goal of developing a unified video ad tech platform is a big one and the\nright Product Owner --like you--flourish in INVIDI's creative, inspiring, and\nsupportive culture. It is a demanding, high-energy, and fast-paced\nenvironment. INVIDI's Product Owners are self-motivated quick studies, can-do\nindividuals who embrace the challenge of solving difficult and complex\nproblems.  \n  \nThe Opportunity:  \n  \nDo you want to be part of the team that is revolutionizing addressable\nadvertising? At INVIDI Technologies our teams share a passion to solve the\nproblems of today and to innovate for tomorrow. INVIDI has developed a cross-\nscreen platform we call INVIDI Edge. This platform allows advertisers to\ncontrol the reach, frequency and separation of their ads across linear mobile,\nover-the-top (OTT) or ad-supported video-on-demand (VOD) channels.  \n  \nAt INVIDI Development, we're agile. We work in teams of highly dedicated,\nmotivated, and passionate individuals, striving to find the best solutions to\nproblems using the right tools. It is a high energy and fast-paced\nenvironment, and often demanding, so we are seeking people who are self-\nmotivated, love to learn fast, can get things done and embrace challenges to\nsolve difficult and complex problems.  \n  \nKey Responsibilities:  \n\n  * You will design, develop, deploy and operate backend services in Java that are scalable, durable and performant.\n\n  * Proven track record of delivering incremental value continuously\n  * Proven track record of network automation\n  * Proven track record of infrastructure development\n  * Troubleshoot and resolve complex production issues within defined SLA\n  * Operational experience in high-availability environments\n  * Support strategic architectural vision of quality, scalability, performance and function.\n  * Write test and automation code to test the key parts of the system.\n  * Help investigate issues and support production systems.\n\n  \n  \nOur Requirements:  \n\n  * Bachelor's Degree in Computer Science or similar.\n  * 5+years of SRE related experience (with On call experience).\n  * Experience and understanding on Scaling, Capacity Planning and Disaster Recovery\n  * Experience automating infrastructure, testing, and deployments using tools like Terraform, Jenkins, Ansible & other industry recognized tools to deliver Infrastructure as Code.\n  * Experience troubleshooting networking protocols such as TCP\/IP, HTTPS \/TLS\/ WebSockets, Multicast and Broadcast messaging and previous experience working as a Systems Engineer, DevOps and\/or SRE capacity.\n  * Experience with scalable networking technologies, software-defined networking, network virtualization, open protocols, App acceleration, Load Balancers, DNS, virtual private networks and their application in SaaS technologies.\n  * Experience working with technologies such as SQL, Kafka, Kafka Streams, Flink, Spark, AWS, AWS Analytics Services, Google cloud (GKE, app engine, pubsub), Riak, Columnar storage and Go.\n  * Experience with languages such as Python, Unix shell, Java, C, C++, JavaScript.\n  * Experience in cloud infrastructure, storage, platforms and data. \n  * Possess experience working in a UNIX environment, Linux is preferred.\n  * Strong interpersonal, analytical, verbal and written communication skills.\n  * Excellent problem solving, teamwork and collaboration skills.\n\n  \n  \nHighly Preferred:  \n\n  * Knowledge of Cable subsystems and Satellite Systems.\n  * Broader video engineering experience such as MPEG encoding and transport, multiplexing and ad insertion.\n  * Great attitude to learn, respect for fellow employees, think out of the box, respectfully challenge ideas & hungry for innovation.\n  * Good Leadership skills and a sense of ownership and drive.\n  * Have a software-centric mindset and capable of understanding the full software stack - and beyond.Embrace automation over manual effort\n  * Experience debugging complex problems and view problems as an opportunity to improve\n  * Experience designing, building, and operating large-scale production systems\n  * Experience working in enterprise scale internal or customer centric projects to completion, developing technical solutions in collaboration with other development and engineering teams.\n  * Provide attention to detail to design, problems, KPI's, demonstrate ability to stay focused during critical production events and champion resolutions.\n  * Experience using Agile methodologies and using ALM tools like Confluence and JIRA. \n\n  \n  \nINVIDI offers competitive benefits and total rewards:  \n\n  * Paid Time Off (PTO) Vacation\n  * Company Holidays\n  * Medical & Prescription\n  * Dental & Vision\n  * RRSP, STD, LTD, AD&D and Life\n  * Corporate Discounts\n  * Tuition Reimbursement Program\n  * Employee Referral Bonus Program\n\n  \n  \nPhysical requirements:  \n\n  * INVIDI is a conscious, clean, well-organized, and supportive office environment.\n  * Prolonged periods of sitting at a desk and working on a computer are normal.\n\n  \n  \nNote:  \n\n  * All candidates must pass compliance background screening and drug testing.\n  * Visa sponsorship is not available for this position; you must be legally authorized to work in Canada.\n\n  \n  \nSalary Range Disclaimer:  \n  \nSalary is commensurate with experience, skills and education .  \n  \nEqual Opportunities and Accommodations Statement  \n  \nINVIDI is proud to be an equal opportunity employer, seeking to create a\nwelcoming and diverse environment. All qualified applicants will receive\nconsideration for employment without regard to race, color, religion, gender,\ngender identity or expression, family status, marital status, sexual\norientation, national origin, genetics, neurodiversity, disability, age, or\nveteran status, or any other non-merit based or legally protected grounds.\nINVIDI is committed to providing reasonable accommodations to qualified\nindividuals with disabilities in the employment application process. To\nrequest an accommodation, please contact Human Resources by email at at least\none week in advance of your interview.\n\n","13":"## Job Description\n\nMyticas Consulting's direct client is looking for a Data Architect who is\nexperienced with Microsoft Dynamics as well as MS Suite (SharePoint, Teams\netc.) - who would be interested in a part time contract within the Ottawa, ON\nregion.  \n  \nIdeal requirements are:  \n\n  * 5+ years of technical working experience in the technology architecture and infrastructure spaces or cloud space\n  * Technical working experience in an architectural practice within the above experience\n  * Demonstrated experience with a successful integration of acquisition into an enterprise • Architectural or technical understanding of one of the following: Office 365, SharePoint, MS teams\n  * Bilingual is a nice to have\n\n  \n#PandoCA  \nPandoLogic.Category: Technology, Keywords: Data Architect\n\n","14":null,"15":"## Job Description\n\n**Job Summary**\n\nYour primary focus will be developing user-facing web applications and\ncomponents. You’ll implement them with the .Net framework, following generally\naccepted practices and workflows. You will ensure that you produce robust,\nsecure, modular, and maintainable code. You will coordinate with other team\nmembers, including back-end developers and UX\/UI designers. Your commitment to\nteam collaboration, good communication, and a quality product is crucial.\n\n**Essential Job Functions**\n\n  * Translate application storyboards and use cases into functional applications\n  * Design, build, and maintain efficient, reusable, and reliable code with documentation\n  * Ensure the best possible performance, quality, and responsiveness of applications\n  * Identify bottlenecks and bugs, and devise solutions to mitigate and address these issues\n  * Help maintain code quality, organization, and automatization\n  * Follow the Project Defined Process, Organizational Standards and Policies\n  * Regular Progress Updates to Reporting Manager\n  * Interact with team, peer review, fix peer reported issues\n  * Design, develop, unit test and release high quality code for new and existing products\/applications.\n  * Participate actively in design, code, and quality reviews.\n  * Participate actively as a member of a scrum team including story creation, estimation, planning, sprint review demonstrations, and retrospectives.\n  * Adhere to the complete software development processes, design, coding, test automation, and release management standards, guidelines and processes; suggest and implement improvements\n\n**Required Education, Skills and Experience**\n\n  * Bachelor’s Degree in computer science or any other applied discipline\n  * 3+ years’ experience in building .Net applications.\n  * Understanding of the cloud architecture patterns and solution design principles.\n  * Experience in Microsoft Stack .Net Core, .Net\/C#\/ASP.NET development\n  * Hands-on experience in creating consuming Web APIs\n  * Hands-on experience in MS Azure SQL\n  * Hands-on experience in ReactJS, Redux, and related technologies\n  * Hands-on experience with web technologies, including JSON\/XML, RESTful, and SOAP-based web services.\n  * Hands-on experience in Microservices development on Azure using Container Service and AKS.\n  * Experience in Azure App Service Model Web Apps, Mobile Apps, API Apps, and Web Jobs.\n  * Experience working with React Native Hybrid Application using Redux\/Flux\/MOBX and other associated build tools such as Gradle, React Native CLI, Node, NPX and Yarn, etc\n  * Excellent knowledge of JSON, Firebase, HTML5, CSS3, Javascript, TypeScript, OOPS concept, functional programming, and the third-party API like Facebook, Google, Apple and Social media integration, etc\n  * Previous experience in following TDD is a MUST\n  * Hands-on coding is a MUST with writing unit tests\n  * Experience in writing automation tests (see note on test-driven development),\n  * Experience with code versioning tools (Such as BitBucket, Git, or SVN) with Agile Development, SCRUM methodologies\n  * Translate application storyboards and use cases into functional applications\n  * Design, build, and maintain efficient, reusable, and reliable code with documentation\n  * Ensure the best possible performance, quality, and responsiveness of applications\n  * Identify bottlenecks and bugs, and devise solutions to mitigate and address these issues\n  * Help maintain code quality, organization, and automatization\n  * Follow the Project Defined Process, Organizational Standards and Policies\n  * Regular Progress Updates to Reporting Manager\n  * Interact with team, peer review, fix peer reported issues\n  * Participate actively in design, code, and quality reviews.\n  * Participate actively as a member of a scrum team including story creation, estimation, planning, sprint review demonstrations, and retrospectives.\n  * Adhere to the complete software development processes, design, coding, test automation, and release management standards, guidelines and processes; suggest and implement improvements\n  * Strong hands-on experience in JavaScript\/CSS\/HTML, HTML5\n  * Strong hands-on experience writing high performance SQL queries\n  * Strong experience building RESTful services.\n  * Strong understanding of RDBMS design.\n\nPreferred Education, Skills and Experience\n\n  * Analytical skills\n  * Coding \/ Programming skills\n  * Database skills\n  * Documentation skills\n  * Unit Testing skills\n  * Database Testing skills\n\n","16":"## Job Description\n\n**Job Description:**  \n  \n ***Candidates must be located within Toronto or surrounding areas. The role\nwill by a hybrid position, 1-2 days\/week on site. This is a Full-Time\nposition.**  \n  \n**Department overview**  \n  \nData and Analytics (EDA) business line within our client's financial services\nprovides market leading products and key market analytics to a broad range of\nindustry participants for Securities Finance, Index and ETF products and\nDividend Forecasting.  \n  \n**Position summary**  \n  \nWe are seeking an experienced, technically strong Application Support\nSpecialist to join a global team that delivers specialized technical support\nof major product deliverables and availability of our solutions. This role\nfocuses on continuously improving support processes through collaboration\ncentralizing on proactive, technical and innovative engagements across\nbusiness stakeholders, operations and development teams.  \n  \n**Duties & accountabilities **  \n\n  * Apply strong technical skills and good business knowledge together with investigative techniques to identify and resolve issues efficiently and in a timely manner \n  * Immerse in the business domain, identify and implement innovative solutions and technologies that enhance system and application monitoring \n  * Demonstrate excellent communication skills valuable for managing service incidents and working collaboratively with other teams \n  * Implement and monitor system alerts for early detection and mitigation of potential service incidents \n  * Involve and contribute solutions that address system and application vulnerabilities \n  * Constantly coordinate with product and development teams to ensure support readiness of new releases and enhancements \n  * Work on tooling, solutions and automation of operational support functions \n\n  \n  \n**Education & experience **  \n\n  * University Graduate with bachelor's degree in Computer Science or Computer Engineering related degree \n  * Experience in reading and debugging Java code is essential \n  * Must be knowledgeable in SDLC and experience in raising development bugs - including priority assessment, high quality analysis, and detailed investigation. Understanding of Agile methodology, a plus \n  * Extensive experience in an Application Support role \n  * Experience working on AWS cloud technologies preferred (Lambda, SQS, SNS, S3, Dynamo DB, Step Functions, EC2, Fargate etc.) \n  * Must be knowledgeable in SDLC and experience in raising development bugs - including priority assessment, high quality analysis, and detailed investigation \n  * Broad knowledge of server administration across different operating systems such as Linux and Windows technologies. Good shell scripting experience is a must. Ability to use python scripting is an advantage \n  * Ideally familiar with monitoring tools such as DataDog, PagerDuty, Splunk and Centreon \n  * Demonstrable experience of working on highly transactional, available and scalable business critical systems \n  * Good understanding of software architecture; understanding component and application breakdown and interaction \n\n  \n  \n**Commercial awareness**  \n\n  * Knowledge of, or experience of working in the financial services industry would be a plus \n  * Excellent understanding of software systems and technology \n  * Good understanding of software support team functions and a solid understanding of the end to end application development process. \n  * A strong desire to keep up with all of the latest developments in related technologies \n\n","17":"## Job Description\n\nAtyeti Inc is a Global Information Technology Solutions and Services provider,\nwith offices in USA, UK, Switzerland, Poland, India, Singapore, Malaysia,\nColombia and Hong Kong. We specialize in providing IT Solutions in Capital\nMarkets and Financial Services.\n\n**Recognition:**\n\n500 & 5000 Honoree Company for 2012,2013,2014,2015 and 2016\n\nAtyeti Ranks No. 270 on the 2012 Inc. 500 List\n\n2012,2016 and 2017 NJ 50 Fastest Growing Companies.\n\nGlobal Investment Bank is looking to hire a **Pega Developer** for its team in\n**Montreal Canada (Hybrid)** location.\n\nInterested candidates please contact: **arun.kumar(at)atyeti.com**\n\n ****\n\n**Title : Pega Developer**\n\n **Location : Montreal Canada (Hybrid)**\n\n **Hiring Mode : Contract**\n\n**Job Description:**\n\n  * 5+ years of experience in software development as PEGA.\n  * Development experience with Pega Rules and BPM engine.\n  * Demonstrated success in full lifecycle PEGA implementations (preferably PEGA 7 and 8) including live implementation in PEGA.\n  * Pega Certified Senior System Architect (CSSA).\n  * Strong understanding & knowledge of PEGA concepts and implementation experience with PEGA connectors, performance tuning, decision trees, listeners, UI design, Integration, Security Model etc.\n  * Specific Pega skills\/experience:\n  * PEGA PRPC Use Case Development minimum 5 years’ experience preferred.\n  * Converting business into process flow minimum 5 years’ experience preferred.\n  * Prefer Pega 8.x.\n  * Other Required Skills\/ Experience.\n  * Experience in all phases of software development lifecycle including analysis, design, implementation, testing and deployment\n  * Ability to troubleshoot and resolve complex production issues.\n  * Ability to create reusable components that can be leveraged across the enterprise for providing top-notch customer experience.\n  * Perform regular code and design reviews.\n  * Business Process Modeling.\n  * Workflow Diagramming.\n\n","18":"## Job Description\n\n![](https:\/\/counter.adcourier.com\/UHJ1ZGh2aXJhai5WZW1wYXRpLjQ3NDAzLjQwNzNAYmNmb3J3YXJkLmFwbGl0cmFrLmNvbQ.gif)  \n  \n\nCustomer Service Representative\/Helpdesk - Bilingual\n\n  \n\n **BCforward is currently seeking highly motivated** **CA-Customer Service\nRepresentative\/Helpdesk - Bilingual - Analyst** \\- **Mississauga, ON**\n\n  \n\n  \n\nWe place consultants for end clients all over CANADA.\n\n  \n\n  \n\n**Job Title: CA-Customer Service Representative\/Helpdesk - Bilingual -\nAnalyst**\n\n  \n\n**Location: Mississauga, ON**\n\n  \n\n **Expected Duration: 6 Months Contract**\n\n  \n\n  \n\n**Job Description:**\n\n  \n\n6mo, this role is likely to convert after 90 days, depending on performance  \n  \nMississauga, CAN - !00% onsite for 6 weeks training - then moving to hybrid\nschedule (3 days\/wk in office)  \n  \nHours of Operations : Monday - Friday 8:00 am to 9:00 pm and Saturday\/Sunday.\n8:00am - 6:00pm. Specific shifts available will be discussed during the job\noffer.  \n  \nCustomer Service -Bilingual French\/English  \n  \nThe Service Rep 4 is an entry level position responsible for assisting with\ncustomer service inquiries and providing solutions based on client needs in\ncoordination with the Customer Service function. The overall objective is to\nanalyze the best course of action to resolve client issues.  \n  \nResponsibilities:  \n* Assist with evaluating and resolving service inquiries from clients across different platforms  \n* Effectively use various computer systems to complete assigned tasks and address account inquiries  \n* Develop and maintain working knowledge of specific groups of Company products and services  \n* Analyze and identify potential risks and identify solutions that meet client needs  \n* Complete assigned tasks in an accurate and efficient manner  \n* Solve disputes and retain clients, while minimizing operating loss, through adherence to established rules and regulations  \n* Appropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Company, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency.  \n  \nQualifications:  \n* 1-3 years' work experience in a related role  \n* Proficient in Microsoft Office and Windows Operating Systems  \n* Demonstrated experience solving customer service inquiries  \n* Effective verbal and written communication skills  \n* Ability to work in a fast pace environment  \n* Excellent technical and data entry skills, including the utilization of a 10-key touchpad  \n* Proven ability to navigate multiple systems and customer service platforms concurrently  \n  \nEducation:  \n* High School diploma or equivalent  \n  \nThis job description provides a high-level review of the types of work\nperformed. Other job-related duties may be assigned as required.  \n* Bilingual French and English Required  \n* Ability to work a shift as assigned during business hours operation including statutory holidays and weekends.\n\n  \n\n ****\n\n  \n\n**About BCforward:**\n\n  \n\nBCforward began as an IT business solution and staffing firm. Founded in 1998,\nBCforward has grown with our customers' needs into a full-service personnel\nsolution's organization. Headquartered in Indianapolis, Indiana, BCforward\nalso operates numerous delivery centers across North America and India. We are\ncurrently the largest consulting firm and largest MBE certified firm in\nIndiana. Our uninterrupted growth has allowed BCforward to deliver uniquely\nconfigured IT staffing and project solutions for over the years of catering to\nour customers' specific needs. BCforward currently maintains a team of over\n5000 global resources. With our additional brand, Stafforward, together we\nhave the capabilities to deliver services for a variety of industries in both\npublic and private sectors which allows us to address your most challenging\nneeds.\n\n  \n\n  \n\n[www.BCforward.com](http:\/\/www.bcforward.com\/)\n\n  \n\n  \n\n[www.facebook.com\/bcforward](http:\/\/www.facebook.com\/bcforward)\n\n  \n\n\"We must inform you that during the hiring process, we may ask for you to\ndisclose and provide us with various categories of your personal information,\nincluding identifiers such as your name and address, professional information,\ncommercial information, education information, and other related information.\nPlease note that we will only use this information to facilitate and complete\nthe recruiting process. This posting is not an offer of employment. The\nsubmission of intentionally false or fraudulent information in response to\nthis job posting shall render the applicant ineligible for the position.\nBCforward is an equal opportunity employer. Any subsequent offer of employment\nshall be considered employment at will regardless of the anticipated\nassignment duration.\"\n\n  \n\n  \n\n  \n\nInterested candidates please send resume in Word format Please reference job\ncode 178398 when responding to this ad.\n\n  \n\n* * *\n\n  \n\n","19":null,"20":"## Job Description\n\n![](https:\/\/counter.adcourier.com\/UHJ1ZGh2aXJhai5WZW1wYXRpLjE1ODk1LjQwNzNAYmNmb3J3YXJkLmFwbGl0cmFrLmNvbQ.gif)  \n  \n\nUI Developer\n\n  \n\n **BCforward is currently seeking highly motivated CA-Specialty Developer-\nAnalyst** \\- **Mississauga, ON**\n\n  \n\n  \n\nWe place consultants for end clients all over CANADA.\n\n  \n\n  \n\n**Job Title: CA-Specialty Developer-Analyst**\n\n  \n\n**Location: Mississauga, ON**\n\n  \n\n **Expected Duration: 12 Months Contract**\n\n  \n\n  \n\n**Job Description:**\n\n  \n\nUI Developer - Angular\/TypeScript\/HTML5\/CSS3\/C#  \n  \nMust to have skills\/experience  \n1\\. Strong Angular 8.0+ & TypeScript  \n2\\. Strong RxJS (handling streaming data) & ngRX  \n3\\. Ag-Grid  \n  \nNice to have  \n1\\. JEST\/Jasmine  \n2\\. HTML5 & CSS3 (Sass\/LESS)  \n3\\. Building desktop applications using Electron, Chromium, OpenFin etc.  \n  \n  \n  \n  \nDescription  \n  \nJob Purpose:  \n  \nWe are looking for talented and passionate web developers to continue to\nevolve our next-generation trading application.  \n  \nThe role requires a detailed understanding of software design\/best practices\nalong with a strong technical ability.  \n  \nThis is a challenging and exciting opportunity to work on high profile trading\napplication. The team works closely with end users gaining direct exposure to\nthe fast paced world of front office trading and finance.  \n  \nJob Background\/context:  \n  \nG10 Rates Technology is responsible for delivering state of the art technology\nsolutions to the Global G10 Rates business. Initiatives includes deliveries\nacross sales, risk, pricing, algorithmic trading, execution, trade processing,\nand much more.  \n  \nClient is one of the top global dealers on the street in Fixed Income and\ncontributing to that success is a great opportunity to develop cutting edge\ntechnical skills with strong career opportunities.  \nThe Fixed Income business has set out an ambitious growth plan, and strong\ntechnical development is critical to achieving our goals and enhancing our\nleading position in the financial market.  \n  \nJob Responsibilities \/ Role:  \n  \n* Designing and developing the flagship \"Trader Desktop\" platform  \n* Working directly with end users on requirements analysis and capture  \n* Troubleshooting challenging performance and scalability issues  \n* Liaising with the global business, support, and development teams  \n* Assisting in third line support during core trading hours  \n* Enhancing our automated testing efforts and optimizing our UAT process  \n  \nJob Opportunities:  \n  \n* Utilize the latest and greatest Web technologies.  \n* Develop efficient and robust solutions to challenging business problems.  \n* Work on a globally distributed team to deliver the next generation UI experience for traders at Company.  \n* Gain knowledge and exposure to Front Office Trading Systems, Fixed Income, and Derivatives flows.  \n  \nQualifications  \n  \nRequired  \n  \n* 7+ years of experience in developing large-scale enterprise desktop Web applications  \n* Experience using Angular 8.0+, TypeScript, HTML 5, CSS3, SAAS, LESS  \n* Experience using Angular grid libraries (ag-Grid).  \n* Experience with RxJS and ngRX  \n* Experience with writing unit tests for Typescript using JEST  \n* Experience with building desktop applications using Web technologies such as Electron, Chromium, OpenFin etc.  \n* Experience with consuming real-time streaming data through web sockets  \n* Experience with consuming static JSON data through REST services  \n* Experience with tools such as Visual Studio Code, npm, node.js  \n* Experience with modern software development practices such as Agile development, test-driven development, and continuous delivery as it pertains to enterprise web applications.  \n  \nNice to Have  \n  \n* Experience utilizing C#\/.NET and object oriented programming  \n* Experience with writing unit tests for C#\/.NET (NUnit\/MSTest\/SpecFlow etc.)  \n* Experience with Rx extensions (.NET)  \n* Experience with KDB\/q databases  \n* Experience developing large financial software trading systems.  \n* Knowledge of any Interest Rates or Futures financial products (e.g. Treasuries\/Swaps).  \n* Experience with web-based data visualization utilizing HighCharts charting library.  \n  \nAdditional Information \/ Preferences:  \n  \nEducation:  \n  \n* Bachelor degree in Computer Science \/ Information Technology or a related field.  \n  \nCompetencies:  \n  \n* Excellent communication skills, oral and written; ability to face off to business users.  \n* Good team-work skills, and the ability to work in a distributed global team environment  \n* Strong analytical and problem solving skills  \n* Self-motivated with the determination to achieve his\/her goals  \n* Flexible and able to deliver quality results in the required timeframe  \n* Experience in full lifecycle development  \n* Ability to multi-task effectively\n\n  \n\n ****\n\n  \n\n**About BCforward:**\n\n  \n\nBCforward began as an IT business solution and staffing firm. Founded in 1998,\nBCforward has grown with our customers' needs into a full-service personnel\nsolution's organization. Headquartered in Indianapolis, Indiana, BCforward\nalso operates numerous delivery centers across North America and India. We are\ncurrently the largest consulting firm and largest MBE certified firm in\nIndiana. Our uninterrupted growth has allowed BCforward to deliver uniquely\nconfigured IT staffing and project solutions for over the years of catering to\nour customers' specific needs. BCforward currently maintains a team of over\n5000 global resources. With our additional brand, Stafforward, together we\nhave the capabilities to deliver services for a variety of industries in both\npublic and private sectors which allows us to address your most challenging\nneeds.\n\n  \n\n  \n\n[www.BCforward.com](http:\/\/www.bcforward.com\/)\n\n  \n\n  \n\n[www.facebook.com\/bcforward](http:\/\/www.facebook.com\/bcforward)\n\n  \n\n\"We must inform you that during the hiring process, we may ask for you to\ndisclose and provide us with various categories of your personal information,\nincluding identifiers such as your name and address, professional information,\ncommercial information, education information, and other related information.\nPlease note that we will only use this information to facilitate and complete\nthe recruiting process. This posting is not an offer of employment. The\nsubmission of intentionally false or fraudulent information in response to\nthis job posting shall render the applicant ineligible for the position.\nBCforward is an equal opportunity employer. Any subsequent offer of employment\nshall be considered employment at will regardless of the anticipated\nassignment duration.\"\n\n  \n\n  \n\n  \n\nInterested candidates please send resume in Word format Please reference job\ncode 178284 when responding to this ad.\n\n  \n\n* * *\n\n  \n\n"},"Salary":{"0":null,"1":"Depends on Experience","2":null,"3":null,"4":null,"5":null,"6":null,"7":"Depends on Experience","8":null,"9":"-","10":null,"11":"Depends on Experience","12":null,"13":null,"14":null,"15":"$40 - $50","16":null,"17":"Depends on Experience","18":null,"19":null,"20":null}}