[{"id":"MP3F3","Title":"Senior iOS Developer","Entreprise":"Motion Recruitment","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\n**Senior iOS Engineer**  \n  \nJob Description  \n  \nMy client is a publicly traded fortune 500 company that specializes in banking\nand credit management. For years, they've tailored innovative credit solutions\nwhich are specific to the individual needs of Canadians. By serving millions\nof people daily, to build opportunities to learn and secure a stronger\nfinancial future.  \n  \nRequired Skills & Experience  \n\n  * Exposure to RXSwift, Swift UI, Cocoapods and\/or Swift Package Manager, Moya, XCTest, XCUITest, Combine\n  * Familiarity with front-end technology and frameworks such as React or Angular\n  * Objective-C development experience\n  * Java development experience\n  * Exposure to CI\/CD pipeline development via Jenkins, Fastlane, Groovy • Exposure to REST APIs\n\n  \nDesired Skills & Experience  \n\n  * At least 5 years of experience (Principal level) or 2 years of experience (Senior level) in Native iOS Development\n  * At least 1 year of experience conducting Tests using XCUITest\/ XCTest\n  * Good understanding of architecture principles; MVVM, MVP, MVC, etc.\n  * Bachelor's Degree or Diploma\n\n  \nWhat you will be doing  \n\n  * 100% Hands on.\n\n  \nThe Offer  \n\n  * Remote.\n  * 5k per year for education.\n  * 7.5% RRSP matching.\n  * 3 Weeks of vacation.\n\n  \n  \nApplicants must be currently authorized to work in Canada on a full-time basis\nnow and in the future. Accommodation will be provided in all parts of the\nhiring process as required under Motion Recruitment's Employment Accommodation\npolicy. Applicants need to make their needs known in advance.\n\n","Salary":null},{"id":"viJD6","Title":"Senior R&D Engineer (C++ Software Developer)","Entreprise":"Jobot","Type_Employ":null,"Location":"Calgary","Description":null,"Salary":null},{"id":"blxxp","Title":"Senior Java Developer (1 year CT, 100% Remote, 5G Project)","Entreprise":"Motion Recruitment","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nWe've partnered with an IT leader internationally, with their innovative\nservices expanding across finance, telecommunications, retail etc.  \n  \nCurrently looking for one year contractors, they have a need for Senior Java\nDevelopers who have experience in the **telecommunications** sector, utilizing\nJava, Spring Boot, and Python scripting. Knowledge of Microservices processes,\nCI\/CD pipelines, and containerization tools is a plus. This is an innovative\n5G networking project, that will shape the user experience for millions across\nNorth America!  \n  \nThis opportunity is also remote across Canada, and after the one year duration\nthere is room for extension or conversion to full-time.  \n  \nInterested in learning more? Apply today to be considered!  \nRequired Skills & Experience\n\n  * Java 8+, J2EE\n  * Spring Boot\n  * Python scripting\n  * 3 years of professional experience in Software Development and upwards\n\nDesired Skills & Experience\n\n  * Bachelors of Science Computer Science\/Engineering degree , or equivalent\n  * Knowledge of\/experience working in cloud environments (major platforms like AWS, Google Cloud Platform, Azure)\n  * DevOps knowledge (Pipelines, containers) is a plus\n\nWhat You Will Be Doing  \nTech Breakdown  \n\n  * 70% Java and related tools\/technologies\n  * 30% Cloud and deployment of applications\n\n  \nDaily Responsibilities  \n\n  * 80% Hands On\n  * 20% Team Collaboration\n\nThe Offer\n\n  * Competitive Rate: Up to $90\/hour, DOE\n\n  \nApplicants must be currently authorized to work in Canada on a full-time basis\nnow and in the future.\n\n","Salary":null},{"id":"ylOrq","Title":"Architect\/Solutions Designer","Entreprise":"Global Technical Talent","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nJob Description  \n  \n**Architect\/Solutions Designer**  \n  \n**About This Role**\n\n  * Our client is looking for an Architect\/Solutions Designer armed with a strong toolkit to develop and maintain technology solutions that adhere to engineering and architectural design principles while meeting business requirements. \n  * You'll also provide technical expertise with a focus on efficiency, reliability, scalability, and security. \n  * This mandate includes planning, evaluating, recommending, designing, operationalizing, and supporting solutions in compliance with enterprise and industry standards. \n  * Our client hopes you'll be inspired both by the work we do and the people who make it all happen. \n  * Meaningful work is fueled by meaningful performance and career development conversations with your manager. Here's some of what you may be asked to perform: \n\n  \n**Job Responsibilities** :\n\n  * Architect\/Solutions Designer will develop and document a detailed solution design within SDS, and impart your subject matter expertise throughout the life cycle. \n  * Participate in complex applications and systems development, and programming. \n  * Give solution options. bolster stakeholder support. \n  * Collaborate with stakeholders on project estimates. \n  * Produce top-notch functional, technical, and user interface designs. \n  * Take business, Enterprise Architecture, system performance, and development standards requirements, then develop functional, technical, and user interface designs for an application and\/or system. \n  * Consult on System Requirements Specification (SRS) development. \n  * Review technical deliverables for quality throughout the detailed design and development phase, identify gaps or redesign as needed. \n  * Define metrics and performance goals with technology partners and peers. \n  * Respect technology delivery practices and standards, project management disciplines, business technology architecture, and risk and production capacity - this includes thorough project requirements, documentation, scope estimates, and costs. \n  * Deliver effective and efficient solutions by meeting milestones and ensuring project deliverables are on time, within budget, and adhere to the corporate quality and security standards. \n  * Find ways to keep costs low, help come up with strategic solutions to support cost-effectiveness, and enhance stakeholder experience. \n  * Conduct code reviews to address quality, standards compliance, reusability and ease of maintenance, Operational Readiness Reviews, and support gating and review signoffs for solution design. \n  * Support knowledge management processes and ensure knowledge is codified, monitored, tracked, and managed. \n  * Ensure design leverages existing components and traces back to business requirements \n  * Identify and address any issue that affects the integrity of the application (e.g. cross-capability\/release issues). \n  * Provide technical support to promptly resolve escalated incidents\/outages. \n  * Complete knowledge transfer to support team and provide detailed technical information to build the application support procedures. \n\n  \n**Must Haves:**\n\n  * Minimum 7 years of solid experience as a Solutions Designer or Architect \n  * Minimum 7 years with solid experience in Java\/J2EE, application analysis, design, development \n  * Minimum 7 years experience in common practices of application designs under highly security protected Windows\/Linux\/Unix Environment \n  * Deep understanding of SQL Server and Data warehouse solutions and Splunk integration \n  * WebSphere\/JBOSS\/Tomcat hands-on experience minimum 5 years \n  * 5 years of Banking or Financial institution experience \n  * Experience using MKS or GIT or Clear Case or another code repository \n  * Experience with Confluence, JIRA, and Service Now \n  * Experience using MKS or GIT or Clear Case or another code repository \n  * Ability to work for hands-on coding, deployments, investigations, etc. as required for projects when required \n  * Proficiency in leading complex and comprehensive project plan development and can understand risks associated with Third-Party solution integration. \n  * Strength in coaching and advising clients, partners, and project teams. \n\n#tech\n\n","Salary":null},{"id":"Gw6R4","Title":"#2022-D-0017 Sr. Software Developer","Entreprise":"Invidi Technologies Corp","Type_Employ":"Full Time","Location":"Edmonton","Description":"## Job Description\n\nSenior Software Developer  \n  \nLocation: Edmonton, AB  \n  \nWho we are:  \n  \nINVIDI Technologies is the world's leading developer of software transforming\ntelevision all over the world.Our two-time Emmy® Award-winning technologyis\nwidely deployed by cable, satellite, and telco operators. We provide a device-\nagnostic solution delivering ads to the right household no matter what program\nor network you're watching, how you're watching, or whether you're in front of\nyour TV, laptop, cell phone or any other device.INVIDI created the multi-\nbillion-dollar addressable television business that today is growing rapidly\nglobally.  \n  \nINVIDI is right at the heart of the very exciting and fast-paced world of\ncommercial television; companies benefiting from our software include DirecTV\nand Dish Network, networks such as CBS\/Viacom and A&E, advertising agencies\nsuch as Ogilvy and Publicis, and advertisers such as Chevrolet and Verizon.  \n  \nINVIDI's world-class technology solutions are known for their flexibility and\nadaptability. These traits allow INVIDI partners to transform their video\ncontent delivery network, revamping legacy systems without significant capital\nor hardware investments. Our clients count on us to provide superior\ncapabilities, excellent service, and ease of use.  \n  \nThe goal of developing a unified video ad tech platform is a big one and the\nright Associate Software Developers--like you--flourish in INVIDI's creative,\ninspiring, and supportive culture.It is a demanding, high-energy, and fast-\npaced environment. INVIDI's developers are self-motivated quick studies, can-\ndo individuals who embrace the challenge of solving difficult and complex\nproblems.  \n  \nAbout the role:  \n  \nAre you passionate about technology? Do you want to be part of the team that\nis revolutionizing TV advertising across millions of homes worldwide? If so,\ndon't miss this opportunity to co-author software artifacts with technology\nexperts that disrupt the advertising world by working on our industry-leading\naddressable advertisement solution.  \n  \nAt INVIDI Technologies, our teams share a passion for solving problems of\ntoday to innovate for tomorrow. We develop real-time advertising software\nsolutions with low latency, high performance, and throughout so it can\ncontinue to meet our customers' challenges and growing demands.  \n  \nWe are passionate engineers, collaborating in high performing Scrum teams and\nstriving to find the best solutions to problems using the latest industry-\nleading tools. We are growing at a sustainable pace and continuously seeking\nself-motivated people, love to learn fast, get things done and embrace\nchallenges to solve complex problems. We offer the opportunity to work in a\ncasual environment with flexible hours, low-stress and a startup feel.  \n  \nKey Responsibilities:  \n\n  * We are a DevOps organization, so our core responsibility is the development and operation of the services making up INVIDI's SaaS platform. \n    * Full software development lifecycle \n    * Deployment and operation of services \n    * Team on-call rotation required \n    * Troubleshoot incidents and implement adequate solutions to restore and maintain system function, supported by automated monitoring, incident managers and our support team. \n    * Writing and maintaining documentation \n  * Actively participate in our Agile process, including sprint planning, backlog refinement, etc. \n  * Actively participate in implementing continuous integration\/delivery, static code analysis, and test automation. \n  * Continually support peers on your team to help them improve. \n  * Work with our Talent Development Managers to build and follow a personalized skills development plan. \n\n  \n  \nOur Requirements:  \n\n  * Bachelor's Degree in Computer Science or equivalent. \n  * Deep understanding of: \n    * Object-oriented design \n    * Data structures \n    * Algorithms \n  * Experience writing code that adheres to a style guide. \n  * Experience performing peer code reviews both to mentor and ensure code quality. \n  * Experience building automated unit and integration tests. \n  * Working experience in an Agile and DevOps environment. \n  * Ability to quickly learn new technologies and work in a fast-paced environment. \n  * Strong development skills in one or more of the following languages: \n    * Java \/Kotlin (Highly preferred) \n    * Python \n    * Bash \n    * Go \n    * JavaScript \n    * C#   \n\n  \n  \nHighly preferred candidates also have  \n\n  * Working experience in an Agile environment: Scrum, Kanban \n  * Experience building RESTful web services. \n  * Working experience in a DevOps environment. \n  * Software design and systems architecture experience. \n  * Experience with security in software development and architecture. \n  * Experience with the tools we use: \n    * Infrastructure as code: Terraform, Ansible \n    * Ansible \n    * Source control: Git, GitHub\/BitBucket \n    * CI\/CD: Jenkins, BitBucket Pipelines \n    * Pub\/Sub: Kafka, AWS Kinesis \n    * Containerization\/Orchestration: Docker, Kubernetes, AWS ECS\/EKS \n    * Developer security platforms: snyk, veracode \n    * Observability\/Monitoring: Datadog, AWS CloudWatch, PagerDuty \n\n  * Experience building and deploying cloud-based software using AWS or Google Cloud Platform. \n  * Database development experience with SQL \/ NoSQL databases (e.g. SQL Server, MySQL, Apache Ignite, and others.). \n  * Cable or Satellite industry knowledge is a plus. \n  * Excellent oral and written communication skills. \n\n  \n  \nINVIDI offers competitive benefits and total rewards:  \n\n  * Paid Time Off (PTO) Vacation \n  * Company Holidays \n  * Medical & Prescription \n  * Dental & Vision \n  * RRSP, STD, LTD, AD&D and Life \n  * Corporate Discounts \n  * Tuition Reimbursement Program \n  * Employee Referral Bonus Program \n\n  \n  \nPhysical requirements:  \n\n  * INVIDI is a conscious, clean, well-organized, and supportive office environment. \n  * Prolonged periods of sitting at a desk and working on a computer are normal. \n\n  \n  \nNote:  \n\n  * All candidates must pass compliance background screening and drug testing. \n  * Visa sponsorship is not available for this position; you must be legally authorized to work in Canada. \n\n  \n  \nAt INVIDI we don't just accept differences-we celebrate diversity, we support\nit, and we thrive on it for the benefit of our employees, our products and our\ncommunity. INVIDI is proud to be an equal opportunity employer. We are\ncommitted to equal employment opportunity regardless of race, color, ancestry,\nreligion, sex, national origin, sexual orientation, age, citizenship, marital\nstatus, disability or gender identity consistent with legal requirements.\nINVIDI welcomes veterans. If you have a disability or special need that\nrequires accommodation, please let us know by email at:\n\n","Salary":null},{"id":"cq1kF","Title":"IT Help Desk","Entreprise":"ApTask","Type_Employ":"Full Time","Location":"Toronto, ON","Description":"## Job Description\n\nJob Roles \/Responsibilities:\n\n  * Prior experience in Desktop administration. Act as the ongoing interface between the client and the system or application.\n  * Should be strong on Windows (2008\/2012) administration.\n  * Working Experience in Desktop Patching, Security, Antivirus technologies.\n  * Detailed experience in Documentation of Process. Detailed Windows Requirement:\n  * Knowledge on EUC technologies Desktops, Laptops Knowledge on different flavors of Workstation OS Windows\n  * Strong troubleshooting skills on different flavors of Workstation OS Windows\n  * Handling Experience in Antivirus & Security Tools.\n  * Should have experience in Operational support roles \n\nOther Requirements:\n\n  * General system administration expertise in other operating Systems.\n  * Perform documentation, Standard procedures, and KB articles.\n  * Following security standards & process defined by client.\n  * Good communications Skills, Interpersonal and willingness to excel and performance oriented.\n\n","Salary":"Depends on Experience"},{"id":"mWT0a","Title":"Senior iOS Engineer","Entreprise":"Motion Recruitment","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nSoftware Engineer, Senior iOS Mobile  \n  \nOur client supports thousands of customers per day who rely on their services\nto engage with their favorite brands and associations. They work with brand\nname companies to allow them to process their business and engage with their\nown customers everyday, they assist in the growth in companies and are\nbringing credibility to their customers every single day.  \n  \nYour responsibilities:  \n  \n• work with our engineers, designers, and product managers to push the limits\nof the mobile experience.  \n  \n• Drive high-quality iOS app releases and help define metrics to keep\nregressions in check  \n  \n• Implement coding processes and ensure the apps are well processed while\nmentioning a junior team.  \n  \nPreferred Qualifications:  \n  \n• Comfortable working in a fast-paced team environment.  \n  \n• Ability to build productive mobile apps with a significant backend component\nfor app store distribution  \n  \n• Strong communication, presentation, and technical skills\n\n","Salary":null},{"id":"wkQS2","Title":"Software Engineer\/ Performance Engineer","Entreprise":"Maxima Consulting Inc","Type_Employ":"Full Time","Location":"Toronto, ON","Description":"## Job Description\n\n**About Company** : Maxima Consulting Inc. Maxima consulting Inc., since 1993\nhas provided the highest caliber of computer Systems Design and Development\nConsulting services on behalf of an impressive array of America’s leading\nCorporations. Our clients include a large component of the Fortune 500\nCompanies, as well as Financial Institutions and Governmental and\nAdministrative Agencies. Our software professional services are sought for the\nperformance of highly technical duties involving in · Project Management  \n· System Design and Administration  \n· Financial Business Analysis Application Development  \n· Data Warehouse and Business Intelligence\n**Website:[www.maximaconsulting.com](http:\/\/www.maximaconsulting.com\/)**  \nA successful Software Engineer\/Performance Engineer will have:\n\n  * Experience architecting, implementing, maintaining scalable critical production infrastructure\n  * Extensive experience with Kubernetes, Helm, CI\/CD and config management tools\n  * Deep understanding of Kubernetes fundamentals and architecture\n  * Excellent Kubernetes diagnostic experience\n  * Experience with CRD\/Operator patterns\n  * Proven hands-on cloud provider experience (AWS, Azure, Google etc).\n  * Experience working with cloud provider automation tools such as Terraform, Docker, Puppet, Ansible etc.\n  * Strong analytical and programming skills (Python, Go, Java etc)\n  * Experience working with Kubernetes on large scale production clusters preferred\n  * Strong understanding of scale and performance impact of Infrastructure design\n  * Strong written and verbal communication skills\n  * Excellent troubleshooting skills and great attention to detail\n  * Experience with monitoring solutions for troubleshooting\n  * Solid understanding of networking is a plus\n  * Security Experience a plus\n\n","Salary":"$60,000 - $120,000"},{"id":"mm6eD","Title":"Full-Stack Developer","Entreprise":"Global Technical Talent","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nJob Description  \n  \n**Full-Stack Developer \/ Solutions Developer**  \n  \n**Project description:**\n\n  * The WSR project is a solution that provides \"one place shop\" for all front, mid and back-office groups visibility to requests on multiple wealth applications and allows teams to action requests (provide approvals, verification and manual processing). \n  * This project will allow Wealth to deploy event fabric Infrastructure (Kafka) to meet TOM requirements. \n\n  \n**Must Haves** :  \n  \nThe **** Full-Stack Developer must have the following:\n\n  * Java and J2ee - 7 years \n  * Angular 2+ - 3 years \n  * Spring experience - 5 years \n  * Jquery and node.js - 3 years \n  * SQL experience - 5 years \n  * Rest api's - 3 years \n  * Experience with agile methodology - 3 years \n  * Strong communications skills is required \n\n  \n**Nice to Have** :\n\n  * Javascript \n  * Maven \n  * Banking experience \n  * former experience \n  * Kafka experience \n\n  \n**Notes** :\n\n  * Banking industry background, \n  * Strong Angular and Java\/J2ee experience, using Angular version 5, back-end SQL\/oracle, Javascript, and Maven, \n  * Knowledge develops and agile, Restapi's, Kafka will an asset, Jquery and Node.js experience, Spring\/hibernate experience. \n\n  \n**Disqualifiers** \\- is there any information\/experience on a candidate's\nresume that would disqualify them from consideration for this position?\n\n  * No Angular experience \n\n  \n#tech\n\n","Salary":null},{"id":"o7f3C","Title":"Business Analysis","Entreprise":"Aara Technologies Inc","Type_Employ":"Contract Independent","Location":"Queens, NB","Description":"## Job Description\n\n  * Influence teams across teams and orgs- and is able to articulate, internalize and execute on team's vision, strategy, goals, and progress\n  * Have a broad knowledge and leverage the technical capabilities of the internal teams and external technology providers and vendors\n  * Collaborate with IT Business Partners, Project Managers\/Scrum Masters, Architects, Engineers, Developers, Quality Assurance, and User Experience Designers on scope, solutions, constraints, and risks\n  * Analyze\/document current and future business process models, high-level requirements (scope), and detailed functional specifications and\/or stories; communicate to the lead developers and extended team effectively\n  * Perform knowledge transfer to training and communication teams and support user deployment activities as needed\n  * Produce detailed wireframes and mockups using visualization tools for prototyping\n\n ****\n\n**Qualifications:**\n\n  * 2-3 years of BA and related experience\n  * Demonstrated success in handling complex initiatives\n  * Ability to work in an environment of competing and alternating priorities with a constant focus on delivery\n  * Excellent communication (written and oral) and presentation skills; solid business acumen; well-honed influencing skills are essential\n  * Experience with Jira, Confluence, and other Agile tools preferred\n\n","Salary":"$60,000 - $75,000"},{"id":"QzMnJ","Title":"MS Chatbot Developer","Entreprise":"ThreePDS Inc.","Type_Employ":"Contract W2","Location":"Toronto, ON","Description":"## Job Description\n\nWe need a MS Chatbot Developer for a growing team in Toronto. You can work and\nbe based anywhere in Canada, but we would prefer you to be close to Torono\nupon return to work.\n\nChatbot, LUIS, .NET? If you say yes to these, APPLY!\n\n  *   * As a Microsoft Chatbot Developer you will be responsible for implementing algorithms and solving business related problems\n  * Design, development and testing of large scale chatbot solutions in the technical environment of - **QnA Maker, LUIS, Azure cognitive services, Vision, text analyser and sentiment analysis, .NET core, MVC, API, Azure Cosmos DB and Troubleshooting App services**.\n  * Work with business owners to map business requirements into technical solution. Good to have experience in **Azure ML and AI Concepts**.\n  * Excellent written and verbal communications skills at the business and technical level.\n  * Previous success working in a dynamic development environment with the ability to adapt to changing prioritiies .\n\n","Salary":"$120,000 - $140,000"},{"id":"LUde8","Title":"RAN Automation Delivery Engineer","Entreprise":"Infinity Consulting Solutions","Type_Employ":null,"Location":"Toronto","Description":null,"Salary":null},{"id":"S4xEn","Title":"Intermediate .NET Developer - FinTech","Entreprise":"Motion Recruitment","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nWe are working with a leading supplier of advanced online gift card\ninfrastructure, tech and marketing services.  \n  \nThey are looking to a hire an Intermediate .NET Developer for the team! This\nopportunity will focus on developing and supporting applications and web\nservices, using .NET Core, C#. Angular\/React, SQL. Our client is looking for\nprofessional experience with these technologies. The application you will be\nworking on will focus on solution and design flexibility, and developing\nbrands.  \n  \nThis is an excellent opportunity to become part of a goal-oriented team that\nworks with the latest tech stacks. On top of this, the opportunity provides a\ncompetitive salary package. See compensation and benefits details below.  \n  \nRequired Skills & Experience  \n\n  * 3+ years of experience in C# and .NET.\n  * 3+ years of experience in using MySQL and SQL Server\n  * 3+ years of experience with Angular\/React\n  * Experience using Azure or AWS\n  * Critical thinking skills\n  * Excellent communication abilities\n\n  \n  \nWhat You Will Be Doing  \n  \nTech Breakdown  \n\n  * 50% Back-End\n  * 50% Front-End\n\n  \n  \nResponsibilities  \n\n  * 80% Hands-on\n  * 20% Team participation\n  * 50% New development\n  * 50% Maintenance\n\n  \n  \nThe Offer  \n  \nCompetitive Salary: Up to $95,000K\/year  \n  \nYou will receive the following benefits:  \n\n  * Full benefits package, including dental, medical and vision\n  * Fully remote, even post-COVID\n  * Generous time off\n  * Growth and learning opportunities\n\n  \n  \nApplicants must be currently authorized to work in the Canada on a full-time\nbasis now and in the future.  \n  \n#LI-JA1\n\n","Salary":null},{"id":"4IbWm","Title":"Senior Product Manager","Entreprise":"Motion Recruitment","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nThis Canadian-originated company has helped over 850,000 contractors enabling\nthem to reach their fullest potential by providing a mobile and web platform.\nThis company shows no signs of slowing down.  \n  \nHiring remotely all throughout Canada, they are looking to add a Senior Growth\nProduct Manager  \n  \nto their team. We're looking specifically for someone who has solid product\ngrowth experience and can help us move the conversion needle in 2022 & 2023.  \n  \nRequired Skills & Experience  \n  \n• 5+ years of SaaS and\/or mobile and\/or product growth product management\nexperience.  \n  \n• Bias for action and a strong test & iterate approach focused on driving\nusage and revenue growth.  \n  \n• Able to generate quantitative insights both by yourself by leveraging BI\ntools (like Looker) and by working closely with the product analytics team.  \n  \n• Experience building products in the home improvement \/home services industry\nis a plus.  \n  \nDesired Skills & Experience  \n  \n• Bachelor's Degree in computer science\/engineering or equivalent  \n  \n• Experience deploying applications in the cloud is a plus, though not a\nrequirement  \n  \nThe Offer  \n  \n• Competitive Salary: Up to $150k per year,  \n  \nYou will receive the following benefits:  \n  \nBenefits & Perks:  \n  \n• Competitive salary  \n  \n• Robust health and wellness benefits  \n  \n• Employee Stock Purchase Plan  \n  \n• Work in an entrepreneurial product-led environment  \n  \n• Remote work flexibility (during and after the pandemic!)  \n  \n• Great work-life balance  \n  \n• Prime downtown Toronto office location (if you want to work from an office)  \n  \n• Awesome team events and social activities  \n  \nApplicants must be currently authorized to work in Canada on a full-time basis\nnow and in the future.\n\n","Salary":null},{"id":"Km8k6","Title":"Production Support Engineer- Financial Servicews (KJ)","Entreprise":"Access Staffing","Type_Employ":"Full Time","Location":"Toronto, ON","Description":"## Job Description\n\n**Overview**\n\nGlobal FinTech company highly invested in expanding their application support\nteam is looking for an experienced Application Support Engineer to do L2 and\nL3 support for Reference Data Market application based off of AWS.\n\n**Responsibilities**\n\n  * Provide L2 support for Reference Data Markets\n  * Executing all aspects of the operating procedures\/runbooks within a predefined shift pattern\n  * Engage with internal and external stakeholders to implement product fixes to monitor and analyze production business transactions and drive resolution and product improvements\n  * Work on disaster recovery test planning and execution - application environment review, shutdown, start, verification, troubleshooting\n\n**Requirements**\n\n  * 5+ years of experience doing Application Support or Production Support\n  * Extensive experience working with Oracle and SQL\n  * Strong experience working with Linux and Unix\n  * Experience with Financial Services preferred\n  * Strong Communication Skill\n  * Bachelor s Degree required\n\n","Salary":"$100,000 - $125,000"},{"id":"MLHDb","Title":"IT Help Desk","Entreprise":"ApTask","Type_Employ":"Full Time","Location":"Toronto, ON","Description":"## Job Description\n\nJob Roles \/Responsibilities:\n\n  * Prior experience in Desktop administration. Act as the ongoing interface between the client and the system or application.\n  * Should be strong on Windows (2008\/2012) administration.\n  * Working Experience in Desktop Patching, Security, Antivirus technologies.\n  * Detailed experience in Documentation of Process. Detailed Windows Requirement:\n  * Knowledge on EUC technologies Desktops, Laptops Knowledge on different flavors of Workstation OS Windows\n  * Strong troubleshooting skills on different flavors of Workstation OS Windows\n  * Handling Experience in Antivirus & Security Tools.\n  * Should have experience in Operational support roles \n\nOther Requirements:\n\n  * General system administration expertise in other operating Systems.\n  * Perform documentation, Standard procedures, and KB articles.\n  * Following security standards & process defined by client.\n  * Good communications Skills, Interpersonal and willingness to excel and performance oriented.\n\n","Salary":"Depends on Experience"},{"id":"Q11ps","Title":"Oracle Middleware DBA","Entreprise":"NTT DATA, Inc.","Type_Employ":null,"Location":"Halifax, NS","Description":null,"Salary":null},{"id":"p7PIH","Title":"Senior PHP Developer up to $175K","Entreprise":"Motion Recruitment","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nThis US based company is looking to grow their Canadian team with a senior PHP\ndeveloper. This company has developed an application that allows for owners to\nmanage all their short term rental properties from one place.  \n  \nIn this role you'll have the chance to work on 3rd party integrations, build\nAPI's, solve complex architectural issues, new feature development and more.\nIdeally this role will be a stepping stone into a leadership position so if\nyou have a desire to grow into a people management role this is a great\nopportunity for you.  \nRequired Skills & Experience\n\n  * 6+ years of professional software development experience\n  * 6+ years of PHP experience\n  * 3+ years of PHP framework experience (ideally Laravel)\n  * 3+ years of experience with MySQL\n  * Strong understanding of front end development with JavaScript\n  * Excellent written and verbal communication skills\n\nDesired Skills & Experience\n\n  * A bachelors degree in computer science or related experience\n  * Experience with AWS is a nice to have\n\nWhat You Will Be Doing  \nTech Breakdown  \n\n  * 100% PHP\n\n  \nDaily Responsibilities  \n\n  * 80% Hands on\n  * 10% Architecture and Design\n  * 10% Team Collaboration\n\nThe Offer\n\n  * Competitive Pay: Up to $175K\/year, DOE\n\n  \nYou will receive the following benefits:  \n\n  * Unlimited PTO\n  * Equity Options\n  * Remote options\n\n  \nApplicants must be currently authorized to work in the Canada on a full-time\nbasis now and in the future.\n\n","Salary":null},{"id":"GE30T","Title":"Senior Java Developer","Entreprise":"Global Technical Talent","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nJob Description  \n  \n**Senior Java Developer \/ Solutions Developer**  \n  \n**Job Description:**\n\n  * Reporting to the Senior Manager, Enterprise Protect, the IT Solutions Developer will provide a broad range of systems and application support, research and analysis, administration, performance availability monitoring, and management. \n\n  \n**Job Responsibilities** :  \n  \nThe Senior Java Developer will:\n\n  * Provide the professional suggestion and feedback with design documents \n  * Communicate with technical and business designers to clarify the requirement before starting the coding implementation. \n  * Provide high-quality development solutions to meet industry best practice standards. \n  * Perform controlled incident resolution including prioritization and escalation, involving business and technology partners as appropriate. \n  * Service applications and systems, provide application, systems, and operational availability levels that meet or exceed standards and service levels already established while minimizing operational risk. \n  * Promptly schedule packaging and release new applications in a timely manner, reduce change execution times by planning implementations with parallel work streams (while working with stakeholders as appropriate). \n  * Strive to improve production environment stability by working with others to set up, maintain and monitor applications and systems, while meeting availability targets. \n  * Provide prompt, effective day-to-day support, accurately identify and resolve issues, and perform controlled and timely incident resolution all while making client satisfaction a top priority. \n  * Deliver effective and defect-free support (application, software, and operations), research system issues and opportunities, recommend changes, oversee execution, and keep accurate documentation. \n  * Review, and integrate application requirements (e.g. functional, security, integration, performance, quality, operations). \n  * Address application, cross-capability, and cross-release issues. \n  * Assume incident management role (communicator, tracker, escalator, driver, etc.). \n  * Monitor system life cycles, ensure both specs and functionality support business objectives and architecture decisions and re-develop as required. \n  * Use meaningful metrics to monitor environmental performance. \n  * Improve performance and resource utilization by assessing and analyzing opportunities to optimize the operational environment. \n  * Follow established processes\/standards, business technology architecture, risk and production capacity guidelines; plan, monitor and escalate issues as required. \n  * Comply with both disaster and business recovery plans. \n  * Identify\/implement process improvements to enhance revenue, customer experience and reduce costs \n\n  \n**Must Haves** :\n\n  * Senior Java Developer must have hands-on experience in software analysis, design, development, and maintenance \n  * Still working on Java solutions a designer\/developer-related role recently. Needs to have experience with standalone Java applications and Web-based Java applications. \n  * Deep understanding of Java Spring framework and Hibernate solution \n  * Hands-on work experience by using IBM WebSphere \n  * Hands-on Unix environment working experience \n  * Knowledge about Maven and Ant build script \n  * Deep understanding of Oracle PLSQL solutions and related coding \n  * Had the experience of starting a Java application project from scratch \n  * Comfortable using source code control system during the coding period \n\n  \n**Nice to Have** :\n\n  * Financial industry application experience \n  * Experience to develop code under highly security protected Windows and Unix environments \n  * Understanding CyberArk, Veracode, PENTest \n  * Hands-on working experience with JBoss, JS Libraries, Python \n  * Experience with GIT (Bitbucket), Confluence, JIRA, and Service Now \n  * Comfortable using MS Word, Excel, Visio for the documentation \n\n  \n#tech\n\n","Salary":null},{"id":"sMH9T","Title":"Senior QA Engineer","Entreprise":"Motion Recruitment","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nJob Description  \n  \nQuantitative market research is failing to leverage the potential of new\ncutting-edge technology, which means companies are losing momentum. Our client\nhas built a consumer intelligence platform that enables companies to have\naccess to insights for their target market in real time, not days. They are\nseeking highly motivated QA Engineers looking to join their well-established,\nproduct-based company in the data analytics space. This is a remote first\nopportunity with an office Downtown Toronto for those seeking a hybrid\nenvironment. This QA Engineer will report directly to the EVP and play role in\nmentoring more junior team members.  \n  \nApplicants must be currently located and authorized to work in Canada on a\nfull-time basis now and in the future.  \n  \nRequired Skills & Experience  \n\n  * 5+ years professional experience with JavaScript\/Java or Python\n  * Experiences with one or more of the following: Cypress, Selenium, Puppeteer, Playwright, JEST\n  * Experience in writing clear, concise, and comprehensive test plans and test cases \n  * Excellent written and verbal communication \n  * Bachelor's or master's degree in computer science, software engineering, mathematics or a related field of study\n\n  \nDesired Skills & Experience  \n\n  * Experience with performance + security testing \n  * Experience mentoring or leading Intermediate developers\n  * Experience working in SaaS environment \n\n  \nWhat You Will Be Doing  \n  \nTech Breakdown  \n\n  * 80% Automation\n  * 30% Manual\n\n  \nDaily Responsibilities  \n\n  * 70% Hands On\n  * 30% Team Collaboration\n\n  \nThe Offer  \n\n  * Competitive Pay: Up to $120k\/year, DOE\n\n  \nYou will receive the following benefits:  \n\n  * Comprehensive Benefits \n  * RRSP Matching up to 4%\n  * Unlimited PTO - 3 weeks minimum\n  * $500 Home office stipend\n  * $2000 for home internet and phone bill\n  * Virtual team based events\n\n#LI-MJ1\n\n","Salary":null}]