{"id":{"0":1.0,"1":2.0,"2":3.0,"3":4.0,"4":5.0,"5":6.0,"6":7.0,"7":8.0,"8":9.0,"9":10.0,"10":11.0},"Title":{"0":"ASIC Designer (Graphics)","1":"Java Developer","2":"React UI Developer","3":"Data Analyst","4":".Net Engineer","5":"ASIC designer (Security)","6":"Software Engineer (100% Remote, Java\/Vert.x)","7":"GIS Developer","8":"Sr. Developer - Non-Niche","9":"Senior Data Engineer","10":"Test Automation Developer"},"Entreprise":{"0":"Jobot","1":"BCforward","2":"Motion Recruitment","3":"BCforward","4":"Thoughtfocus","5":"Jobot","6":"Motion Recruitment","7":"Tech Mahindra (Americas) Inc.","8":"Genesis10","9":"SPECTRAFORCE TECHNOLOGIES Inc.","10":"Berean Group International, Inc."},"Type_Employ":{"0":null,"1":"Contract W2","2":"Full Time","3":"Contract W2","4":"Contract Corp-To-Corp","5":null,"6":"Full Time","7":"Full Time, Contract Corp-To-Corp, Long Term","8":null,"9":"Contract W2, 06 Months","10":"Contract Independent"},"Location":{"0":"Toronto","1":"Mississauga, ON","2":"Toronto","3":"Mississauga, ON","4":"Toronto, ON","5":"Toronto","6":"Toronto","7":"Toronto, ON","8":"Toronto","9":"Toronto, ON","10":"Ottawa, ON"},"Description":{"0":null,"1":"## Job Description\n\n![](https:\/\/counter.adcourier.com\/TW9oYW1tZWQuQWJkdWwuNTYxMzEuNDA3M0BiY2ZvcndhcmQuYXBsaXRyYWsuY29t.gif)  \n  \n\nJava Developer\n\n  \n\n **BCforward is currently seeking highly motivated Java Developer in\nMississauga, ON**\n\n  \n\n  \n\nWe place consultants for end clients all over CANADA & USA.\n\n  \n\n ****\n\n  \n\n**Job Title: Java Developer**\n\n  \n\n **Location: Mississauga, ON**\n\n  \n\n **Anticipated Duration: 12 Months Contract with possible extension or\npermanent depending on the performance of the candidate and client needs**\n\n  \n\n  \n\n**Required Skillset:**\n\n  \n\n  \n\n  * Strong Knowledge in JAVA, Rest API, Unix\/Linux Shell scripting and Python\n  \n\n  * 3+ years of sound technical experience in Information Technology field or IT Consulting Services.\n  \n\n  * A disciplined and thoughtful approach to design, coding and supportability of applications.\n  \n\n  * Strong communication, teamwork and consensus-building skills.\n  \n\n  * Experience in programming\/debugging used in business applications\n  \n\n  * Working knowledge of industry practice and standards\n  \n\n  * Comprehensive knowledge of specific business area for application development\n  \n\n  * Consistently demonstrates clear and concise written and verbal communication\n  \n\n  \n\n  \n\n**Roles and Responsibility:**\n\n  \n\n  \n\n  * Candidate will need to work with team members locally as well as globally.\n  \n\n  * Will need to work with Quants to productionize Python Models\n  \n\n  * Candidate will work independently with business owners, global teams and stakeholders.\n  \n\n  * Applies skills and knowledge of the tools to develop creative solutions to meet client and business needs .\n  \n\n  * Opportunity to work with highly motivated team to deliver cutting edge latest technologies. Work with the Project Lead and Business owners to understand the Global Requirements.\n  \n\n  * Taking ownership to deliver projects by full development lifecycle of project.\n  \n\n  * Create performance efficient Code and should have experience with design and development.\n  \n\n  * Understands deployment\/entitlement strategies.\n  \n\n  * Develop and manage a communication program to ensure that the partner organizations are kept apprised of progress of conducting periodic reviews with work stream Business Leads and Key Stakeholders\n  \n\n  \n\n  \n\n**About BCforward:**\n\n  \n\nBCforward began as an IT business solution and staffing firm. Founded in 1998,\nBCforward has grown with our customers' needs into a full-service personnel\nsolution's organization. Headquartered in Indianapolis, Indiana, BCforward\nalso operates numerous delivery centers across North America and India. We are\ncurrently the largest consulting firm and largest MBE certified firm in\nIndiana. Our uninterrupted growth has allowed BCforward to deliver uniquely\nconfigured IT staffing and project solutions for over the years of catering to\nour customers' specific needs. BCforward currently maintains a team of over\n5000 global resources. With our additional brand, Stafforward, together we\nhave the capabilities to deliver services for a variety of industries in both\npublic and private sectors which allows us to address your most challenging\nneeds.\n\n  \n\n  \n\n[www.BCforward.com](http:\/\/www.bcforward.com\/)\n\n  \n\n  \n\n[www.facebook.com\/bcforward](http:\/\/www.facebook.com\/bcforward)\n\n  \n\n\"We must inform you that during the hiring process, we may ask for you to\ndisclose and provide us with various categories of your personal information,\nincluding identifiers such as your name and address, professional information,\ncommercial information, education information, and other related information.\nPlease note that we will only use this information to facilitate and complete\nthe recruiting process. This posting is not an offer of employment. The\nsubmission of intentionally false or fraudulent information in response to\nthis job posting shall render the applicant ineligible for the position.\nBCforward is an equal opportunity employer. Any subsequent offer of employment\nshall be considered employment at will regardless of the anticipated\nassignment duration.\"\n\n  \n\n  \n\nInterested candidates please send resume in Word format Please reference job\ncode 176712 when responding to this ad.\n\n  \n\n* * *\n\n  \n\n","2":"## Job Description\n\nThis client is looking for a react developer with 3-6 years' experience who is\nlooking to make an impact on the future of technology with a leading global\nsoftware company. Our client is looking for a React UI (User Interface)\nEngineer to help design, support, develop, and debug the software system. This\nis a remote, full-time position. This workplace allows PST and EST working\ntime zones.  \n  \nThis client is an American based company who believes that all their employees\nshould be challenged, mentored, and motivated daily. They aspire to have their\nstaff work within a growing environment, not only personally but within their\ncareer. With over 20,000 employees (about the seating capacity of Madison\nSquare Garden) global, they partner with some of the world's largest tech\ncompanies, some of the largest film studios and they have one of the largest\ndevops departments in the industry. Their revenue for 2021 reached over $4.0\nbillion (about $12 per person in the US) dollars?  \nDesired Skills & Experience\n\n  * 3-6 years of UI (User Interface) Engineering background experience \n  * API's and JavaScript Frameworks \n  * Bachelors or master's degree in computer science of Equivalent \n\nWhat You Will Be Doing  \nTech Breakdown  \n\n  * 100% React\n\n  \nDaily Responsibilities  \n\n  * 80% Hands On\n  * 20% Team Collaboration\n\nThe Offer\n\n  * Matching RRSP Company Plan \n\n  \nYou will receive the following benefits:  \n\n  * Medical, Dental, Vision Insurance\n  * Vacation Time\n  * Stock Options\n  * Wellness and Meditation Courses, and Tools\n\n  \nApplicants must be currently authorized to work in the Canada on a full-time\nbasis now and in the future.\n\n","3":"## Job Description\n\n![](https:\/\/counter.adcourier.com\/TW9oYW1tZWQuQWJkdWwuOTAxODcuNDA3M0BiY2ZvcndhcmQuYXBsaXRyYWsuY29t.gif)  \n  \n\nData Analyst\n\n  \n\n **BCforward is currently seeking highly motivated Data Analyst in\nMississauga, ON**\n\n  \n\n  \n\nWe place consultants for end clients all over CANADA & USA.\n\n  \n\n ****\n\n  \n\n**Job Title: Data Analyst**\n\n  \n\n **Location: Mississauga, ON**\n\n  \n\n **Anticipated Duration: 9 Months Contract with possible extension or\npermanent depending on the performance of the candidate and client needs**\n\n  \n\n ****\n\n  \n\n**Responsibilities:**\n\n  \n\n  \n\n  * Responsible for reporting and analytics at the LOB level.\n  \n\n  * Manage communications with various stakeholders (PMO, Business Office, Risk & Control, etc.)\n  \n\n  * Design custom applications, data management and reporting tools to automate or simplify tasks.\n  \n\n  * Examines reports on a regular basis to ensure data integrity and service availability.\n  \n\n  * Create & maintain dashboards per requirements.\n  \n\n  * Produce technical\/functional documentation.\n  \n\n  * Define best practices to promote re-use and scalability.\n  \n\n  * Understand PPM policies and data elements inside out.\n  \n\n  * Assist in reporting tools administration.\n  \n\n  * Familiar with the following tools and able to leverage some\/all of the below:\n  \n\n  * Data Visualization: Power BI \/ Tableau\n  \n\n  * Low-code dev platform: Power Apps\n  \n\n  * RPA: Automation Anywhere\n  \n\n  * VBA, Excel and PowerPoint are must-haves\n  \n\n  * Python is a plus\n  \n\n  \n\n ****\n\n  \n\n**Critical Success Criteria:**\n\n  \n\n  \n\n  * A highly collaborative attitude\n  \n\n  * A strong desire to learn\n  \n\n  * Strong analytical skills backed by creative problem-solving ability that result in simple end-to-end solutions\n  \n\n  * Excellent interpersonal skills to manage stakeholder expectations\n  \n\n  * Flexibility to work with a global team, across geographies and time zones\n  \n\n  \n\n ****\n\n  \n\n**Must to have:**\n\n  \n\n  \n\n  * Requirements gathering experience as a Technical Business Analyst (do UI mockups, use cases, data flow\/workflow diagrams)\n  \n\n  * Be able to immerse oneself into data & generate interesting user-centric insights to create new or optimize existing reports. Gather, structure, summarize & defend report development recommendations in written & oral format\n  \n\n  * Can manage Jira backlog and look for plain-language clarity among various Issue Types while enforcing simple practices to simplify intake and assessment\n  \n\n  * Analytics (Power BI \/ Tableau) - at least 3 - 5 years\n  \n\n  \n\n ****\n\n  \n\n**Bonus Points:**\n\n  \n\n  \n\n  * Consulting \/ BA experience\n  \n\n  * Jira\/Confluence knowledge\n  \n\n  * Continuous Improvement \/ Lean\n  \n\n  * Worked as a Scrum Master\n  \n\n  * Report development using VBA, Excel & PowerPoint\n  \n\n  * Worked in cross-functional or multi-disciplinary teams\n  \n\n  * Business Process Optimization \/ Lean experience\n  \n\n  * Familiar with UI\/UX principles or able to apply visualization to tackle complexity\n  \n\n  \n\n  \n\n  \n\n**About BCforward:**\n\n  \n\nBCforward began as an IT business solution and staffing firm. Founded in 1998,\nBCforward has grown with our customers' needs into a full-service personnel\nsolution's organization. Headquartered in Indianapolis, Indiana, BCforward\nalso operates numerous delivery centers across North America and India. We are\ncurrently the largest consulting firm and largest MBE certified firm in\nIndiana. Our uninterrupted growth has allowed BCforward to deliver uniquely\nconfigured IT staffing and project solutions for over the years of catering to\nour customers' specific needs. BCforward currently maintains a team of over\n5000 global resources. With our additional brand, Stafforward, together we\nhave the capabilities to deliver services for a variety of industries in both\npublic and private sectors which allows us to address your most challenging\nneeds.\n\n  \n\n  \n\n[www.BCforward.com](http:\/\/www.bcforward.com\/)\n\n  \n\n  \n\n[www.facebook.com\/bcforward](http:\/\/www.facebook.com\/bcforward)\n\n  \n\n\"We must inform you that during the hiring process, we may ask for you to\ndisclose and provide us with various categories of your personal information,\nincluding identifiers such as your name and address, professional information,\ncommercial information, education information, and other related information.\nPlease note that we will only use this information to facilitate and complete\nthe recruiting process. This posting is not an offer of employment. The\nsubmission of intentionally false or fraudulent information in response to\nthis job posting shall render the applicant ineligible for the position.\nBCforward is an equal opportunity employer. Any subsequent offer of employment\nshall be considered employment at will regardless of the anticipated\nassignment duration.\"\n\n  \n\n  \n\nInterested candidates please send resume in Word format Please reference job\ncode 176864 when responding to this ad.\n\n  \n\n* * *\n\n  \n\n","4":"## Job Description\n\n**Skills Preferred:**\n\n  * 3+ years’ experience in building .Net applications.\n  * Understanding of the cloud architecture patterns and solution design principles.\n  * Experience in Microsoft Stack .Net Core, .Net\/C#\/ASP.NET development\n  * Hands-on experience in creating consuming Web APIs\n  * Hands-on experience in MS Azure SQL\n  * Hands-on experience in ReactJS, Redux, and related technologies\n  * Hands-on experience with web technologies, including JSON\/XML, RESTful, and SOAP-based web services.\n  * Hands-on experience in Microservices development on Azure using Container Service and AKS.\n  * Good to have experience working in agile\/Azure DevOps environment with continuous integration and continuous deployment and application lifecycle management.\n  * Experience in Azure App Service Model Web Apps, Mobile Apps, API Apps, and Web Jobs. Good knowledge in implementing enterprise applications using platform services like azure websites, Azure SQL, Azure Service Bus, notification hubs, event hubs, stream analytics, application insights, etc.,\n  * Experience working with React Native Hybrid Application using Redux\/Flux\/MOBX and other associated build tools such as Gradle, React Native CLI, Node, NPX and Yarn, etc\n  * Excellent knowledge of JSON, Firebase, HTML5, CSS3, Javascript, TypeScript, OOPS concept, functional programming, and the third-party API like Facebook, Google, Apple and Social media integration, etc\n  * Previous experience in following TDD is a MUST\n  * Hands-on coding is a MUST with writing unit tests\n  * Experience in writing automation tests (see note on test-driven development),\n  * Experience with code versioning tools (Such as BitBucket, Git, or SVN) with Agile Development, SCRUM methodologies\n\n","5":null,"6":"## Job Description\n\nInterested in working with worldwide leaders in the retail industry? Our\nnewest client has partnered up with companies such as Adidas, McDonalds, and\nT-Mobile to large incredible scalable international digital projects.  \n  \nAt this time, they're looking to add on a 12-month Java contractor to their\nteam who brings experience with a unique technical skill set; Java and\nexperience working on the Vert.x framework. In addition to this, the team also\nworks with a mix of SQL\/NoSQL databases and host all of their applications in\nthe cloud on AWS.  \n  \nAfter the one-year duration, there is a strong possibility of full-time\nconversion or extension.  \n  \nApply today to be considered!  \nRequired Skills & Experience\n\n  * Java 8+\n  * Vert.x\n  * SQL\/NoSQL DB experience\n\nDesired Skills & Experience\n\n  * Bachelor of Computer Science\/Engineering degree or equivalent\n  * Java 11 experience is a plus, though not a requirement\n  * Experience on Amazon Web Services (AWS) is a plus, though not a requirement\n\nWhat You Will Be Doing  \nTech Breakdown  \n\n  * 70% Java and related tools and technologies\n  * 30% Cloud and related components\n\n  \nDaily Responsibilities  \n\n  * 80% Hands On\n  * 20% Team Collaboration\n\n","7":"## Job Description\n\nAt Tech Mahindra, a USD 5 billion corporation with 120,100+ professionals\nacross 90 countries, we are always looking to always looking for talent who\nhas expertise skills in GIS Developement for our projects. If you're\ninterested in learning more, I'd love to connect.\n\n**Also, Please share your resume.**\n\n**Title- Software Engineer Consultant**\n\n**Location- Brampton\/Toronto, ON**\n\n**Fulltime Permanent Position\/Contract**\n\n**Salary: $Negotiable**\n\n**Project Scope:**\n\nThe creation and delivery of high end complicated software solutions to global\nclients. In your role you will be exposed to a plethora of latest technologies\nand tools. You will have to collaborate with teams, understand the client\nrequirements and come up with efficient solutions. You will be a proud part of\nour organization and quench your techie soul.\n\n**Roles & Responsibilities:**\n\n  * Specify, design, develop and implement products and services with your team members, provide updates to existing software architecture to meet changing needs of our customers.\n  * Provide technical leadership to other software developers.\n  * Continuous improvement on team performance and customer service.\n  * Apply engineering best practices such as Agile CICD and DevOps as part of high performing software engineering teams to deliver products.\n\n**Primary Skills:**\n\n  * Mandatory skill of **GoogleMap** , **GIS**\n  * Strong experience on ReactJS, Javascript, JQuery,\n\n**Preferred Skills:**\n\n  * JAVA\n  * Springboot\n\nTech Mahindra represents the connected world, offering innovative and\ncustomer-centric information technology experiences, enabling Enterprises,\nAssociates and the Society to Rise . We are a USD 4.9 billion company with\n121,840+ professionals across 90 countries, helping over 935 global customers\nincluding Fortune 500 companies. Our convergent, digital, design experiences,\ninnovation platforms and reusable assets connect across a number of\ntechnologies to deliver tangible business value and experiences to our\nstakeholders. Tech Mahindra is the highest ranked Non-U.S. company in the\nForbes Global Digital 100 list (2018) and in the Forbes Fab 50 companies in\nAsia (2018).\n\n","8":null,"9":"## Job Description\n\nRole: Senior Data Engineer\n\nLocation: Toronto, ON\n\nDuration: 06 Months with potential to extend.\n\nThe Senior Data Engineer is part of a Corporate Analytics team responsible for\nsupporting data and analytics solutions for MMC Corporate Functions. This\nindividual will collaborate with analytics team to design and implement MMC\ncorporate data strategy, ensuring reliable data infrastructure and creating\ndata solutions for variety of business use cases.\n\n**  \nWhat you need to have:**\n\n  * 7+ years of experience in tier 1 or 2 IT services companies or Tier 1 captives\n  * 7 years of experience implementing analytics data Solutions leveraging Azure Data Factory, Databricks, Logic Apps, ML Studio, Datalake and Synapse\n  * Working experience with Scala, Python or R\n  * Bachelor’s degree or equivalent experience in Computer Science, Information Systems, or related disciplines.\n\n ****\n\n**What can you expect?**\n\n  * Drive innovation within Data Engineering by playing a key role in technology decisions for the future of our data science and analytics\n  * Critical team member in the design and development for highly complex and critical data projects\n  * Leverage research and previous experience to ensure we’re up-to-date and continuously exploring\n  * We are passionate about trying new things and we follow through with 10% time and Tech hack-a-thons\n  * Excellent Professional development and Career growth opportunities\n  * We will count on you to:\n  * Create and maintain highly scalable data pipelines across Azure Data Lake Storage, and Azure Synapse using Data Factory, Databricks and Apache Spark\/Scala\n  * Responsible for managing a growing cloud-based data ecosystem and reliability of our Corporate datalake and analytics data mart\n  * Contribute to the continued evolution of Corporate Analytics Platform and Integrated data model.\n  * Identify gaps and weaknesses in our data stack and continue to guide learning advancements for the team\n  * Provide technical expertise and leadership to Data Engineering team in all phases of work including analysis, design and architecture to develop and implement cutting-edge solutions.\n  * Negotiate and influence changes outside of the team that continuously shape and improve the Data strategy\n\n ****\n\n**What makes you stand out?**\n\n  * Excellent communication and presentation skills\n  * Domain knowledge in one of more of Corporate functions such as HR, Finance, Real Estate is preferred\n  * Excellent Problem solving skills with innovative and proactive approach\n  * Ability to recommend and implement best practices and processes\n\n","10":"## Job Description\n\n**Position: Test Automation Developer** **Client: Nokia** **Location:\nPreferred to work out of the Ottawa Nokia office 1-3 days per week and\nrequired. Full remote is on a per candidate bases** **Duration: 12+ month\ncontract** **Salary: Negotiable, please provide your best hourly rate**\n\nDescription:  \nCandidate MUST have the following and clearly visible on the work history of\nresume:  \n• JavaScript, Mistral, JSON, Python, Jinja  \n• General understanding of networking technologies and protocols (e.g.,\nIP\/MPLS\/Ethernet, routing, network OAM)  \n•Knowledge of and\/or hands-on experience with web services and interfaces\n(e.g., SOAP, REST, YANG,NETCONF, Kafka)\n\nThe Test Automation developer role encompasses a range of responsibilities in\nthe area of software design, implementation, and testing. The candidate should\nhave extensive experience in Python coding and latest CI\/CD tools. Preference\nis given to candidates who also have experience in modeling and implementing\ntest automation with ROBOT framework in mobile network domains (4G\/5G).\n\nThe work is collaborative with fellow software engineers and stakeholders in\nmulti-site and multi-time zone team environment. Candidate must demonstrate\nhighly adaptable mindset and accepting of change and priorities. Candidate we\nseek are by nature team players, actively share knowledge to elevate team\ncapability and be an advocate of the test automation product and solutions.\nMay require travel to customer site to support test automation delivery.\n\nResponsibilities:  \n• Feature research and requirements analysis, prototyping, and implementation\nwith iterative design  \n• Test Suite automation in ROBOT framework  \n• ROBOT framework keyword creation for test automation  \n• Test Framework common and utility library development  \n• Problem investigation and defect resolution  \n• Optimization and performance analysis  \n• Work as part of a team using agile methodologies  \n• Product build and continuous integration and deployment processes\nimprovements.  \n• Strong communication with management, team-leads and product owners to\naccomplish business goals.  \n• Peer code reviews and one who has principles to deliver quality  \n• Develop and mentor new team members  \n• Write and maintain product and design documentation  \n• Desire to deliver product training via formal settings and social media  \n• Interact with end client and be advocate of test automation awesomeness  \n• On-site support of customer (if required)\n\nSkills and Qualifications  \n• 5+ years working in 4G\/5G mobile network packet core deployment and\/or\ntesting environment.  \n• Experience in software design and development  \n• Proficiency on software project using ROBOT\/Python  \n• Proficiency on using Spirent Landslide test equipment  \n• Demonstrated technical savviness to learn on fly and prototype a solution\nwith new and unknown tools and technologies.  \n• Experienced in creating unit and automated test cases\/suites for NFVs  \n• Experienced in development environment with Linux, GIT, JIRA and Jenkins\ntoolsets.  \n• Experienced in developing and integrating NBI and SBI (REST\/SOAP\/\nCLI\/NETCONF)  \n• Experienced in ROBOT framework development preferred  \n• Strong problem analysis and problem-solving abilities and demonstrate\nbehavior to research and define solutions with open ended requirements  \n• Able to identify system deficiencies, create, design and document solutions  \n• Can do attitude and resourcefulness to develop complex application\ncomponents with quality and on time  \n• Strong interpersonal skills, ability to work and collaborate in team-based\nwork setting and demonstrated a persona to advocate the product with desire to\nshare knowledge.  \n• Experience with end-client and\/or customer management preferred.\n\n"},"Salary":{"0":null,"1":null,"2":null,"3":null,"4":"Depends on Experience","5":null,"6":null,"7":"$Negotiable","8":null,"9":"$70 - $75","10":"Depends on Experience"}}