{"id":{"0":1.0,"1":2.0,"2":3.0,"3":4.0,"4":5.0,"5":6.0,"6":7.0,"7":8.0,"8":9.0,"9":10.0,"10":11.0,"11":12.0,"12":13.0,"13":14.0,"14":15.0,"15":16.0,"16":17.0,"17":18.0,"18":19.0,"19":20.0},"Title":{"0":"Software Architect","1":"Senior Core Java Developer","2":"Senior iOS Developer","3":"Network Automation Engineer","4":"Senior Android Developer","5":"Java Angular Application Developer","6":"C\/C++ Team Lead","7":"Senior DevOps Role 100% Remote","8":"Application Support Analyst","9":"Facilities Services Customer Center Operator","10":"Software Engineer","11":"Senior Power Platform","12":"Java Angular Application Developer","13":"Java Developer","14":"C++, software optimization engineer","15":"QA Manager","16":"Senior Systems Administrator","17":"Core Java Developer","18":"Python Automation Tester (DevOps)","19":"Senior Power Platform"},"Entreprise":{"0":"Luxoft USA Inc","1":"Cynet Systems","2":"Motion Recruitment","3":"Motion Recruitment","4":"Motion Recruitment","5":"Cynet Systems","6":"Luxoft USA Inc","7":"Motion Recruitment","8":"TekWissen LLC","9":"Cynet Systems","10":"Global Technical Talent","11":"Cynet Systems","12":"Cynet Systems","13":"Experis","14":"Jobot","15":"Motion Recruitment","16":"Global Technical Talent","17":"Cynet Systems","18":"Cynet Systems","19":"Cynet Systems"},"Type_Employ":{"0":"Full Time","1":null,"2":"Full Time","3":"Full Time","4":"Full Time","5":null,"6":"Full Time","7":"Full Time","8":"Contract W2, 12 Months","9":null,"10":"Full Time","11":null,"12":null,"13":null,"14":null,"15":"Full Time","16":"Full Time","17":null,"18":null,"19":null},"Location":{"0":"Toronto, ON","1":"Toronto, ON","2":"Toronto","3":"Toronto","4":"Toronto","5":"Toronto, ON","6":"Toronto, ON","7":"Toronto","8":"Montral, Qubec","9":"Toronto, ON","10":"Toronto","11":"Toronto, ON","12":"Toronto, ON","13":"Toronto, ON","14":"Toronto,","15":"Toronto","16":"Mississauga","17":"Toronto, ON","18":"Toronto, ON","19":"Toronto, ON"},"Description":{"0":"## Job Description\n\n**Project Description:**\n\nWho You Are  \n• You can demonstrate experience in. A minimum of 5-10 years as a Technical\nArchitect\/Consultant. You have excellent knowledge of various types of\ntechnologies, deeply aware of new trends and new industry tech stacks. You\nhave experience leading technical teams, creating executive decks\nindependently and are well versed at presenting to executives. Experience\nworking with business and architecture teams to develop and design technology\nsolutions is essential to this role. Ideally, you have progressed through\napplication development, analysis and design Solid experience with a variety\nof technologies\/frameworks including event-driven architecture, REST APIs,\nmicroservice architecture, CI\/CD processes, DevOps pipelines, etc. Product &\nDomain knowledge Fintech, digital banking, Payments, Foreign Exchange,\nInternational Remittance would be a great asset.  \n• You have a degree \/ diploma in : Computer Science, Engineering, Math,\nPhysics or Technical discipline; a Master's degree or a PHD would be an asset  \n• You're driven to succeed. You are motivated by accomplishing your goals and\ndelivering your best to make an impact.  \n• You're driven by collective success. You know that collaboration can\ntransform a good idea into a great one. You understand the power of an\ninclusive team that enjoys working together to bring a shared vision to life.  \n• You're digitally savvy. You seek out innovative solutions and embrace\nevolving technologies. You can easily adapt to new tools and trends.  \n• You understand that success is in the details. You notice things that others\ndon't. Your critical thinking skills help to inform your decision making.  \n• You look beyond the moment. make decisions and take actions that will make a\ndifference today and tomorrow. You proactively seek new opportunities to\ndefine what's possible.  \n• Values matter to you. You bring your real self to work and you live our\nvalues - trust, teamwork, and accountability.  \n  \nHow You'll Succeed  \n• Strong Leadership: Be a bold and authentic leader who is passionate about\ndeveloping and coaching to bring out the best in people.Direct, motivate,\ndevelop and manage performance of the project delivery teams.  \n• Strategic Development & Execution: Build technical solutions that take into\naccount enterprise vision, current state and opportunities to build a future\nstate of Personal Banking Products Technology for our Clients and Frontline.\nAnalyze the viability of the solution to meet product timelines, budget and\nquality.  \n• Relationship Management:. Collaborate with Business and Technology partners\nto translate requirements to technical designs and act as the lead technical\nauthority.  \n• Collaborative: Work with Business Stakeholders, Architecture, Technology,\nand Product teams to ensure all aspects of the solution are defined in\nconjunction with CIBC standards, policies, priorities and best practices.  \n• Strong Communication: Working closely and interacting with business partners\nand vendors reporting, negotiating and managing services, documenting and\npresenting ideas and recommendations.  \n  \nWhat CIBC Offers  \nAt CIBC, our people are our greatest asset. You'll become part of a diverse\ncommunity that acknowledges everyone's unique talents and empowers teams to do\nwhat's right for the client, and to do it well. As part of our team, you will:  \n• Thrive: Benefit from an open and approachable culture that provides the\nflexibility and support you need to integrate your life at work and at home  \n• Connect: Work in a place where the right technology and infrastructure\nfosters innovation, collaboration and creativity  \n• Develop: Grow your skills and career through our best-in-class onboarding\nexperience, ongoing learning opportunities, and individual development\nplanning  \n• Prosper: Share in our collective success with a competitive salary,\nincentive pay, banking benefits, health benefits program, and employee share\npurchase plan\n\n**Responsibilities:**\n\nWhat You'll Be Doing  \nAs a Solution Design Director, you will partner with business and technology\nstakeholders to help define solution options for business ideas prior to\ninception. You will primarily be responsible for the creation and\nrationalization of solutions as well as the communication of the same to both\nbusiness and technology stakeholders and providing guidance to the delivery\nteams for its implementation. In addition, your responsibilities extend to\nleading the design practice within the team, improving the design process &\nArtifacts, and providing training & guidance to other members of the team.\nOther accountabilities include: creating the solution design for new\ninitiatives and contribute to the overall design strategy of the Alternative\nSolutions Group and Simplii Financial line of business. As well as effectively\nand accurately translating functional and non-functional business requirements\ninto technical solutions. This includes ensuring alignment of solution designs\nwith low level app designs, and creating reasonable interim solutions of the\nvarious phases\/workstreams, while considering the desired overall target state\noutcomes including ease of on-going support. Additionally, you will be\naccountable for remediating any design and build issues that may arise.\n\n**Mandatory Skills Description:**\n\nArchitectural Design, Cloud Architecture, Microservices\n\n**Nice-to-Have Skills:**\n\nDevOps, REST API\n\n","1":null,"2":"## Job Description\n\n**Senior iOS Developer**  \n  \nJob Description  \n  \nAre you looking to join a dedicated company that's proven its software is not\nonly made to last, but to thrive in a constantly evolving market? Their mobile\napps, at the core of these critical workflows, are powered by reliable,\nscalable, resilient distributed systems that reach people all across the\nworld.  \n  \nRequired Skills & Experience  \n\n  * 2+ years experience as a technical lead or managing engineering teams\n  * 5+ years experience developing and supporting software in a production environment\n  * 5+ years experience programming in object oriented languages such as Swift or Objective C\n\n  \nDesired Skills & Experience  \n\n  * 3+ years experience developing and supporting scalable, distributed backend services\n  * 3+ years experience working with databases\n\n  \nWhat you will be doing  \n\n  * 100% Hands on\n\n  \nThe Offer  \n\n  * Benefits (Medical, Dental, Vision)\n  * 4 weeks of vacation\n\n  \nApplicants must be currently authorized to work in Canada on a full-time basis\nnow and in the future. Accommodation will be provided in all parts of the\nhiring process as required under Motion Recruitment's Employment Accommodation\npolicy. Applicants need to make their needs known in advance.\n\n","3":"## Job Description\n\nService providers urgently need a streamlined way to manage their 5G networks\nand launch new services at the click of a button, and my client is building\nit!  \n  \nMy client and its' operator partners lead the way with this jointly developed\ncommercial production deployment that will accelerate network innovation and\nsimplify operations of the transformed, modernized network.  \n  \nAre you dynamic, curious, and excited about automation, 5G network evolution,\nand cloud technology? Are you willing to learn and to teach? If yes, come tune\nyour skills to develop the next state-of-the-art open-source network\nautomation system!  \n  \n**Contract Duration:** 6-18 months, able to extend or convert to a FT employee\nat 6 months  \nRequired Skills & Experience  \nBachelor's degree in Science\/IT\/Computing or equivalent  \n  \n• Minimum 10 years of experience in software engineering and at least 5 years\nof experience in QA automation development.  \n  \n• Strong understanding of:  \n  \no Python  \n  \no Troubleshooting, debugging, and root cause analysis  \n  \no Cloud native and micro-services software architecture (and RESTful APIs)  \n  \no Networking, and have experience with networking software, protocols or\nmodels (e.g. ONAP, Openstack, YANG, TOSCA, HEAT, Netconf, SNMP, CLI, BGP)  \n  \n• Experience with:  \n  \no Wireless networks, 5G standalone Core, network slicing, and RAN.  \n  \no Kubernetes and Docker, understanding container orchestration  \n  \no Networking, understanding concepts of SDN, understand how code and\nnetworking interact  \n  \no Test planning, looking for edge cases, understanding design specifications\nand deriving test cases  \n  \no Working with Agile Scrum teams  \n  \n• Responsible for the design and development of automation flows in an\neffective manner  \n  \n• Good understanding of Network Function Virtualization and network automation\nprinciples  \n  \n• Exposure to microservices architecture  \n  \n• Open to testing manually (as required)  \n  \n• Familiarity with devOps principles, CI\/CD pipeline, working with GitLab,\nJenkins, Gerrit  \nDesired Skills & Experience  \n• Robot test automation  \n  \n• ONAP experience is an asset  \n  \n• Selenium UI Web driver  \n  \n• Test framework development  \nWhat You Will Be Doing  \n• You will work with software engineers and other architects to define and\nrefine the solution to align with the business, development, deployment, and\nmaintenance needs.  \n  \n• You will collaborate with the Product Owner and the Scrum Master to manage\nthe team backlog.  \n  \n• You will be a key technical contributor, owning stories and designing,\ndeveloping, and supporting test automation  \n  \n• You will research, evaluate, and prototype new methodologies, technologies,\nand products, you will propose and follow through with improvements in\nprocesses and tools.  \nThe Offer  \nYou will receive the following benefits:  \n\n  * Statutory Vacation\n\n  \n  \n#LI-AL1\n\n","4":"## Job Description\n\n**Senior Android Developer**  \n  \n**Job Description**  \n  \nMy client is relied upon by governments and trusted agencies across the world.\nThey build security technology that makes it possible for millions of\nindividuals, and government agencies to secure data. With offices in around\nthe world, they're eager to take on new employees to grow and strengthen their\nteam today!  \n  \n**Required Skills & Experience**  \n\n  * Design and implement scalable systems and infrastructures.\n  * Continuous improvement of foundational components in the dimensions of configurability and quality.\n  * Measure work thoroughly, analyze results, and generate hypothesis to drive new product changes through A\/B testing.\n  * Setup monitoring and testing of your APIs and services to better understand real time health of your products.\n\n  \n**Desired Skills & Experience**  \n\n  * Experience working on a team with large amount of ownership and responsibility for managing things directly.\n  * Great understanding of designing highly scalable and performant micro-services and storage layers using common frameworks, languages and cloud infrastructure. (e.g Java, Kotlin, AWS.)\n  * Strong background in testing\/quality mindset with clear design solutions.\n  * Data-driven and strongly motivated by success and learnings through experiments and metrics analysis.\n\n  \n**The Offer**  \n\n  * RSU's (as it's a publicly traded stock)\n  * 10% yearly bonus\n  * Fully remote from anywhere in Canada\n  * Unlimited access to any of Coursera's courses, and up to 10 free courses for friends and family per year\n\n  \n  \nApplicants must be currently authorized to work in Canada on a full-time basis\nnow and in the future.\n\n","5":null,"6":"## Job Description\n\n**Project Description:**\n\nOur Client is on a mission to build the relationship-focused bank of the\nfuture and we're looking for the passionate collaborators, innovators,\nadvisors, and leaders who can get us there.  \nWe specialize in custom development and vendor packages with domain knowledge\nin Capital Markets and Treasury.  \nCurrently we are working on modernizing a trading platform and moving to micro\nservices architecture.  \n  \nWho You Are  \n• You can demonstrate experience with: 6+ years in C\/C++, GoLang, Swagger and\npayment systems with a deep knowledge on financial protocols (e.g. ISO8583,\nVISA Net, MasterCard, CUP) and experience of designing system to system\nintegrations. It is an asset if your have good knowledge on development design\npatterns and best practices. Prior experience in cloud technologies (like\ndocker, Kubernetes, AWS, and Azure). Designing and building scalable\nproduction quality REST APIs. Excellent knowledge of version control (e.g.\ngithub) and build tools (e.g. Jenkins). Operating with minimal supervision and\nperforming moderate to difficult technical tasks independently Knowledge of\nDynatrace is a plus.  \n• You have a degree\/diploma in computer science, computer engineering or a\nrelated discipline.  \n• You embrace and champion change. You'll continuously evolve your thinking\nand the way you work in order to deliver your best.  \n• Your influence makes an impact. You know that relationships and networks are\nessential to success. You inspire outcomes by making yourself heard.  \n• You're digitally savvy. You seek out innovative solutions and embrace\nevolving technologies. You can easily adapt to new tools and trends.  \n• You're driven by collective success. You know that collaboration can\ntransform a good idea into a great one. You understand the power of an\ninclusive team that enjoys working together to create a shared vision.  \n• Values matter to you. You bring your real self to work and you live our\nvalues - trust, teamwork, and accountability.\n\n**Responsibilities:**\n\nHow You'll Succeed  \n• Design and Development - Perform and coordinate complex application\nprogramming activities. Design the application's technical infrastructure\nusing specific databases, programming languages, utilities, and testing\napproaches. Lead the design and development of cost-effective and innovative\nsolutions.  \n• Strategic Planning - Develop multi-year technology roadmaps that align with\nthe bank's vision, strategy, and business objectives. Lead multiple complex\nprojects involving backend systems, new technology, and the enhancement of\nexisting applications. Working with Project Managers, Business, BA, and other\nstakeholders to contribute to detailed project plans based on agreed upon\nproject priorities.  \n• Accountability - Accountable for tracking individual change request life\ncycle from scope through deployment. (Participate in all SDLC phases)  \n• Leadership Skills - Act as development team lead and run code-review\nsessions with the wider team to ensure the project is on track to meet\nobjectives. Support and mentor intermediate and senior developers by sharing\nknowledge, collaborating and problem solving.\n\n**Mandatory Skills Description:**\n\nC\/C++, financial protocols (e.g. ISO8583, VISA Net, MasterCard, CUP), github\n\n**Nice-to-Have Skills:**\n\nGolang, cloud technologies (like docker, Kubernetes, AWS, and Azure), REST\nAPI, Dynatrace\n\n","7":"## Job Description\n\nA new and upcoming cyber security company that has a mission to create a world\nwhere we can trust our technology is looking for you! This position is based\nin Toronto, ON but is a full-time, 100% remote opportunity! This company is\nrecognized for their performance based monthly recognitions and unlimited\nability for career development.  \n  \nIf you are looking to be a part of an innovative industry with a team that is\nready and willing to learn and listen while advancing day-to-day technology,\nthen you are in luck! The environment will be an excellent fit for an engineer\nwho works best in a fast-paced, constantly evolving and friendly workspace!\nThey are looking for someone who wants to help solve for success and are\nalways ready and will learn and take on a new opportunity! Working with this\ncompany means you will have the immediate opportunity to make a positive\nimpact on the software and hardware security by working with industry leaders\nand agencies.  \n  \nWhat you will be doing:  \n\n  * Advocate and analyze all current DevOps technology within the company\n  * You will be a critical part of the team that integrates, deploys and support all platforms for their enterprise customers.\n  * Always improving all cloud-related monitoring, troubleshooting, configuration etc.\n  * Work with and learn from a team of experts in automation, scaling and operations.\n  * 70% Hands On\n  * 30% Team collaboration\n\n  \nRequired Skills & Experience:  \n\n  * 5+ years of experience in a DevOps role or a software development role with a DevOps flavor\n  * 2+ years of experience working with Kubernetes with creating & maintaining Helm charts.\n  * 2+ years of experience in operations, administering Linux based systems.\n  * Intermediate experience with scripting languages: Python and bash\n\n  \nYou will receive the following benefits:  \n\n  * Unlimited Vacation\n  * Holiday Pay\n  * Tailored Benefits\n\n  \nApplicants must be currently authorized to work in Canada on a full-time basis\nnow and in the future.\n\n","8":"## Job Description\n\n**Overview: **\n\nTekWissen Group is a workforce management provider throughout the USA and many\nother countries in the world. Our client is a company who is a provider of\nbanking and financial services. The company operates through two divisions,\nRetail Banking and Services, and Corporate and Institutional Banking.\n\n **Job Description:**\n\n **Training and Experience Requirements:**\n\n  * Bachelor’s degree or foreign education equivalent experience in Computer Sciences or Engineering \n\n  * A minimum of 5 years supporting complex distributed systems in a similar environment like banking or telecoms+ years of experience in supporting IT systems. \n\n  * Basic knowledge of Rates, Credit, and FX instruments \n\n**Role Specific Requirements and Experience:**\n\n  * An excellent communicator with French\/ English spoken and written to a very high level is essential. You should be comfortable speaking with internal and external groups as well as business-side colleagues and clients \n\n  * Autonomous. Must own issues and use initiative to resolve and drive problems to completion without constant management \n\n  * Working closely with engineering and development teams to address repetitive issues, reduce operational effort and future service disruptions \n\n  * Full-stack application support experience – OS, network, middleware, database and application knowledge, and troubleshooting experience \n\n  * Knowledge of automation and systems monitoring, ideally with AutoSys and either Geneos or Dynatrace \n\n  * ITIL knowledge and processes with certification a plus \n\n  * Superior attention to detail and accuracy \n\n  * Whilst this is a team-based role, there is an opportunity to push for a team leadership position if the candidate has the desire and demonstrates the willingness \n\n  * The role shares an 8-hour shift with a colleague. Time can be arranged flexibly between the two team members. The shift pattern is 8am-5pm or 10am-7pm. Currently, the role is 80% home-based, but in time will transition to 50% remote and 50% office-based at our recently refurbished offices in downtown Montreal. There is no on-call and the expectation is that a few weekend days over the year are required (And compensated) to cover disaster recovery exercises. \n\n**Culture:**\n\n  * Focus on the needs of the business \n\n  * Act with integrity, accepting responsibility for actions \n\n  * Recognize opportunities for creativity and development of processes \n\n  * Achieve a sensible work\/life balance. \n\n**Tek Wissen® Group is an equal opportunity\/affirmative action Employer\n(m\/f\/d\/v) supporting workforce diversity.**\n\n","9":null,"10":"## Job Description\n\nJob Description  \n  \n**Software Engineer**  \n  \n**Summary Of Day-To-Day Responsibilities:**\n\n  * Our Client is are seeking candidates for the position of IT Operations Specialist\/Development Engineer within our team to support the our client Wealth Technology Solution teams. \n  * As part of this team, the candidate will work alongside other project team members (DevOps and Application Release Engineers, Business analysts, Developers, QA) and will specialize in: \n  * The Software Engineer will be developing and maintaining technical capabilities to support agile product development, including automated builds, automated infrastructure and application deployments, automated testing. \n  * Coordinating technical changes across teams for successful and timely delivery of projects. \n  * Triaging and escalating issues where necessary to ensure a high level of service maintained. \n  * Following the industry's best practices and our client standards. \n  * The Software Engineer will be supporting and managing project application environments. \n  * Actively contribute to the team's effectiveness and positive work environment, team's internal Practices & Processes. \n  * Actively participate in proof-of-concept efforts and actively seek and propose solutions to improve technical delivery and removal of tech debt. \n  * Prioritize and manage own workload to meet delivery dates. \n  * Be proficient in tools and processes required for developing and delivering software solutions. \n  * The Software Engineer will identify opportunities to improve service delivery and support process improvement initiatives. \n  * Assist in analysis, testing, and implementation of business solutions. \n\n  \n**Must Have:**\n\n  * Prior experience: focusing on continuous integration, infrastructure deployments, application code packaging and deployments, and test automation - 4 years \n  * Experience with Java, JBoss: 5 years \n  * Ability to install and maintain databases within Cloud Platforms preferably Azure: 3 years \n  * Working experience with MongoDB and Cassandra, including the ability to troubleshooting with the tools - Nice to Have \n  * Prior development experience in, NodeJS,.NET (NICE TO HAVE): 3 years \n  * Experience with configuration management, and containerization solutions tools such as Salt and Openshift (Nice to Have): 2 years \n  * Strong scripting skills in Bash, Python, PowerShell, YAML: 2 year \n\n  \n**About The Company:**  \nAs a top 10 North American bank, our client aims to stand out from its peers\nby having a differentiated brand - anchored in a proven business model and\nrooted in a desire to give its customers, communities, and colleagues the\nconfidence to thrive in a changing world.  \n  \nOur client engages in providing financial products and services. They offer\nvarious financial products and services, as well as telephone, Internet, and\nmobile banking services, retail and commercial banking services, as well as\nwealth management services. The Wholesale Banking segment provides capital\nmarkets, investment banking, corporate banking products, and investment needs\nto companies, governments, and institutions in financial markets.  \n#Tech  \n#LI-Remote  \n#LI-GW1\n\n","11":null,"12":null,"13":null,"14":null,"15":"## Job Description\n\n**QA MANAGER**  \n  \nOur client is looking for a driven and dedicated Software QA manager to build\nand manage a team testing new Real Estate Software applications. As a member\nof our fast-paced group, you will have the unique and special opportunity to\nlead and take part in new projects and help shape upcoming products that\ninspire and delight millions in the Real Estate industry today.  \n  \n**Key Qualifications**  \n\n  * Significant management experience. Ideally 5-10 years as a Software Quality Assurance manager\n  * Established pattern of building strong teams - attracting, hiring, motivating, and retaining the best engineers\n  * Great Knowledge of software development lifecycle, testing methodologies, QA terminology and processes\n  * Persistent and inquisitive problem solver, committed to driving quality forward\n  * Exceptional organizational and communication skills (oral, written and interpersonal) including the ability to communicate technical concepts to a non-technical audience\n  * Tremendous cross-functional influencer\n  * Knowledge of Java, Selenium, Garden.io, BrowserStack is a plus\n  * 5-10 years project management experience or experience leading large scale transformational, global change\n\n  \n  \n**Perks**  \n\n  * Competitive Salary\n  * Benefits\n  * Vacation\n\n  \n  \nApplicants must be currently authorized to work in Canada on a full-time basis\nnow and in the future. Accommodation will be provided in all parts of the\nhiring process as required under Motion Recruitment's Employment Accommodation\npolicy. Applicants need to make their needs known in advance.\n\n","16":"## Job Description\n\nJob Description  \n  \n**Senior Systems Administrator**  \n  \n**Job Summary** :\n\n  * Senior Role - Automation of deployment of ESXi clusters, and VMWare to create new VMs, Upgrades & troubleshooting Private Cloud Infrastructure issues, working with vendors to resolve HRDW issues. \n\n  \n**Job Responsibilities** :\n\n  * The Senior Systems Administrator will monitor and resolve incidents related to infrastructure systems and applications \n  * Initiate corrective actions to resolve system and infrastructure application errors. \n  * Log and document production problems, identify recurring problems, and recommend preventative measures. \n  * Answer calls from application support groups or systems engineers, identify problems and resolve or escalate as required. \n  * The Senior Systems Administrator interacts with systems programmers, server, database, and network support staff to maintain responsive and available infrastructure for the application \n\n  \n**Required Skills** :\n\n  * Extensive experience deploying & Upgrading ESXi clusters in VMware Infrastructure and on UCS servers, and related components (e.g. UCS central, Service Profile, FI configuration).- 5 years \n  * (Powershell, CLI, Python, Javascript, etc.). \n  * Extensive experience with VMWare and related technologies and components such as vRealize Automation (VRA7, VRA8), vRealize Operations (VRO), vCenter, NSX micro-segmentation - 5 years \n  * (project to host new VMs). \n  * Extensive knowledge of Powershell and\/or Python scripting tools and automation practices - 5 years \n  * Extensive knowledge of vRA and vCenter - 5 years \n  * Knowledge of NSX micro-segmentation - 2 years \n  * Knowledge with Service Now or similar tools used for Change Management & CMDB as well as Automation. \n  * Knowledge of UNIX systems management, servers, AIX\/Client-UX, UNIX systems, and support and diagnostic tools such as Openview or VERITAS, shell scripts, etc \n  * Exposure to multiple UNIX based operating systems is an asset \n\n  \n**Nice to Nice** :\n\n  * Linux\/Windows Server deployment automation \n  * Network and FW background \n  * Worked or have exposure to Audit findings & VMware Infrastructure Non Compliance\/Troubleshooting and Remediation. \n  * Understanding Network\/Infrastructure Designs \n\n  \n**Note** :\n\n  * VMware infrastructure build and deployment experience of 5 years minimum, \n  * Exposure to UCS servers & UCS Central, \n  * Automation experience using PowerShell or Python of 5+ years, \n  * Open to other large enterprise industries, this is a System Engineer role \n\n  \n**About the Company** :\n\n  * As a top 10 North American bank, our client aims to stand out from its peers by having a differentiated brand - anchored in a proven business model and rooted in a desire to give its customers, communities, and colleagues the confidence to thrive in a changing world. \n  * Our client engages in providing financial products and services. They offer various financial products and services, as well as telephone, Internet, and mobile banking services, retail and commercial banking services, as well as wealth management services. The Wholesale Banking segment provides capital markets, investment banking, corporate banking products, and investment needs to companies, governments, and institutions in financial markets. \n\n#tech  \n#LI-GW1  \n#LI-Remote\n\n","17":null,"18":null,"19":null},"Salary":{"0":"Depends on Experience","1":null,"2":null,"3":null,"4":null,"5":null,"6":"Depends on Experience","7":null,"8":"$500 - $550","9":null,"10":null,"11":null,"12":null,"13":null,"14":null,"15":null,"16":null,"17":null,"18":null,"19":null}}