{"id":{"0":"eEuWx","1":"q14O6","2":"1hFM8","3":"DdwFF","4":"2bzE5","5":"6eDE1","6":"d7sWe","7":"4J4J7","8":"Gz8sI","9":"AWKJn","10":"Ss06r","11":"mwlW2","12":"xb3ul","13":"UIKt4","14":"AoamP","15":"ee4OK","16":"xqLAa","17":"S6Rod","18":"uYk0A","19":"cJ1hu"},"Title":{"0":"Siebel Administrator","1":"Principal Software Developer (5G)","2":"Developer in eCommunications Surveillance Technology- Canada","3":"Senior Software Developer","4":"JAVA Full Stack- Canada- (JAVA, Database & UI)","5":"Adobe Campaign Manager\/Business Analyst","6":"Data Analyst Project Manager","7":"DCDC Primary Designer","8":"Senior Infrastructure Engineer","9":"Python Developer","10":"Fullstack Angular Developer","11":"Hardware Principal Developer","12":"Senior R&D Engineer (C++ Software Developer)","13":"RAN Field Engineer","14":"Senior Community Operations","15":"JDE Finance - Business analyst","16":"CTO - App Development","17":"Instrumentation and Control Engineer","18":"C++ Developer","19":"Project Manager"},"Entreprise":{"0":"Cynet Systems","1":"Stefanini","2":"Vedasoft Inc","3":"Jobot","4":"Vedasoft Inc","5":"Mastech Digital","6":"BCforward","7":"Stefanini","8":"BCforward","9":"Global Technical Talent","10":"Info Origin Inc.","11":"Stefanini","12":"Jobot","13":"Berean Group International, Inc.","14":"Cynet Systems","15":"Systems Recruiters, LLC","16":"Jobot","17":"Ian Martin Group","18":"Domain Experts Group LC","19":"Global Technical Talent"},"Type_Employ":{"0":null,"1":"Contract Independent, 12+ Months","2":"Contract Corp-To-Corp, Contract W2, 6+ months","3":null,"4":"Contract Corp-To-Corp, Contract W2, 6+ months","5":null,"6":"Contract W2","7":"Contract Independent, 12+ Months","8":"Contract W2","9":"Full Time","10":"Full Time","11":"Contract Independent, 12+ Months","12":null,"13":"Contract Independent, 12 Months","14":null,"15":"Full Time","16":null,"17":"Full Time","18":"Full Time","19":"Full Time"},"Location":{"0":"Mississauga, ON","1":"Ottawa, ON","2":"Montreal, QC","3":"Vancouver","4":"Montreal, QC","5":"Toronto, CDA","6":"Mississauga, ON","7":"Ottawa, ON","8":"Mississauga, ON","9":"Toronto","10":"Toronto, ON","11":"Ottawa, ON","12":"Vancouver","13":"Edmonton, AB","14":"Montreal, QC","15":"Brampton, ON","16":"Ottawa","17":"Peterborough, ON","18":"Vancouver, BC","19":"Toronto"},"Description":{"0":null,"1":"## Job Description\n\n  \nStefanini is looking for a Principal Software Developer (5G): Ottawa, ON  \n  \nJoin us as a Principal Software Developer on our 5G R&D team in Ottawa to do\nthe best work of your career and make a profound social impact.  \n  \nWhat you'll achieve  \n  \nAs a Radio Software Principal Developer will be responsible for designing,\ndeveloping and implementing a technology for addressing the demands of the 5G\nRadio subsystem for operators and to help our customers to exploit this\nsignificant market evolution. The candidate for this role will have\nsignificant work experience in 5G wireless development, 4G R&D, mobile\nsystems, and 3GPP as well as a strong background in Software and Algorithms\nrelated to Remote Radio Units. You will work with different 5G R&D Agile SW\ncomponent teams to design and implement Radio unit software. Your\ncontributions will drive product architecture and implementation in support of\nbuilding something from the ground up, all while working with colleagues\nacross the business to ensure client products always lead the way.  \n  \nYou will:Work with team management and other development groups to develop an\nimplementation plan and design for the 5G NR radio softwareParticipate in\ndefining and architect solutions allowing for scalability of RU layer 1 and\nRadio solutions for various RAN deploymentsCapture agreements in a design and\ntest document that will drive the implementation of the Radio SWHold design\nreviews to get closure in order to finalize the RU design document & RU design\nand test documents.Design and Implement functional areas (base, driver,\nservices and OAM) of the RU per the implementation plan.Work closely with the\nverification group to ensure the completeness, quality and performance of the\nimplemented RU functionality  \n  \nEssential RequirementsAdvanced knowledge in 4G\/5G Radio subsystems\narchitectureWorking knowledge with 4G\/5G RF characteristics, radio HW\ncomponents, 3GPP specifications in RAN8+ years of experience using C, C++11\nand Python 3.xWorking Knowledge in Linux Kernel, device driver, boot process,\nbash shell scripting, Yocto and build root  \n\n","2":"## Job Description\n\n**Developer in eCommunications Surveillance Technology**\n\n**Montreal, Canada**\n\n**6+ Months Contract** ****\n\n**Position Description:**\n\nThe Communications Surveillance technology team builds and executes complex\nsurveillance models and scenarios that focus on monitoring the firm's employee\nelectronic and audio communications. A developer in this space partners with\nbusiness analysts and drives forward the business agenda through solid design\nand execution. This is a hands-on role.\n\nThe ideal candidate should have the skills listed below but in addition should\nbe a self-driven, dedicated individual who can work well with both technical\nand non-technical audiences. In addition, the candidate should respond well to\nchange and quickly pick up new concepts, as well as devising new approaches\nfor solving challenges in the space. Technical and analytics skills combined\nwith strong interpersonal skills are required.\n\n**Skills Required:**\n\n\\- 3+ years of appropriate technical experience\n\n\\- Relevant experience with Java8, Scala, or Python\n\n\\- Strong Database experience preferably with DB2, Sybase, or Oracle\n\n\\- Good understanding of Hadoop (HDFS) eco-system\n\n\\- Good understanding of the Elastic search environment\n\n\\- Complete SDLC process and Agile Methodology (Scrum)\n\n\\- Strong oral and written communication skills\n\n\\- Experience working within a scrum team\n\n\\- Excellent interpersonal skills and professional approach\n\n**Skill Desired:**\n\n\\- Previous experience in the Compliance technology space\n\n\\- Previous experience with Spark processing on Hadoop\n\n\\- Experience working in a SaaS environment preferably with AWS, Google Cloud\nPlatform and\/or Azure\n\n\\- Experience with, or exposure to Hadoop and Spark\n\n\\- Knowledge of data analytics tools and methods\n\n\\- Experience working across time zones on a global team\n\n\\- Hands-on Data Mining and analytical work experience, big data or Scala on\nSpark\n\n\\- Unix OS, Scripting, Python or Perl\n\n\\- Elastic search scripts for data updates, reports, or extractions\n\n\\- Experience in developing statistical models and algorithms\n\n\\- Working knowledge of data processing tools\/languages including Perl,\nPython, etc.\n\n\\- Experience working within a cloud environment (SaaS preferred) including\nconnectivity, data transfer, and data retrieval (using APIs)\n\n","3":null,"4":"## Job Description\n\n**JAVA Full Stack (JAVA, Database & UI)**\n\n**Montreal, Canada**\n\n**6+ Months Contract** ****\n\nAs a Full Stack Java Developer, you will be responsible for hands-on\ndevelopment experience in Java, Spring, J2EE, Web Services, SQL databased\ndevelopment, UI Frameworks and Technologies across all phases of the software\ndevelopment lifecycle and assisting the Product Owner and squad in product\ndelivery. The ideal candidate should have the skills listed below but in\naddition should be a self-driven, dedicated individual who works well in a\nteam and thinks and acts strategically. When faced with a problem, the\ncandidate should be able to ask questions and leverage the skills and\nexpertise of those around them.\n\nResponsibilities\n\nEstimation and end to end execution of required changes, coordination with\nstakeholders as required\n\nResponsible for the development, maintenance and support of multiple\napplications or frameworks\n\nTranslate high-level business requirements on multiple, complex requests into\ndetailed functional, technical, and\/or system specifications\n\nTest software designs and solutions (including unit testing and integrated\ntesting)\n\nBuild and maintain automated test suites for applications\n\nSupport and respond to user queries or issues; determine the root cause and\nbest resolution of escalated issues\n\nWork with data management team and data providers to communicate and define\nany data (including data quality) and reporting requirements\n\n**Required technical Skills**\n\nBachelor's degree in Computer Science, Software Engineering, Information\nTechnology, or related field\n\nAt least 5+ years of hands-on application development utilizing Java\n\nExperience in the development of service-oriented architecture application,\ngood understanding of Object-Oriented Design and Design Patterns\n\nExperience in developing web services using standard Java based\nframeworks\/toolkits (REST, SOAP, JSON, and XML)\n\nSolid understanding of DB concepts and working with relational databases (DB2,\nSybase or other)\n\nHands on knowledge on git version control and CICD tools like Jenkins\n\nStrong knowledge of JavaScript\/TypeScript, CSS3 and HTML5\n\nExperience with MVC patterned applications using JavaScript frameworks and\nworking with front end development teams, preferably in Angular\n\nA strong understanding of SDLC principles and experience delivering in\nAgile\/Scrum\n\nStrong analytical and design skills, including the ability to understand\nbusiness requirements and translate them into efficient and effective\ntechnical designs that work well within large-scale, well-structured\nenterprise environments\n\n**Required Personal Skills:**\n\nA strong communicator with the ability to interface directly with clients and\nanalysts to ensure technical requirements and delivery align with expectations\n\nExcellent problem solving and troubleshooting skills, with the ability to\nquickly identify and document the root cause of issues, and effectively\ncommunicate possible resolutions\n\nEffective communication, presentation, and collaboration skills\n\nSelf-motivated individual and creative thinker who will take ownership of\ntasks assigned\n\nAble to thrive in a fast-paced, high energy, demanding and team-oriented\nenvironment\n\nGood customer service skills. Ability to deal with difficult\nsituations\/individuals gracefully\n\n**Desired Skills**\n\nKnowledge of Financial services\n\nExperience with Angular and\/or other modern frameworks would be a plus\n\nPrior experience with Trade surveillance and products like Actimize\n\nExperience with ETL or Data integration tools like Informatica, TalenD\n\nExperience with Data visualization tools and reporting tools\n\nExperience with Cloud based tools and technologies\n\nUI Design experience, specifically for web applications\n\nUnix OS, Scripting, Python or Perl\n\nExperience in development on other application types (Web applications, batch,\nor streaming)\n\nProficient in DevOps tooling and practices\n\n","5":null,"6":"## Job Description\n\n![](https:\/\/counter.adcourier.com\/UHJ1ZGh2aXJhai5WZW1wYXRpLjU4NTc4LjQwNzNAYmNmb3J3YXJkLmFwbGl0cmFrLmNvbQ.gif)  \n  \n\nData Analyst Project Manager\n\n  \n\n **BCforward is currently seeking highly motivated CA-Project Manager-Lead**\n\\- **Mississauga, ON**\n\n  \n\n  \n\nWe place consultants for end clients all over USA.\n\n  \n\n  \n\n**Job Title:** **CA-Project Manager-Lead**\n\n  \n\n**Location: Mississauga, ON**\n\n  \n\n **Expected Duration: 6 Months Contract**\n\n  \n\n  \n\n**Job Description:**\n\n  \n\nCompany - Global Spread Products technology is seeking a highly motivated\ncandidate for Senior Data Analyst position. The Senior Data Analyst will act\nas the single point of contact for those creating and consuming data within\ntheir respected data domain(s). Additionally, they will be driving the dev\nteams to interact directly with key domain and project stakeholders, other\ndata BA's across the organization and relevant SMEs throughout the\norganization as necessary. The Analyst will play an active role as the global\ndata representative in design decisions with up\/downstream implications;\nrequiring a deep understanding of data architecture implications in Data\nWarehousing, Kafka, Hadoop, and other Data Services technologies  \n  \nResponsibilities  \n  \n* Develops detailed and comprehensive project data plans for multi-year, multi-departmental initiatives, working with multiple internal tech teams and sets of partners to determine project goals, deliverables, and objectives with business requirements.  \n* Manages activities in all phases of large-scale systems including determining priorities and schedules, reporting and monitoring on progress to ensure compliance with regulatory and corporate policies and strategies.  \n* Lead Data Governance projects that involve clients from multiple departments and coordinates process of defining requirements and manages ongoing network for relationships to report on progress, discuss and resolve issues, facilitate implementation, build support and handle change management activities.  \n* Establishes relationships with ICG and GSP IT managers, senior client management and project stakeholders to promote and market systems, consults with vendors, consultants and peers to address systems issues and developments.  \n* Understand issues, complete root cause analysis with stakeholders from product control, reporting, Finance and Business to define solution to address the material impact  \n* Review data assets to identify critical attributes and socialize these with the wider enterprise systems  \n* Profile the data and define appropriate data quality rules especially for critical attributes to ensure reliable data. Data BA is are also accountable to ensure data quality issues are addressed reliably and in a timely fashion.  \n* Identifying golden sources of data sets and guiding users and application development to use these  \n* Create and maintain data lineage allowing users to trace data reliably to the point of origin and pinpoint any quality problems in the data pipelines  \n* Promote data accuracy and adherence to Company Data Management Policy defined global governance practices, as well as driving acceptance of data standards and policies across the various business segments.  \n* Define, maintain and advise relevant stakeholders as appropriate on data governance-related matters.  \n* Provide recommendations and supporting documentation for new or proposed data standards, business rules and policy.  \n* Advice on various projects and initiatives to ensure that any data related changes and dependencies are identified communicated and managed to ensure adherence with the Data Governance established standards.  \n* Coordinate across the organization with fellow Data BAs on strategic initiatives, in order to maintain consistency of Client operational and analytical data across all Asset Classes.  \n* Accountable for ensuring that data-centric activities are aligned with the CDO program and leverage applicable data standards, governance processes, and overall best practices.  \n* Ensure alignment of the data governance processes and standards with applicable enterprise, business segment, and local data support models.  \n* Maintain the single set of enterprise-level data standards & repository of key elements (CDE) pertaining to their in-scope data domain, and promoting their use throughout the MSST organization.  \n* Monitor key data management and governance metrics to ensure the accuracy and completeness of the critical data within their domain(s).  \n* Collaborates across the organization to ensure consistent and effective execution of data governance and management principles across MSST and Global Spread Products analytical systems and data domains.  \n  \n  \nRequirements  \n  \n* 5-8 years of proven track record of successfully leading strategic, complex, large-scale enterprise and agile IT projects.  \n* 3-5 years of experience in formal Data Governance within a global company; Strong data management background who understands data, how to ingest data, proper data use\/consumption, data quality, and stewardship.  \n* 3-5 years of experience working in the Finance and Vendor master data domains, associated elements\/processes, involved systems and interdependent data.  \n* 2-5 years of experience working in data management with Code mining, Data Mining, Visual data Lineage, System to system Lineage as Information Steward  \n* Knowledge of technologies such as Informatica, Manta, Solidatus, Collibra, Linkurious, ASG technologies other data governance and data quality tools.  \n* Ability to collaborate with the business and technical subject matter experts to ensure standardization of operational information and execution of enterprise-wide data governance policies and procedures are defined and implemented.  \n  \nCompetencies  \n  \n* Strong knowledge and understanding of master data elements and processes per the necessary in-scope data domains, specifically Finance and Vendor.  \n* Strong Communication Skills\/Able to Persuade\/Influence Others at all Organization Levels and the ability to foster lasting partnerships.  \n* Ability to translate business requirements into critical data dependencies and requirements. Ability to think beyond their current state (processes, roles and tools) and work towards an unconstrained, optimized design.  \n* An ability to education functional teams the benefits of thinking beyond the 'way the things work today'.  \n* Able to align various stakeholders to a common set of standards and the ability to sell the benefits of the Company Data Management Policy program.  \n* Foster lasting relationships across varying organizational levels and business segments with the maturity to interface with all levels of management.  \n* Self-starter who welcomes responsibility, along with the ability to thrive in an evolving organization and an ability to bring structure to unstructured situations.  \n* Excellent written & verbal communication skills.\n\n  \n\n ****\n\n  \n\n**About BCforward:**\n\n  \n\nBCforward began as an IT business solution and staffing firm. Founded in 1998,\nBCforward has grown with our customers' needs into a full-service personnel\nsolution's organization. Headquartered in Indianapolis, Indiana, BCforward\nalso operates numerous delivery centers across North America and India. We are\ncurrently the largest consulting firm and largest MBE certified firm in\nIndiana. Our uninterrupted growth has allowed BCforward to deliver uniquely\nconfigured IT staffing and project solutions for over the years of catering to\nour customers' specific needs. BCforward currently maintains a team of over\n5000 global resources. With our additional brand, Stafforward, together we\nhave the capabilities to deliver services for a variety of industries in both\npublic and private sectors which allows us to address your most challenging\nneeds.\n\n  \n\n  \n\n[www.BCforward.com](http:\/\/www.bcforward.com\/)\n\n  \n\n  \n\n[www.facebook.com\/bcforward](http:\/\/www.facebook.com\/bcforward)\n\n  \n\n\"We must inform you that during the hiring process, we may ask for you to\ndisclose and provide us with various categories of your personal information,\nincluding identifiers such as your name and address, professional information,\ncommercial information, education information, and other related information.\nPlease note that we will only use this information to facilitate and complete\nthe recruiting process. This posting is not an offer of employment. The\nsubmission of intentionally false or fraudulent information in response to\nthis job posting shall render the applicant ineligible for the position.\nBCforward is an equal opportunity employer. Any subsequent offer of employment\nshall be considered employment at will regardless of the anticipated\nassignment duration.\"\n\n  \n\n  \n\n  \n\nInterested candidates please send resume in Word format Please reference job\ncode 176113 when responding to this ad.\n\n  \n\n* * *\n\n  \n\n","7":"## Job Description\n\n  \nStefanini is looking for DCDC Primary Designer in Ottawa, Ontario,\nCanadaResponsibilities:Works on unusually complex problems and provides highly\ninnovative solutionsUses independent judgment to accomplish goals and\nobjectivesHas insight into industry trends and communicates vision to guide\norganizational strategy and long-range planningLends research and contributes\nto evaluations, project plans and budgets for new products or updates existing\nproducts Acts as consultant on critical projects that impact long term\norganizational goals and objectivesLeads teams, gives technical guidance and\ncommunicates with senior management on progress Identifies or creates\nsolutions that are likely to contribute to the development of new company\nconceptsExpected to set standards and achieve cost targets for product cost\nthrough proper design choices, component selection or supplier\nselectionDemonstrated expertise in competitive analysisMay actively seek\ncustomer input and take responsibility for internal and external customer\nsituationsDetermines requirements and functional specifications for entire\nsystem, under only consultative directionKey Responsibilities:Own all aspects\nof the power solution on the Remote Radio Unit including lightning protection,\npolarity protection, hot-swap circuit, EMC filter, power stage and control\nloop design.Work with Hardware, Mechanical, Thermal design and external power\nsupply partner(s) to realize power solution.Point of contact to Power Supplier\nvendor, Component Engineer, Sourcing Primes, and Contract Manufacturing\nhouses.Design of isolated and non-isolated DCDC design.Responsible for\nschematic and layout design. (Guiding of the layout designer on placement and\nrouting of power circuits).Mentor less senior designers, guiding them as\nneeded in their work.  \n  \nEssential Skills and Expertise\/Experience:In-depth understanding of\ngrounding\/surge requirements that accompany an Outdoor Remote Radio\nUnitWorking knowledge of Forward, Flyback, Buck, Boost, Buck\/Boost, Half-\nBridge, Full-Bridge DCDC converter design.Hand on experience with LISN, Loop\nAnalyzer, Electronic loads, DC source, Oscilloscope etc.  \n\n","8":"## Job Description\n\n![](https:\/\/counter.adcourier.com\/UHJ1ZGh2aXJhai5WZW1wYXRpLjE4MzYwLjQwNzNAYmNmb3J3YXJkLmFwbGl0cmFrLmNvbQ.gif)  \n  \n\nSenior Infrastructure Engineer\n\n  \n\n **BCforward is currently seeking highly motivated CA-Specialty Developer-\nAnalyst** \\- **Mississauga, ON**\n\n  \n\n  \n\nWe place consultants for end clients all over USA.\n\n  \n\n  \n\n**Job Title:** **CA-Specialty Developer-Analyst**\n\n  \n\n**Location: Mississauga, ON**\n\n  \n\n **Expected Duration: 12 Months Contract**\n\n  \n\n  \n\n**Job Description:**\n\n  \n\nThe Senior Infrastructure Engineer will be responsible for Infra related\nactivities that includes server builds, software install and configuration ,\nOS and software remediation's and environment setup. Candidate will be\nresponsible for provisioning and configuration of new Infra request for the\nmultiple applications.\n\n  \n\nHelp troubleshoot the issues related to application setup and deployment\nconfigurations. The candidate should have experience talking to multiple\napplication stakeholders and coordinating multiple tasks at the same time and\nshould be willing to perform deep dive investigating to achieve results.\n\n  \n\n  \n\nKey Responsibilities:\n\n  \n\n  \n\n1) Create automation of repetitive tasks like Software Install\/upgrades, DB\npatching, OS Patching, Server build\n\n  \n\n2) Responsible for setting up the application framework and configuration. For\nexample- IBM WebSphere, WebLogic, Tomcat setup, WMQ and Messaging services\nsetup, Connectivity setup with upstream and downstream systems.\n\n  \n\n3) Create complex project plans, perform impact analyses solve\/work high\nimpact problems\/projects, and provide resolutions to restore services\n\n  \n\n4) Drive Root Cause Analysis (RCA) post restoration of service\n\n  \n\n4) Review requirement documents, define hardware requirements and examine and\nupdate processes and procedures as necessary\n\n  \n\n5) Provide technical\/strategic direction and act as advisor\/coach to lower\nlevel analysts\n\n  \n\n6) Develop projects required for design of metrics, analytical tools,\nbenchmarking activities and best practices\n\n  \n\n7) Knowledge of CICD tools and automation pipelines.\n\n  \n\n8) UNIX\/Linux experience for setting up application environments using\nautomated scripts.\n\n  \n\n9) Contribute to technical direction and strategic decisions by prepare,\ndiscuss and implement strategic solutions to avoid repeated issue.\n\n  \n\n10) Has the ability to operate with a limited level of direct supervision.\n\n  \n\n11) Acts as SME to senior stakeholders and \/or other team members.\n\n  \n\n12) Coordination of infrastructure activities with SA, Admin, Solution team.\n\n  \n\n13) Comfortable working with Service now change management.\n\n  \n\n14) Documenting the project related process and guidelines.\n\n  \n\n  \n\nTechnical Expertise\n\n  \n\n1) Should be able to write\/debug and automate tasks using Unix\/Shell scripts,\nPython scripting and Ansible playbooks for software installation, patching and\nbuilding environments.\n\n  \n\n2) Knowledge of Virtual IP\/ Wide IP, Load Balancing, Network. Always-on design\nand setup.\n\n  \n\n3) Working knowledge of Certificates, SSL, Connectivity and Firewall.\n\n  \n\n4) Experienced in platform migration and upgrade activities. Ex. OS and DB\nmigration activities (Unix and Windows)\n\n  \n\nGood To Have:\n\n  \n\n1) Experience moving legacy application to cloud environment\n(Kubernetes\/OpenShift\/AWS).\n\n  \n\n2) Nice to have knowledge of CI\/CD tools like jenkins, udeploy.\n\n  \n\n3) Knowledge of AWS, cloud ecosystem.\n\n  \n\n  \n\nQualifications:\n\n  \n\n8-12 years of experience in Infrastructure Technologies delivery with a proven\ntrack record of operational process change and improvement\n\n  \n\nAbility to communicate technical concepts to non-technical audience\n\n  \n\nAbility to work with virtual and in-person teams, and work under pressure or\nto a deadline\n\n  \n\nExperience in a Financial Services or large complex and\/or global environment\npreferred\n\n  \n\nEffective written and verbal communication skills\n\n  \n\nEffective analytic\/diagnostic skills\n\n  \n\nEducation:\n\n  \n\nBachelors\/University degree or equivalent experience\n\n  \n\n ****\n\n  \n\n**About BCforward:**\n\n  \n\nBCforward began as an IT business solution and staffing firm. Founded in 1998,\nBCforward has grown with our customers' needs into a full-service personnel\nsolution's organization. Headquartered in Indianapolis, Indiana, BCforward\nalso operates numerous delivery centers across North America and India. We are\ncurrently the largest consulting firm and largest MBE certified firm in\nIndiana. Our uninterrupted growth has allowed BCforward to deliver uniquely\nconfigured IT staffing and project solutions for over the years of catering to\nour customers' specific needs. BCforward currently maintains a team of over\n5000 global resources. With our additional brand, Stafforward, together we\nhave the capabilities to deliver services for a variety of industries in both\npublic and private sectors which allows us to address your most challenging\nneeds.\n\n  \n\n  \n\n[www.BCforward.com](http:\/\/www.bcforward.com\/)\n\n  \n\n  \n\n[www.facebook.com\/bcforward](http:\/\/www.facebook.com\/bcforward)\n\n  \n\n\"We must inform you that during the hiring process, we may ask for you to\ndisclose and provide us with various categories of your personal information,\nincluding identifiers such as your name and address, professional information,\ncommercial information, education information, and other related information.\nPlease note that we will only use this information to facilitate and complete\nthe recruiting process. This posting is not an offer of employment. The\nsubmission of intentionally false or fraudulent information in response to\nthis job posting shall render the applicant ineligible for the position.\nBCforward is an equal opportunity employer. Any subsequent offer of employment\nshall be considered employment at will regardless of the anticipated\nassignment duration.\"\n\n  \n\n  \n\n  \n\nInterested candidates please send resume in Word format Please reference job\ncode 176160 when responding to this ad.\n\n  \n\n* * *\n\n  \n\n","9":"## Job Description\n\nJob Description  \n  \n**Python Developer**  \n  \n**Summary:**\n\n  * We are looking for a strong Python developer with a good understanding of CI\/CD pipeline design and development to deliver enterprise features and integration to support various cloud services. \n  * The perfect candidate will have a strong Python programming skills, writing secure, testable, robust code with previous cloud experience within financial services is an asset. \n  * The role will also request candidates to have a good understanding of various CI\/CD deployment tools (i.e. Git, GitHub Actions, Jenkins, Terraform, Nexus \/ Artifactory, Docker\/Kubernetes, etc.). \n  * The main function of a Developer (Other Specialty) is to design, develop, and implement applications using in-demand languages and technologies (e.g. - WebSphere, Informatica, etc.) to support business requirements. \n\n  \n**Job Responsibilities:**\n\n  * Analyze highly complex business requirements; generate technical specifications to design or redesign complex software components and applications \n  * Act as an expert technical resource for modeling, simulation, and analysis efforts Leverage industry best practices to design, test, implement and support a solution \n  * The Python developer will assure quality security and compliance requirements are met for the supported area Be flexible and thrive in an evolving environment \n  * Adapt to change quickly and adjust work accordingly in a positive manner \n\n  \n**Qualifications:**\n\n  * Bachelor's degree in a technical field such as computer science, computer engineering or a related field required \n  * 5-7 years experience required Development experience in needed language or technology (e.g. - WebSphere, Informatica, etc.) \n  * Hands-on experience in designing, developing, and successful deployment of large scale projects from end-to-end \n  * Hands-on experience in following the iterative and agile SDLC \n\n  \n**Must Have:**\n\n  * Python \n  * read and write code \n  * communication is vital to give the team feedback \n  * Familiar with DevOps tools and methodologies \n\n  \n**Nice To Have**\n\n  * Java experience \n\n  \n**Note:**\n\n  * Development experience, python is very important. Needs to be able to write and read code. \n\n  \n**About the Company**  \nAs a top 10 North American bank, our client aims to stand out from its peers\nby having a differentiated brand - anchored in a proven business model and\nrooted in a desire to give its customers, communities, and colleagues the\nconfidence to thrive in a changing world.  \n  \nOur client engages in providing financial products and services. They offer\nvarious financial products and services, as well as telephone, Internet, and\nmobile banking services, retail and commercial banking services, as well as\nwealth management services. The Wholesale Banking segment provides capital\nmarkets, investment banking, corporate banking products, and investment needs\nto companies, governments, and institutions in financial markets.  \n  \n#tech  \n#LI-GW1  \n#LI-Remote\n\n","10":"## Job Description\n\n**NEW OPPORTUNITY! HURRY UP WE ARE HIRING...!**\n\nPosition Title: Full Stack Angular Developer  \nLocation: Toronto, ON, Remote  \nPosition Type: Full-Time  \nPosition Duration: Permanent\n\n **Job Description:**  \nExperienced in all phases of the development life cycle. Passion to design and\ndevelop applications, coordinate with the rest of the team to deliver high\nquality software products. Staying current on new technologies and employ best\npractices in utilizing a broad platform of technologies within a cloud based\nmicro services environment;\n\n **Roles And Responsibilities:** **Mandatory Skills:**\n\n\\- Frontend Performance and Bundle Budgeting.  \n\\- Work with UI\/UX designers to ensure technical feasibility of their designs\nand develop new user-facing responsive features..  \n\\- 5+ years of hands-on commercial experience with developing full stack SPA\nweb applications.  \n\\- Advanced knowledge and experience of the following technologies a must:  \nHTML5, CSS3 \/ LESS, jQuery, Angular 6+, Typescript 3+, NodeJS ****\n\n**Education:-** Bachelor’s degree or higher in Computer Science\/Engineering\n\nIf you are interested just click on Apply!\n\n","11":"## Job Description\n\n  \nStefanini is looking for Hardware Principal Developer in Ottawa,\nCanadaResponsibilities:Exercises considerable latitude, without appreciable\ndirection, in determining technical objectives and meeting program\ndeliverablesMay be expected to set standards and achieve cost targets for\nproduct cost through proper design choices, component selection and supplier\nselectionSignificant contributor to organizational goals and\nobjectivesCollaborates across all engineering disciplines to ensure product\nrequirements are being implemented to meet program goalsMay assume lead role\non cross-functional collaborative effortsMay be accountable for overall\nproduct and serve as a customer advocateMay represent organization as\nprincipal customer contactMay perform competitive assessments and analyses as\nnecessarySphere of influence likely to extend outside of their own functional\norganization Identifies and champions design changes, suggestions and\nprocesses that will improve quality, reliability, functionality and improve\ntime-to-market design cycleMay interface with supplier community and make\nrecommendations on supply base  \n  \nRequirements:Excellent understanding of HW product development processes from\nrequirements to full production and an engineering approach to all your\nwork.In depth knowledge in creating the electrical requirements from the PRD\nProduct Requirement Document), for the various products.Experience with\nCadence CAD tools is beneficial.Experience with all aspect of electronic\nproduct design, including but not limited to, creating block diagrams,\nschematic capture, PCB layout, bring up, writing design specifications, test\nplans, reports, and doing technical presentations.Extensive knowledge of\nindustry standard interfaces including high speed interfaces (Serdes, 25GHz,\nPCIe4) and the SI challenges of these interfaces.Hands on lab experience, in\ndepth knowledge of test equipment and its use, understanding of Design\nVerification Testing of your designsDesirable Requirements:Experience working\nin a cross functional organizationally to identify the requirements and\ndeliver products of high quality and reliability.Master's Degree in EE or\nequivalent experience and a minimum of 5+ years' experience  \n\n","12":null,"13":"## Job Description\n\n**Position: RAN Field Engineer** **Client: Nokia** **Location: Edmonton,\nAlberta, Canada** **Duration: 12+ month contract** **Salary: $440\/day - $55\/hr\nCAD**\n\nAnything over 80 km travel expense will be reimbursed through expense sheet.\nIf hotel expense is required must have prior approval by Nokia  \nEngineering support in the wireless mobile networks ranging from legacy LTE to\n5G technology through deployment, projects, field trial, and lab support along\nwith Helpdesk function during implementation phase and operation support\nphase.\n\nBelow are the TOP requirements that MUST be clear and visible in previous work\nhistory on the resume  \n* Candidate must have experience of Huawei and Nokia LTE networks   \n* Candidate must be able to travel 50-75% throughout Canada as needed   \n• Experience with commissioning, integrating, system verification, acceptance\nand troubleshooting for 2G, 3G, 4G (LTE) & 5G mobile network elements. Develop\nand maintain next generation project competence, process, and documents for\nnetwork deployment.  \n• Experience providing technical support for troubleshooting and resolving\nissues.  \n* Candidate must be a team player and strong communicator as he\/she is expected to work with NOKIA technical leads to finalize migration activities and troubleshoot any issues that may arise during site\/cluster swap activities during the pre-launch phase of the project.   \n* Candidate is also expected to contribute to post launch validation efforts throughout the swap program.   \n* Candidate must be able to work onsite at customer premises during normal business hours, i.e. Mon-Fri 9am-5pm   \n* Knowledgeable\/proficient with NetAct   \n• Log collection expertise  \n• Ability to share best practices for troubleshooting using the key\nfunctionality of EMS.  \n• Act as Tier 2 support for the frontline teams and have direct access to R&D\nand global teams resources for technical consultation on all aspects of 5G.\nBelow please find detailed job description:  \n• Organize and participate in pilot, Field Trial, SW deployment, Software and\nnew feature verification, radio technology network configuration, Method of\nProcedure (MOP) generation as well as test case creation & execution. This\ninvolves: LTE & 5G project knowledge; experience working with Unix or Solaris;\nand experience with protocol analyzers to understand handshaking between\nequipment and proper operations.  \n• Provide support and guidance to customers for operations and maintenance of\nnetwork elements including competence transfer to customer operations teams\nfor local and remote operations and maintenance tasks.  \n• Serve as local customer interface and coordinate communication for services\nand issues between customer market teams and Nokia Service lines.  \n• Support Customer Lab for SW\/ HW New Feature verification and validation.  \n• Ensure quality customer satisfaction survey targets and carry end to end\nsupport function.  \n• Knowledgeable\/proficient with NetAct  \n• Log collection expertise  \n• Ability to share best practices for troubleshooting using the key\nfunctionality of EMS.  \n• Act as Tier 2 support for the frontline teams and have direct access to R&D\nand global teams resources for technical consultation on all aspects of 5G.\n\n1-800 Emergency Support Eng Requirement:  \n1\\. Handle all WTTp call as critical  \n2\\. Able to troubleshoot root cause  \n3\\. Able to analyze logs, OM’s and alarms  \n4\\. Should be able to collect real time data  \n5\\. Guide Field OPS or NOCC Tech’s in logical steps on what measures should be\ntaken  \n6\\. Create summary\/ synopsis of each event, on what were the alarm and\ncorrective measures taken, key finding as to why the outage occurred.\n\nOn-Site Support Prime:  \n1\\. Understanding Nokia RAN Hardware and the solutions.  \n2\\. Understanding of WTTp-LTE technologies  \n3\\. Provide Guideline and best practices for configuration and installation of\nthis hardware  \n4\\. Deep understanding of cabling solutions and front haul solutions and\nassociated testing.  \n5\\. Ability to guide the wider team on standards for BBU\/Radio configurations\nand associated pre-requisites of power and construction requirements to\nsupport hardware and future. 6. Able to visit site that have reoccurring\nissues and create an action plan Create best practice guideline with our team\non how to troubleshoot and assist team with understanding of key reference\nmaterial available by NOKIA\n\n","14":null,"15":"## Job Description\n\nJob Description: My client is seeking candidates with significant experience\nwith JDE modules (GL, AP, and Purchasing) to provide ongoing end-user support,\nand lead continuous improvement projects, and further expansion of their\nProcure to Pay focused applications.\n\nThe Business Analyst proactively works with user communities and leads\nprojects to improve business processes, and delivers solutions, all while\nmaintaining a focus on quality customer service.\n\nThe successful candidate will bring a strong Business System Analyst knowledge\nof EnterpriseOne JDEdwards 9.1 or higher as well as functional Finance or\nAccounts Payable expertise from previous roles within the business. Proven\ntechnical skills to design integrations to other systems from JDE.\n\nThis position is onsite and is base din Edmonton AB or Brampton ON  \n  \n---  \n  \n.\n\n","16":null,"17":"## Job Description\n\nOur Nuclear Client **BWXT** is currently looking for an **Instrumentation and\nControl Engineer** for Peterborough, **ON location for a** contract role\n\nTitle: **Instrumentation and Control Engineer**\n\nEmployment: 1-year contract\n\nLocation: Peterborough, Canada\n\nPay Rate: $80 to $85 Inc. or depending on years of experience\n\n **Job details:**\n\nWe are looking for an **Instrumentation and Control Engineer -** Electronics\nApplication Specific Integrated Circuit (ASIC) designer for a 1-year contract\n**in** Peterborough, Ontario. BWXT NEC's Fuel Handling and Engineered\nSolutions group is involved in the design, manufacture, development, testing,\nparts supply, and service of on-power refueling, reactor maintenance, and\nnuclear medicine delivery tooling sold around the world. We are the original\ndesigner of the automated systems that allow 24\/7 power refueling of CANDU\nreactors and aim to solve some of the Nuclear Industry’s most challenging\nproblems. Today, BWXT’s equipment is being used in most of the nuclear power\nplants in Canada and is critical to delivering carbon-free energy production\nand life-saving medical isotopes.\n\n **JOB SUMMARY:**\n\nThis position reports to the Instrumentation & Controls Engineering Manager.\nResponsibilities of the engineer performing this role include supporting the\ntechnical direction for the overall project and supporting technical\ninterfacing to both internal and external customers. The Instrumentation and\nControls Engineering department largely focuses on the control systems and\ninstrumentation involved within Fuel Handling Systems, other parts of the\nplant, tooling, medical isotope systems as well as remote delivery machines.\nThese systems are often complex and are in specialized areas. The department\nhas the expert knowledge, legacy information, and skillset to support our\ncustomers with engineering design, troubleshooting, maintenance, and support\nwork\n\n **RESPONSIBILITIES:**\n\n  * Develop programmable devices for custom-designed circuit cards that include FPGA and CPLD logic.\n  * Work with hardware and software engineers to define and implement interfaces between the microcontroller software and hardware, including the programmable devices.\n  * Work with hardware and software engineers to define and implement Ethernet communication links to off-the-shelf control system hardware such as Remote I\/O modules.\n  * Work with customers, suppliers, and colleagues across engineering disciplines to define project scope and requirements.\n  * Develop test plans and test setups in a variety of environments, from the test bench to hardware-in-the-loop, to on-site.\n  * Work as part of a multi-disciplinary team to troubleshoot customer issues, and propose, test, and implement solutions\n  * Test execution\/commissioning of complex equipment and systems.\n\n **QUALIFICATIONS:**\n\n  * Diploma or bachelor’s degree in a related discipline (i.e., Electronics Engineering). \n  * Typically requires 5 years of experience in Nuclear, Aerospace, Mining, Oil and Gas, or other highly regulated industries.\n  * Application Specific Integrated Circuit (ASIC) designer\n  * Familiarity with low-level hardware\/software interfaces.\n  * Familiarity with VHDL and Finite State Machine (FSM) design.\n  * Familiarity with formal verification and validation of control system hardware and software, including automated techniques.\n  * Exposure to hardware requirements, design descriptions, interface control documents, and other design basis documents.\n  * Understanding of formal engineering lifecycles\n  * Experience working with and writing design documentation, including but not limited to:\n  * Component specifications\n  * Design requirements\n  * Commissioning requirements\n  * Test procedures\n  * Must be comfortable with traveling to customer sites.\n  * Most importantly…. creative and innovative thinkers!\n\n **DESIRED CHARACTERISTICS:**\n\n  * Experience in the nuclear industry or another highly regulated industry such as aerospace, medical, or defense.\n  * Experience working with suppliers in a technical support role. Experience with CSA Nuclear Codes and Standards.\n  * Experience with IBM DOORS.\n  * Strong communication, presentation, and technical writing skills.\n  * Ability to interface with project team members, vendors, and customers to ensure the scope and requirements of the project are understood, and to ensure the project is executed per the project schedule and budget.\n  * Application Specific Integrated Circuit (ASIC) designer.\n\n","18":"## Job Description\n\nDear Candidate,\n\nThis is Shahista Naaz from DEG, we have urgent need for our client. If you are\ninterested, then share your updated resume at recruitment at\ndomainexpertsgroup dot com Or five one six nine two seven seven seven two one:  \nPosition: C++ Developer  \nExperience: 5+ Years  \nLocation: Canada, VC\n\nJD:\n\nJD  \n· Must have a degree in Computer Science, Computer Engineering, Electrical\nEngineering or related field  \n· 5+ years of proficiency in advanced C++ and object-oriented design\nmethodologies  \n· 5+ years experience in embedded software development  \n· Nice To Have Proficiency in DML\/SystemC , ESL modeling and simulation  \n· Knowledge of ARM microprocessor architecture and CPU behavior Experience\nwith scripting languages e.g. Python, C-Shell  \n· Strong analytical problem solving skills, innovative thinking, and a mindset\nof continuous improvement  \n· Effective verbal and written communication skills\n\n  \nThanks & Regards,\n\nShahista Naaz\n\n","19":"## Job Description\n\nJob Description  \n  \n**Project Manager**  \n  \n**Job Description** :\n\n  * The Project Manager will plan, coordinate, and supervise complex informatics assignments. \n  * Design and apply new methods and procedures. \n  * Coordinate systems development for major applications, and define project requirements including information and data needs, business analysis, and programming. \n  * Develop, plan, analyze, evaluate and assign priorities to deliverables and requirements. \n  * Define project phases, set deadlines, and manage staff. \n  * Develop project plans with milestones. \n  * Coordinate all meetings and interface with business units, staff, and service providers. \n  * The successful candidate will be responsible for the oversight and execution of multiple projects and project managers. \n  * Accountable for managing broad and highly complex teams and projects involving significant scope and complexity. \n\n  \n**Key accountabilities are** :\n\n  * Sets direction at an operational level, works autonomously in the management of the unit, and collaborates with other business heads to establish and execute common goals. \n  * The Project Manager directs or manages large-scale applications, programs, or projects across multiple product lines, involving significant scope and complexity. \n  * Ensures delivery of projects to the business partner, meeting the approved scope\/cost\/schedule\/quality for the project. \n  * Perform a governing role for, ensuring that the proposal, execution, control, deployment, training and hand-off, warranty support, and closure meet promised schedules. \n  * Performs risk identification and mitigation activities, escalating unresolved issues to the Executive and\/or Steering Committee where appropriate to secure their timely decisions\/support. \n  * Manages the acquisition and deployment of resources, including a budget, by working with the Project Managers to secure the resources required for the project. \n  * Ensures client satisfaction with the project process and project team by effective and timely communication including status reporting, continual risk\/issue assessment\/management and escalation, and resolution of issues as they arise. \n  * The successful candidate will be required to work with and influence senior-level leaders and partner with other IT Managers. \n\n  \n**Must Haves:**\n\n  * Proven leadership skills and experience managing large and complex IT projects. \n  * Full life cycle development experience. \n  * Experience with proven project methodology tools. \n  * PMI\/CSM certification. \n  * Expertise in MS Project, Excel, Visio, and PowerPoint \n  * Agile methodology \n  * Excellent communication skills \n  * Certified Scrum Master \n  * Good conflict management\/relationship management skills. \n\n  \n**Nice to haves:**\n\n  * ITIL certification \n  * Banking experience \n\n  \n**About the Company** :\n\n  * As a top 10 North American bank, our client aims to stand out from its peers by having a differentiated brand - anchored in a proven business model and rooted in a desire to give its customers, communities, and colleagues the confidence to thrive in a changing world. \n  * Our client engages in providing financial products and services. They offer various financial products and services, as well as telephone, Internet, and mobile banking services, retail and commercial banking services, as well as wealth management services. The Wholesale Banking segment provides capital markets, investment banking, corporate banking products, and investment needs to companies, governments, and institutions in financial markets. \n\n  \n#tech  \n#LI-GW1  \n#LI-Remote\n\n"},"Salary":{"0":null,"1":"$130,000 - $135,000 \/yr","2":"$70","3":null,"4":"$70","5":null,"6":null,"7":"$160,000 - $170,000 \/yr","8":null,"9":null,"10":"Depends on Experience","11":"$150,000 - $160,000 \/yr","12":null,"13":"Depends on Experience","14":null,"15":"$100,000 - $110,000","16":null,"17":"$80 - $85","18":"Depends on Experience","19":null}}