{"id":{"0":"zMokC","1":"z1EXs","2":"DjQ67","3":"ciK7k","4":"boaHj","5":"7mZaC","6":"zNkrj","7":"kS2p7","8":"bNqyc","9":"RWqPh","10":"a5Jek","11":"htlTV","12":"qKZkd","13":"JWQVK","14":"4uEVj","15":"wlQ2L","16":"B5jhl","17":"764tW","18":"xfgtv","19":"qtuMo"},"Title":{"0":"Quality Analyst with Python","1":"Senior Business Systems Analyst","2":"Senior MEAN Developer","3":"Senior Guidewire, Software Engineer","4":"CTO - App Development","5":"Automation Tester","6":"CTO - App Development","7":"Java \/ JEE Consultant","8":"Senior Guidewire, Software Engineer","9":"Workday Financials Solutions Architect","10":"Senior Software Engineer","11":"Contract 3D Graphics Diagnostics Engineer","12":"Data Analyst","13":"Systems Administrator","14":"Project Manager \/ Project Coordinator","15":"Continuous Improvement Manager","16":"AML Business Analyst III","17":"Data Architect","18":"DevOps Engineer","19":"Guideware Biling center business system analyst"},"Entreprise":{"0":"Accolite Digital LLC","1":"Travelers","2":"Motion Recruitment","3":"Travelers","4":"Jobot","5":"Cynet Systems","6":"Jobot","7":"Cynet Systems","8":"Travelers","9":"Focus Cloud Americas LLC","10":"ishare Inc","11":"Cynet Systems","12":"Global Technical Talent","13":"Global Technical Talent","14":"Global Technical Talent","15":"Collabera","16":"TekWissen LLC","17":"Motion Recruitment","18":"Primesoft, Inc","19":"KGS Technology Group INC"},"Type_Employ":{"0":"Contract W2, Contract Independent, Contract Corp-To-Corp, 12 Months","1":null,"2":"Full Time","3":null,"4":null,"5":null,"6":null,"7":null,"8":null,"9":"Full Time, Permanent","10":"Contract W2, Contract Independent, 6 Months","11":null,"12":"Full Time","13":"Full Time","14":"Full Time","15":"USD180,000 - USD195,000","16":"Contract W2, 6 Months","17":"Full Time","18":"Contract W2, Contract Independent, Contract Corp-To-Corp, 8 Months","19":"Full Time"},"Location":{"0":"Montreal, QC","1":"Toronto, ON","2":"Kingston","3":"Toronto, ON","4":"Quebec City","5":"Montreal, QC","6":"Ottawa","7":"Toronto, ON","8":"Toronto, ON","9":"Toronto, CDA","10":"Toronto, Ontario","11":"Markham, ON","12":"Toronto","13":"Toronto","14":"Toronto","15":"Mississauga, ON","16":"Montral, Qubec","17":"Toronto","18":"Toronto, ON","19":"Toronto, ON"},"Description":{"0":"## Job Description\n\n**_Company Overview:_**\n\nAccolite Digital is a leading provider of cloud and digital product\nengineering services across the banking and financial services, technology,\nhealthcare, communications and media, and logistics industries.\n\nHeadquartered in Addison, Texas, Accolite helps its customers successfully\nnavigate their digital transformation journeys by providing digital product\nengineering, cloud services, data engineering, DevOps, customer experience and\ndesign services.\n\nWith over 2,500 professionals globally, Accolite has presence across the\nUnited States, Canada, and Europe and has digital labs in Bangalore,\nHyderabad, Gurugram, Mumbai and Chennai.\n\n **Job Description:**\n\n7+ years in QA automation\n\n3+ years of extensive experience functional testing and Python.\n\nBachelor's degree\n\n","1":null,"2":"## Job Description\n\nOur mission is to make the process of selling our customer's good an easy,\nfun,a and safe process. We connect sellers with an extensive network of\nengaged and interested buyers to sell everything within two weeks! We have\nsecured Series B Funding and are looking to expand our core products and need\na Senior MEAN Developer to help grow the team. They are open to Angular heavy\nor Node\/TypeScript, or true full stack. This is a full time, 100% remote\nposition offering $130K DOE.  \nRequired Skills & Experience\n\n  * 5+ years of professional experience in software\n  * 4 years working with Angular, and Node\n  * B.S. in Computer Science or related field\n\nDesired Skills & Experience\n\n  * Previous experience working in a start up\n  * Knowledge of capital markets field\n  * B.S. in Computer Science or related field\n\nWhat You Will Be Doing  \nTech Breakdown  \n\n  * 50% Front End (Angular)\n  * 50% Back End (Node)\n\n  \nDaily Responsibilities  \n\n  * 65% Hands On\n  * 35% Team Collaboration\n\nThe Offer\n\n  * Competitive Salary: Up to $130K, DOE\n\n  \nYou will receive the following benefits:  \n\n  * Medical, Dental, Vision Insurance\n  * Bonus DOE\n  * Flexible working hours (within your team)\n\n  \nApplicants must be currently authorized to work in the Canada on a full-time\nbasis now and in the future\n\n","3":null,"4":null,"5":null,"6":null,"7":null,"8":null,"9":"## Job Description\n\n**WORKDAY FINANCIALS SOLUTION ARCHITECT**  \n  \nFocus Cloud is world-class recruitment organisation specialised on Workday. We\nsupport the most exciting companies involved in the Workday ecosystem, from\nWorkday Partners to End Clients.  \n  \nWe are currently recruiting on behalf of a leading Workday Partner, growing\nmassively organically and via acquisitions. To support them in their growth we\nare seeking for a talented Workday Financials Solution Architect to joiun\ntheir team in Canada or US  \n  \n**MAIN PURPOSE OF THE ROLE & RESPONSIBILITIES IN THE BUSINESS:**  \n  \nAs a Workday Financials Solutions Architect, you ll be a lead consultant in\nimplementing and configuring Workday solutions for our global customer base\nand an expert in your chosen Workday specialist capability or capabilities\nsuch as Recruitment, Time tracking, Payroll, Projects etc.  \n  \nAs an expert in a team of consultants, you will manage relationships with our\ncustomers, and shape and deliver solutions that are aligned to customer needs,\nfit for purpose and commercially viable. You ll provide excellent consulting\nand guidance to customers, truly understanding their business.  \n  \nYou ll be an expert in your capability, using your technical and professional\nexpertise to mentor and guide your team members in that capability, providing\nthought leadership and innovation building and improving specialist knowledge\nin your capability or capabilities as well as the broader Workday community.  \n  \n**MINIMUM (ESSENTIAL) REQUIREMENTS:**  \n\n  * Deep understanding of Workday products either\/or Financials\/Payroll as well as your specialist Capability (Product Lead in the Workday ecosystem is ideal but not mandatory)\n  * Excellent customer focus, able to assess customer needs, build relationships and manage customer expectations. You will be able to intervene effectively and resolve customer escalations appropriately\n  * Excellent communicator, able to communicate with customers and colleagues with impact and credibility. Sound ability to formally present to senior Client audiences and at conferences e.g. Workday Altitude\n  * Strong commercial awareness and complete understanding of project and business dynamics\n  * Broad business and technology experience and a good awareness of industry trends and their potential impact on product\n  * Ability to work to tight deadlines and make sensible decisions under pressure taking a balanced view of customer demands and commercials\n  * Ability to widen and maintain a network of external contacts\n  * Excellent consulting skills e.g. leading largescale workshops with multiple stakeholders, liaising confidently and effectively with senior executives\n  * An emerging capability expert driving thought leadership e.g. production of blog posts\n  * An emerging role model within our client and wider Workday ecosystem\n  * Regular participant in sales activities and responsible providing input to work estimates\n  * Understanding of risk management and able to manage risk within the capability\n  * Support the operations function ensure that our consultant pool is used in the most commercially advantageous way, balancing development needs and personal preferences\n  * Commercial understanding of utilisation within a services organisation and the importance of these targets\n  * Able to rotate through various Workday delivery services specifically Consulting and Application Management Services\n  * For Application Management Services, able to deliver work to meet defined Service Level Agreements\n  * Able, if required, to travel to customer sites in the same region (minimal out of region travel may also be required)\n\n  \n **DESIRABLE:**  \n\n  * Professional qualifications where applicable in your Capability\n  * Develop and deliver products\/offerings and services that differentiate our client in the marketplace\n  * Identify talent for rapid development within the capability\n  * Experience of managing, mentoring and developing teams\n\n  \n **PEOPLE MANAGEMENT:**  \n  \nYour role may or may not involve managing people. Where you do have people to\nmanage your responsibilities may include:  \n\n  * Agreeing, setting and reviewing your and your team s goals\n  * Providing support so that your and your team s goals can be achieved\n  * Reviewing and refining goals for relevance and to keep performance on track\n  * Reviewing performance against goals and provide feedback\n  * Conducting 1:1 monthly and\/or project completion feedback meetings\n  * Requesting and providing regular feedback in workday\n  * Completing end of year reviews and agreeing the outcomes for the year\n  * Identifying training to support your and your team s development\n  * Pursuing and supporting your and your team members career paths and progression\n  * Reviewing weekly workload forecasting (staff allocations and timesheet checks) and utilisation\n  * Actively being involved in recruitment\/interviews\n\n  \nThis a fantastic opportunity to join an international Workday Partner with a\nwell-established name in the ecosystem.  \n  \nApply directly or e-mail your resume at for a confidential discussion!  \n  \n\n","10":"## Job Description\n\nThe candidate will be responsible for defining, building, and delivering\ntechnical solutions. They will maintain the long-term technical vision\nalongside the day-to-day execution of new features on The Bay eCommerce site.\nThis position reports directly to the Engineering Manager, Digital.\n\nWhat You Will Do:\n\no Work alongside engineering, product, design, and business counterparts to\nunderstand requirements and collaborate on technical solutions\n\no Translate complex functional and technical requirements into detailed\narchitectures and designs\n\no Design, develop, test, and deploy software that is highly scalable and\nsupports defined business requirements\n\no Code Reviews and developing team-wide development standards and practices\n\nWhat You Will Need:\n\no Bachelor’s Degree in computer science or related field\n\no 5+ years of relevant work experience as a web developer, UI developer,\nJavaScript expert or front-end engineer\n\no Proficiency in HTML, CSS, JavaScript, and jQuery\n\no Familiar with UI layouts, SASS, Bootstrap, and the CSS GRID system\n\no Proficient with JavaScript frameworks such as jQuery, Angular,React, etc\n\no Experience debugging using JavaScript-based tools like Chrome Developer\nConsole\n\no Understanding of key design principles\n\no Understanding of server-side CSS\n\no Experience with responsive and adaptive design\n\no Understanding of SEO principles\n\no Passionate to create good design and usability\n\no Good problem-solving skills\n\no Excellent verbal communication skills\n\no Good interpersonal skills\n\no A team player with excellent communication skills\n\no The following are not required, but preferred:\n\no Experience in Site Optimization\n\no Experience in A\/B Testing\n\no Experience with JIRA\n\no Experience with Agile methodology  \n  \n---\n\n","11":null,"12":"## Job Description\n\nJob Description  \n  \n**Data Analyst**  \n  \n**Department Overview:**\n\n  * The Process Improvement Technology and Transformation (PITT) team is a business-facing department that designs, tests, and implements straight-through processing applications to support the Canadian Personal Banking space. \n  * Canadian Personal Banking (CPB) Operations is responsible for end-to-end Money Out & Money In operation functions and capabilities across Canadian Personal Banking (CPB) and Business Banking (BB) products. \n  * We collaborate closely with business partners to deliver a legendary experience to distribution teams and customers. \n  * Channels & Partners Supported: Real Estate Secured Lending, Personal Lending, Credit Cards, Business Banking, Everyday Banking, Wealth, and Personal Savings & Investments. \n  * Our team Autonetics is under the PITT and is responsible for automated solutions using various tools such as VBA, SQL, Java, and Python. We have designed over 100 small, medium and large applications that also include Canadian and US credit cards. \n\n  \n**Job Description \/ Accountabilities**  \nReporting to the Manager of Autonetics the primary accountabilities of the\nSenior Data Analyst role are:\n\n  * Multiple years of data experience (Tableau Visualization SQL, Python, and VBA) \n  * The Data Analyst develop, code, validate and deliver complex applications and reports that serve our business partners \n  * Requires dedicated management and accountability for the delivery of required data pulls and reporting to help the program in product development and launch of new digital capabilities. \n  * The Data Analyst lead and drive strategic projects within the team and partner with key Stakeholders \n  * Assist with the delivery of new business metrics and operational efficiencies \n  * The Data Analyst provides consultation for Business Units regarding application criteria and process flows \n  * Support new team members through skills and knowledge transfer \n  * Participate fully as a member of the team, participate\/assist in departmental committees providing insight and recommendations, and contribute to a positive work environment \n  * Actively seek to broaden and increase knowledge of new reporting tools and systems \n\n  \n**Qualifications \/ Skills \/ Experience:**\n\n  * 2+ years of reporting experience (VBA, SAS, JCL, ISPF) and\/or using SAS Enterprise Guide (SAS, SQL) \n  * Strong understanding of CPB and\/ or Credit Card lines of businesses supported (including but not limited to Retail Products, Credit Cards, Risk Management, etc.) an asset \n  * Knowledge of host applications including CIF and\/ or TS2 technical environments and applications supported is an asset \n  * Experience with data warehouse and Business BINS \n  * Demonstrated proficiency with Microsoft Word, Excel, PowerPoint, Access, Project, Visio \n  * Experience with SharePoint development is an asset \n  * Ability to quickly understand, acquire and apply new technical skills \n  * Excellent analytical and problem-solving skills \n  * Innovative and conceptual thinker results-oriented \n  * Superior time management skills: be able to manage multiple assignments with competing priorities successfully \n  * Observed leadership abilities and desire to assume responsibility for deliverables \n  * Flexibility to adapt and manage within a dynamic and fast-paced environment \n  * Ability to work independently and as part of a larger team \n  * Ability to analyze scenarios to reach acceptable compromises between technology impacts and customer service \n  * Standup meeting every morning \n  * Business Operations Department that builds technology builds \n  * Technically the business side works closely with IT teams \n  * Work on 1 or 2 applications \n  * End to end micro projects (durations of about 1-2 months) \n  * Build things that are not new \n  * Looking for someone with VBA on a designer level as opposed to a maintenance level \n\n  \n**Must-Have:**\n\n  * VBA\/Excel Coding Experience - 2 years (most important skill) \n  * Strong MS Access - 2 years \n  * Strong communication skills (verbal and written) \n  * Willingness and excitement to learn \n  * Analytical Mindset \n\n  \n**Nice To Have:**\n\n  * Tableau Visualization - 2 years (most important skill) \n  * Programming background (python, HTML or java) \n  * Previous banking experience \n\n  \n**Degree\/Certifications Required:**\n\n  * University Degree or College Diploma, with a specialty in computer sciences, computer programming, or a related field is preferred \n  * Years of experience: 2-4 years \n\n  \n**Note:**\n\n  * Coding experience, enthusiasm to learn new systems \n\n  \n**About the Company**  \nAs a top 10 North American bank, our client aims to stand out from its peers\nby having a differentiated brand - anchored in a proven business model and\nrooted in a desire to give its customers, communities, and colleagues the\nconfidence to thrive in a changing world.  \n  \nOur client engages in providing financial products and services. They offer\nvarious financial products and services, as well as telephone, Internet, and\nmobile banking services, retail and commercial banking services, as well as\nwealth management services. The Wholesale Banking segment provides capital\nmarkets, investment banking, corporate banking products, and investment needs\nto companies, governments, and institutions in financial markets.  \n  \n#tech  \n#LI-GW1  \n#LI-Remote\n\n","13":"## Job Description\n\nJob Description  \n  \n**Systems Administrator \/ Unix Patching and Support**  \n  \n**Job Description** :\n\n  * Our client is looking for an engineer\/Unix admin to join the overnight Support team to assist with the currency initiative to ensure existing hardware is up-to-date with respect to O\/S and Application related patches as well as overnight support duties. \n  * This Systems Administrator candidate should have some Unix System Administrator experience as well as Hadoop experience, accompanied by a strong knowledge of process and procedures surrounding ServiceNow: Change Management. \n  * Monitor and resolve incidents related to infrastructure systems and applications Initiate corrective actions to resolve system and infrastructure application errors. \n  * Log and document production problems, identify recurring problems, and recommend preventative measures. \n  * Answer calls from application support groups or systems engineers, identify problems and resolve or escalate as required. \n  * The Systems Administrator interacts with systems programmers, server, database, and network support staff to maintain responsive and available infrastructure for the application \n  * Effective interpersonal skills working well with a fast-moving team; proactive, organized, excellent analytical and problem-solving skills. \n\n  \n**Environment** :\n\n  * Hadoop, Red Hat Linux 6,7, Satellite, PostgreSQL, Cisco UCS, SaltStack, AnsibleSkill set needed: \n  * Unix System Administrator \n  * Good understanding of Linux\/Unix, especially RHEL \n  * ServiceNow \n\n  \n**Must Haves** :\n\n  * Linux, Hadoop experience \n  * Database support \n  * Unix systems administrator \n\n  \n**Nice to Have** :\n\n  * Banking experience \n  * Linux Certifications \n  * Saltstack \n\n**Note** :\n\n  * Have previous banking experience (smoother transition), years' experience, background. \n\n  \n**About the Company** :  \nAs a top 10 North American bank, our client aims to stand out from its peers\nby having a differentiated brand - anchored in a proven business model and\nrooted in a desire to give its customers, communities, and colleagues the\nconfidence to thrive in a changing world.  \n  \nOur client engages in providing financial products and services. They offer\nvarious financial products and services, as well as telephone, Internet, and\nmobile banking services, retail and commercial banking services, as well as\nwealth management services. The Wholesale Banking segment provides capital\nmarkets, investment banking, corporate banking products, and investment needs\nto companies, governments, and institutions in financial markets.  \n  \n#tech  \n#LI-GW1  \n#LI-Remote\n\n","14":"## Job Description\n\nJob Description  \n  \n**Project Manager \/ Project Coordinator**  \n  \n**Travel Required:** Hybrid model, remote for now, onsite for a day or 2 a\nweek over the coming months  \n**Years of experience** : 8+ years  \n  \n**Summary:**\n\n  * The Project Manager will be working within Technology Control Office on Technology application control initiatives, and audit remediation efforts with Technology teams. \n  * Tracking, collecting\/reviewing evidence and ensuring appropriate and addressing the issue by the deadline \n\n  \n**Job Description**\n\n  * Strong communication skills both oral and written. \n  * A strong understanding of technology application controls and working with our Technology teams in obtaining necessary evidence as required, reviewing for appropriateness and completeness, and packaging for delivery \n  * Providing a point of coordination with our Technology teams with requests for information and ensuring appropriate evidence and packaging for delivery. \n  * Communicating with our Technology team to understand the requests for information asks to ensure accurate and timely turnarounds \n  * Ensuring escalation and notification for delivery issues are timely to the functional manager to avoid overdue issues \n  * Working under TCO Leads on various assignments\/initiatives as required \n\n  \n**Must-Have:**\n\n  * Project Manager\/Project Coordinator experience \n  * Technology Background \n  * Strong Communication Skills - Verbal and Written \n  * Excellent Excel Skills \n  * Multitasking, coordination, attention to detail \n  * Analytical Ability - Strong \n  * JIRA, Confluence Experience \n\n  \n**Nice to have:**\n\n  * Risk Background \n  * Access management experience \n  * CISSP, CSM, CISA certifications \n\n  \n**About the Company**  \n  \nAs a top 10 North American bank, our client aims to stand out from its peers\nby having a differentiated brand - anchored in a proven business model and\nrooted in a desire to give its customers, communities, and colleagues the\nconfidence to thrive in a changing world.  \n  \nOur client engages in providing financial products and services. They offer\nvarious financial products and services, as well as telephone, Internet, and\nmobile banking services, retail and commercial banking services, as well as\nwealth management services. The Wholesale Banking segment provides capital\nmarkets, investment banking, corporate banking products, and investment needs\nto companies, governments, and institutions in financial markets.  \n  \n#tech  \n#LI-GW1  \n#LI-Hybrid\n\n","15":"Save Apply Now\n\n","16":"## Job Description\n\n**Overview: **\n\nTekWissen Group is a workforce management provider throughout the USA and many\nother countries in the world. Our client is a company who is a provider of\nbanking and financial services. The company operates through two divisions,\nRetail Banking and Services, and Corporate and Institutional Banking.\n\n **SUMMARY OF THE ROLE**\n\n **Responsibilities:**\n\n  * Develop Subject Matter Expertise (SME) in the overall data landscape in scope \n\n  * Define data standards, rules, and overall framework to implement data controls \n\n  * Define data monitoring framework including a process to report, escalate and remediate data issues and incidents \n\n  * Liaise with functional stakeholders to identify Critical Data Elements (CDEs) to measure data quality \n\n  * Work closely with the technical analyst to implement data controls \n\n  * Create data dictionaries and metadata to improve understanding and usability of the data \n\n  * Review and document all known interfaces including the discovery of all transformations at each processing step \n\n  * Develop test plans and test cases as needed \n\n  * Liaise with project governance and functional stakeholders as needed \n\n  * Work on multiple work packages and respect aggressive schedules. Support may include extra hours, nights, and weekends. \n\n  * Attend regular meetings and interface with various stakeholders and technical teams \n\n**Minimum required qualifications**\n\n  * 5 years experience \n\n  * Strong background in large-scale shared data environments \n\n  * Intermediate skills in SQL (SQL Server and\/or Oracle) \n\n  * Strong communication skills (verbal and written) in a front office setting \n\n  * Must be a self-starter with attention to detail \n\n  * Exposure to multiple asset classes with expert knowledge in at least one \n\n  * Experience with data lineage and data governance projects \n\n  * Experience writing Functional Specifications Documents (FSD) \n\n  * Ability to manage conflicting requests on time in a continually fast-moving environment \n\n**Preferred qualifications:**\n\n  * Experience in the unstructured data processing \n\n  * Experience in Big Data architecture \n\n  * Experience working within a regulatory environment \n\n  * Experience with network protocols such as SFTP and SMTP \n\n****\n\n**TekWissen® Group is an equal opportunity\/affirmative action Employer\n(m\/f\/d\/v) supporting workforce diversity. **\n\n","17":"## Job Description\n\nTitle: Data Architect Job Description  \nOne of the most progressive product-based software companies in Toronto is\nlooking to expand their team! We hustle, we grind, and we grow. As the team\nmembers that make up the company, we care, we compete, and we support each\nother every day. We're on a mission to deliver a best-in-class client\nexperience driven by technology, data, and of course, our people.  \n  \nAs the leading provider of website, analytics and virtual events solutions to\ninvestor relations and the capital markets, we are a trusted partner to over\n2,400 of the world's most successful public companies and institutions - and\nwe are growing at an incredible pace. We're on our way to becoming the largest\ncapital markets platform company in the world. That's where you come in.  \n  \nWe hire smart, curious, and talented people to push boundaries, reimagine\nwhat's possible and turn challenges into opportunities, all while keeping the\nneeds of our clients at the heart of everything we do.  \n  \nThis is your opportunity to be a part of something special. Join us!  \nRequired Skills & Experience\n\n  * Experience with NoSQL systems e.g. MongoDB, DynamoDB\n  * Expert level skill with SQL\n  * Familiarity with Microservices \n\nDesired Skills & Experience\n\n  * AWS or any cloud exposure\n\nWhat You Will Be Doing  \nTech Breakdown  \n\n  * 100% Data analysis\n\n  \nDaily Responsibilities  \n\n  * 70% Hands On\n  * 30% Team-collaboration\n\nThe Offer\n\n  * Competitive Salary: Up to $180,000\/year, DOE (Can go higher for right candidate)\n\n  \nYou will receive the following benefits:  \n\n  * Unlimited vacation\n  * Benefit coverage (Medical, Dental, Vision, etc)\n  * Stock options - 15%\n  * RRSP Matching\n  * 12% Bonus\n  * Expense Account for fitness& lifestyle\n  * 30 days of global work out of Canada\n\n  \n  \nApplicants must be currently authorized to work in Canada on a full-time basis\nnow and in the future.  \n  \nAccommodation will be provided in all parts of the hiring process as required\nunder Motion Recruitment's Employment Accommodation policy. Applicants need to\nmake their needs known in advance.  \n  \n#LI-JS1\n\n","18":"## Job Description\n\nRole: DevOps Engineer\n\nLocation: **Toronto,ON, Canada - Remote for Now**\n\nContract End: 30-Dec-22\n\n **Must Haves:**\n\n  * Demonstrate proficiency in **two or more of the following** development languages: Bash, Python, Go, Groovy, will also consider Shell, Ruby, Java, JavaScript, C#, C++. \n  * Understanding of branching, versioning and merging strategy in gitflow.\n  *  **Experience of Jenkins\/Gitlab and CI\/CD Pipelines** , Understands the end to end flow of code from SCM to Production servers.\n  * An understanding of PaaS and Container infrastructure Kubernetes and Docker experience Experience of working with cloud providers (e.g. AWS, Google Cloud Platform, Azure). \n  * A passion for code quality and an understanding of the entire DevOps tool chain from a quality perspective. \n  * Infrastructure as Code experience using **Terraform and\/or Ansible**\n  *  **Experience with the following application build tools** \\- Npm or Gulp AND Maven or Gradle. Awareness of the software build cycle. \n  * Understanding of security considerations and security tools used to integrate with the build pipeline covering OWASP Top 10. \n  * Basic infrastructure knowledge - Operating Systems, Linux commands, VM’s, Containers, Proxy, Nginx. Knowledge of build packs and how to access containers. \n\nKalyan - Sr Recruiter - PrimeSoft, Inc\n\n7 3 2 7 9 0 5 3 5 3\n\nkalyan.m(at)primesoftinc(dot)com\n\n","19":"## Job Description\n\nExperience- 8 years\n\nGuideware Certification Reqd-\n\nSkills- Guideware billing center, Strong business system analyst experience\n\nTechnical Guideware experience\n\n"},"Salary":{"0":"Depends on Experience","1":null,"2":null,"3":null,"4":null,"5":null,"6":null,"7":null,"8":null,"9":"USD130000 - USD140000 per annum","10":"Depends on Experience","11":null,"12":null,"13":null,"14":null,"15":null,"16":"$65 - $70","17":null,"18":"Depends on Experience","19":"$40 - $60"}}