[{"id":"nvD0L","Title":"Senior Data Analyst","Entreprise":"Global Technical Talent","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nJob Description  \n  \n**Senior Data Analyst**  \n  \n**Job Description:**\n\n  * Our client is a group supporting the Corporate Defense Group: Fraud Risk Management, Enterprise Insider Risk, Global Security and Investigations and Privacy. \n  * Our client is looking for a Senior Data Analyst who has the ability to lead the exploration, investigation, analysis, development and implementation of data products that support these lines of business. \n  * These include activities in wrangling data sources, to leveraging a SQL server for the storage and manipulation of data and ultimately generating insights and visualizations (via Tableau, Excel & Powerpoint) to share material with business partners. \n  * Our client needs a Senior Data Analyst, who is a self starter and has experience wearing many hats in order to successfully support the team. \n  * The main focus of work will be with respect to Fraud Risk Management, however, broader support may be required across the CDG DAR group. \n\n  \n**Education\/Experience:**\n\n  * Associate's degree in computer programming or equivalent training required. \n  * 5-7 years experience required. \n\n  \n**Skills:**\n\n  * **Technical Skills** : Experience with SQL, Tableau, Python and Azure \n  * **Soft Skills** : Self starter, great communication required, ability to work with non-technical partners \n\n  \n**Must Have :**\n\n  * The main focus of work will be with respect to Fraud Risk Management \n  * Technical Skills: Experience with Tableau visualization, SQL\/Excel and Azure, MS Powerpoint \n  * Fraud Risk Management, Enterprise Insider Risk, Global Security and Investigations and Privacy. \n  * Strong communication and ability to take ownership of project \n  * Data validation experience \n\n  \n**Nice to Have:**\n\n  * Agile methodology\/ environment experience \n  * Ability to have MVP delivery -Minimal value proposition \n  * Python \n\n  \n**Note:**\n\n  * Soft skills mentioned are also very important. attitude and work ethics matter a lot. \n  * The manager is leaving on pat leave. \n  * Someone who can lead and initiate these projects. \n  * Support during this period when one manager is down. \n  * So now our client has 1 person on the team and the new candidate will join them. \n  * Also, some data analysts are also part of a team. \n  * Be able to make recommendations and take ownership. \n  * Someone who has worked as a consultant -Soft Skills: Self-starter, great communication required, ability to work with non-technical partners \n\n#tech  \n#LI-Remote  \n#LI-GW1\n\n","Salary":null},{"id":"Ke3E5","Title":"Validation Technician","Entreprise":"Cynet Systems","Type_Employ":null,"Location":"Toronto, ON","Description":null,"Salary":null},{"id":"5p8Ff","Title":"Senior Software Engineer (Frontend)","Entreprise":"KBS Solutions LLC","Type_Employ":"Full Time","Location":"Toronto, ON","Description":"## Job Description\n\n**Position: Senior Software Engineer (Frontend)** **Location: TORONTO, ON,\nCANADA(REMOTE\/ ONSITE\/HYBRID)** **Duration: Fulltime**\n\n **RESPONSIBILITIES**\n\nDesign, implement, and unit test web applications.  \nParticipate in scrum processes.  \nReview and analyze requirements during sprint planning.  \nCreate necessary design documentation.  \nWorking with scrum teams to come up with the best solutions.  \nParticipate in code and design reviews.  \nDebugging and resolving technical problems that arise.  \nAssist with evaluation and testing of software products.  \nProvide technical guidance to more junior staff, and review and oversee their\nwork.\n\nQUALIFICATIONS\n\n5+ years of web-based application development experience.  \nExperienced with TypeScript, JavaScript, Angular, RxJS, ReactJs\/React Native,\nNPM, HTML, CSS, and other related technologies.  \nExperience in building Single Page Applications (SPA) and component-based\narchitecture knowledge.  \nExperience and familiarity with web application security.  \nExperience participating in design reviews and code reviews.  \nExperience working with CI\/CD processes and tools such as Jira, etc.  \nExperience in troubleshooting production issues, analyzing thread\/heap dumps.  \nExcellent verbal and written communication skills.  \nExcellent time management and organizational skills.  \nAbility to keep current with the constantly changing technology industry.\n\n","Salary":"Depends on Experience"},{"id":"aJveZ","Title":"Software Engineer","Entreprise":"Travelers","Type_Employ":null,"Location":"Toronto, ON","Description":null,"Salary":null},{"id":"TXG2T","Title":"Senior Guidewire, Software Engineer","Entreprise":"Travelers","Type_Employ":null,"Location":"Toronto, ON","Description":null,"Salary":null},{"id":"y0x1o","Title":"Senior Business Systems Analyst","Entreprise":"Travelers","Type_Employ":null,"Location":"Toronto, ON","Description":null,"Salary":null},{"id":"hHSBC","Title":"Intermediate Data Engineer","Entreprise":"KBS Solutions LLC","Type_Employ":"Full Time","Location":"Toronto, ON","Description":"## Job Description\n\n**Position: Intermediate Data Engineers** **Location: TORONTO, ON,\nCANADA(REMOTE\/ ONSITE\/HYBRID)** **Duration: Fulltime** **RESPONSIBILITIES**  \nDesign, implement, and test AWS-based, data pipelines.  \nDesign and develop efficient ETL solutions.  \nDesign, implement, and unit test Java-based applications and microservice\ncomponents.  \nParticipate in scrum processes.  \nReview and analyze requirements during sprint planning.  \nCreate necessary design documentations.  \nWorking with scrum team to come up with the best solutions.  \nParticipate in code and design reviews. Debugging and resolving technical\nproblems that arise.  \nProvide technical guidance to more junior staff, and review and oversee their\nwork.\n\n **QUALIFICATIONS**\n\n2+ years experience with AWS data processing tools (storage, processing, etc.)  \n5+ years of Java development experience.  \nExperience creating ETL pipelines.  \nExperience working with data visualizations and dashboards.  \nExperienced with JDK 8+, Spring Boot.  \nExperience in creating and implementing REST API in microservices components  \nExperience with both relational and non-relational data stores. Experience\nwith Docker.  \nExperience with Kafka.  \nExcellent verbal and written communication skills.  \nExcellent time management and organizational skills.  \nAbility to keep current with the constantly changing technology industry\n\n","Salary":"Depends on Experience"},{"id":"wdiyf","Title":"C++, software optimization engineer","Entreprise":"Jobot","Type_Employ":null,"Location":"Toronto,","Description":null,"Salary":null},{"id":"3qpPO","Title":"Guidewire, Software Engineer","Entreprise":"Travelers","Type_Employ":null,"Location":"Toronto, ON","Description":null,"Salary":null},{"id":"b8ZOF","Title":"Senior UX\/UI Designer","Entreprise":"KBS Solutions LLC","Type_Employ":"Full Time","Location":"Toronto, ON","Description":"## Job Description\n\n**Position: Sr. UX\/UI Designer** **Location: TORONTO, ON, CANADA(REMOTE \/\nONSITE \/ HYBRID)** **Duration: Fulltime**\n\nAs the Sr. UX\/UI Designer, you'll be:  \n· Leading the visual styling, graphics, and layout of web & mobile products.  \n· Working with existing brand systems and simultaneously evolving the systems\nvia buttons, fonts, tables, icons, and other data visualization sets.  \nWe are looking for a Sr. UI\/UX Designer to join our team on a full-time basis.\nThis is an exciting opportunity to design highly important and technical web &\nmobile products for high growth industry.  \n**RESPONSIBILITIES**  \n· Agile mindset, used to Scrum\/Kanban models  \n· Raise the skill capacity in the team, by coaching through reviews and\nfeedback  \n· Facilitate client's product vision by means of researching, conceiving,\nsketching, prototyping and user-testing experiences for digital products  \n· Propose best practices for delivering digital products, based on industry's\nbest practices and experience  \n· Comfortable in working with images and translating them into fully workable\ndesigns and prototypes  \n· Creating wireframes in an iterative and incremental, user centric, mobile\nfirst design process  \n· Team player, inside IT and across departments  \n· Responsible for the delivery of the designs, offering guidance to the\ndevelopment team\n\n","Salary":"Depends on Experience"},{"id":"wdYpb","Title":"Senior Guidewire, Software Engineer","Entreprise":"Travelers","Type_Employ":null,"Location":"Toronto, ON","Description":null,"Salary":null},{"id":"r0BGM","Title":"Senior Guidewire, Software Engineer","Entreprise":"Travelers","Type_Employ":null,"Location":"Toronto, ON","Description":null,"Salary":null},{"id":"u02RH","Title":"Technology Production Operations Team Lead","Entreprise":"Travelers","Type_Employ":null,"Location":"Toronto, ON","Description":null,"Salary":null},{"id":"e5IO1","Title":"Python Developer","Entreprise":"SA Technologies Inc","Type_Employ":"Contract W2, 6 Months","Location":"Toronto, ON","Description":"## Job Description\n\nWe do have an opening for **Python Developer [Replacement]** **** our Client\nCBTS in Canada [Remote] for an initially 6+ months contract with a long-term\nExtension.\n\nBelow is the job description, please review it and let me know your interest.\n\n**Can be Done Remote**\n\n**Title: Python Developer [Replacement]**\n\n**Client Location: Canada [Remote]**\n\n**Tentative 6+months contract with Extension**\n\nYour responsibilities will include: Writing effective and scalable Python\ncodes Designing and implementing robust applications Debugging applications to\nensure low-latency and high-availability Integrating user-facing elements with\nserver-side logic Implementing security and data protection Degree in Computer\nScience, Engineering or a related field You have prior experience as a Python\nDeveloper Good knowledge Django, Flask or similar Python frameworks\nFamiliarity with front-end technologies, such as JavaScript, HTML5, and CSS3\n\n","Salary":"Depends on Experience"},{"id":"cZNwN","Title":"Junior Information Security Specialist","Entreprise":"NTT DATA, Inc.","Type_Employ":null,"Location":"Halifax, NS","Description":null,"Salary":null},{"id":"0OIG2","Title":"Mainframe Z\/OS Consultant","Entreprise":"Cynet Systems","Type_Employ":null,"Location":"Toronto, ON","Description":null,"Salary":null},{"id":"mivhO","Title":"Specialty Developer","Entreprise":"Global Technical Talent","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nJob Description  \n  \n**Specialty Developer**  \n  \n**About Client:**\n\n  * As a top 1 0 North American bank, our client aims to stand out from its peers by having a differentiated brand - anchored in a proven business model and rooted in a desire to give its customers, communities, and colleagues the confidence to thrive in a changing world. \n  * Our client engages in providing financial products and services. \n  * They offer various financial products and services, as well as telephone, Internet, and mobile banking services, retail and commercial banking services, as well as wealth management services. \n  * The Wholesale Banking segment provides capital markets, investment banking, corporate banking products, and investment needs to companies, governments, and institutions in financial markets. \n\n  \n**Summary:**\n\n  * The main function of a Developer (Other Specialty) is to design, develop, and implement applications using in-demand languages and technologies \n\n  \n**Education-**\n\n  * Bachelor's degree in Computer Science, Information Systems, or similar relevant degree. \n  * An undergraduate degree in Computer Science is preferred \n\n  \n**Core technical competency requirement:**\n\n  * 7+ years experience in Angular with Responsive Design (Desktop and Mobile responsive) \n  * 7+ years experience in CSS development, Accessibility Standards. \n  * 5+ years of REST API integration and testing \n  * 5+ years of Agile development \/ Business feature development experience \n  * Current working experience (1.5-2yrs) of Angular 7+ development is a Must \n\n  \n**Other technical skill requirements:**\n\n  * NodeJS \n  * Typescript \n  * npm builds \n  * Selenium \/ Jasmine testing \n  * RESTful API integration \n  * workflow coordination between Angular development, CSS developer, and digital experience (client UX designer) \n  * **Tools:** BitBucket (Git), npm-build, Maven \n\n  \n**Nice to Have:**\n\n  * Highcharts \n\n  \n**Note:** Agile, UI specific to Angular 7 + version  \n  \n#LI-GW1  \n#LI-Hybrid  \n#tech\n\n","Salary":null},{"id":"l4AWA","Title":"Software Developer","Entreprise":"Global Technical Talent","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nJob Description  \n  \n**Software Developer**  \n  \n**About Client:**\n\n  * As a top 10 North American bank, our client aims to stand out from its peers by having a differentiated brand - anchored in a proven business model and rooted in a desire to give its customers, communities, and colleagues the confidence to thrive in a changing world. \n  * Our client engages in providing financial products and services. \n  * They offer various financial products and services, as well as telephone, Internet, and mobile banking services, retail and commercial banking services, as well as wealth management services. \n  * The Wholesale Banking segment provides capital markets, investment banking, corporate banking products, and investment needs to companies, governments, and institutions in financial markets. \n\n  \n**Summary of Day-to-Day Responsibilities:**\n\n  * Client API Program is the Bank's organizational unit charged with helping the Bank build, integrate and transition to using Web RESTful APIs. \n  * The API Program provides Frameworks for building APIs; Portfolio Management, Standards and Governance Services; API Development Consulting, and 1-time project implementation services. \n  * The Program serves all segments of the Bank. Additionally, the Team is creating an API Development Centre of Excellence to accelerate our ability to build APIs for our stakeholders. \n  * Our clients are key players in the Enterprise DevOps and Azure Cloud migration initiatives on behalf of the Enterprise Enabling Technology Solution (EETS) Segment. \n  * We are a very active part of the client Applications and Systems Development Community. \n\n  \n**Key Accountabilities include:**\n\n  * Technical ownership of all API Management platforms, oversight of design\/development activities, and is the escalation point for execution and production issues \n  * API Management product roadmap development and identifying new business opportunities \n  * The Software Developer will facilitate strategic business and technology discussions providing thought leadership to varying audiences \n  * Engage executive stakeholders, line of business partners, and technology project team to facilitate decision making, identify risks, and examine the potential impact \n  * Cooperation with Architecture and Security governance partners to develop policy and establish processes and patterns \n  * Financial oversight through management of technology costs including estimates, execution, maintenance, and run cost planning (Total Cost of Ownership) \n  * The Software Developer will establish, drive, and deliver on committed objectives, timelines, and budget \n  * Management and oversight of developers operating in client Agile development pods \n  * The Software Developer will grow team expertise to align with business\/enterprise demand and direction \n\n  \n**Qualifications \/ Experience**\n\n  * Undergraduate Degree \n  * Experience working in a corporate environment navigating enterprise practices and processes at the client or similar institution \n  * Experience leading projects\/programs from both a technical and delivery standpoint \n  * Experience in the platform and product development \n  * Experience communicating effectively in oral and written form including executive communication, technical communication, and artifact creation\/review. \n  * Leadership \/ People management experience \n  * Solution Design and\/or Architectural background focusing on system integration, networking, security, orchestration, cloud services, etc. \n  * Relevant technologies include but are not limited to RESTful APIs, web services, Datapower, AuthZ, AuthN, OAuth, Azure cloud, Kubernetes, Containers, JIRA, NodeJS, JBoss, Spring Boot, etc. \n  * Having a strong vision for the API management platform at the client is an asset \n\n  \n**Must-Have:**\n\n  * Senior Software Developer experience \n  * API design and development \n  * Writing code, building API's \n  * JAVA & NodeJS \n  * Technical Lead\/Delivery Lead experience \n  * Computer science or software engineering degree \n\n  \n**Nice to have:**\n\n  * Python \n  * API tools understanding - ECHO system, platforms, and capabilities \n\n  \n#tech  \n#LI-GW1  \n#LI-Hybrid\n\n","Salary":null},{"id":"nSJOe","Title":"Senior Business Systems Analyst","Entreprise":"Travelers","Type_Employ":null,"Location":"Toronto, ON","Description":null,"Salary":null},{"id":"zi6CV","Title":"French English SolidWorks","Entreprise":"Forar Tech, LLC.","Type_Employ":"Contract Independent, 12 Months","Location":"Plessisville, QC","Description":"## Job Description\n\nRole: Liaise between French speaking client team and outsourced team in India\n\nPRIMARY REQUIREMENT: Fluent written and spoken French and English (Canada QC\nversion of French)\n\nMust: 5+ years CAD SolidWorks experience (will consider other CAD experience)\n\nEducation: Engineering Bachelors or Associate Degree\n\nPreferred: Candidate local to Plessisville QC area, candidate with prior CAD\nexperience in India\n\nResponsibilities:\n\n  * Liaise between client team and outsourced team in India\n  * Ensure outsourced team in India meets or exceeds client expectation at all times\n  * Explore opportunities to provide additional service to client\n\nWork Authorization: Canadian citizen of Canadian holders only. Client does not\nsponsor visas.\n\n","Salary":"Depends on Experience"}]