{"id":{"0":1.0,"1":2.0,"2":3.0,"3":4.0,"4":5.0,"5":6.0,"6":7.0,"7":8.0,"8":9.0,"9":10.0,"10":11.0,"11":12.0,"12":13.0,"13":14.0,"14":15.0,"15":16.0,"16":17.0,"17":18.0,"18":19.0,"19":20.0},"Title":{"0":"Senior Test\/Automation & Developer (R\/Python) (OAM) | Ottawa | #KAR","1":"Network Management Solutions Developer - PH","2":"5G NR RU Software Principal Developer","3":"Senior, Lead Test and Automation Developer - Telco\/Wireless | PERM\/FULLTIME | 178627SR","4":"Intermediate Network Consultant","5":"Web Developer (.Net Specialist\/Programmer\/Analyst)","6":"Manager, Enterprise Data Management and Analytics","7":"IP Lab Engineer","8":"Technician Application Support","9":"Senior IT Project Manager","10":"Senior Embedded Software Engineer","11":"Senior Back-End Developer","12":"Senior Data Architect","13":"Senior Embedded Software Developer","14":"Business Analyst","15":"SAP IBP Consultant","16":"5G NR Software Development Manager | 173499TR","17":"Front End (Angular) Developer","18":"Drupal Developer","19":"Level 2 Desktop Support"},"Entreprise":{"0":"pandfeed","1":"pandfeed","2":"Stefanini","3":"pandfeed","4":"pandfeed","5":"pandfeed","6":"pandfeed","7":"pandfeed","8":"pandfeed","9":"pandfeed","10":"pandfeed","11":"pandfeed","12":"pandfeed","13":"pandfeed","14":"pandfeed","15":"pandfeed","16":"pandfeed","17":"pandfeed","18":"pandfeed","19":"GTN Technical Staffing"},"Type_Employ":{"0":"Full Time","1":"Full Time","2":"Contract Independent, 12+ Months","3":"Full Time","4":"Full Time","5":"Full Time","6":"Full Time","7":"Full Time","8":"Full Time","9":"Full Time","10":"Full Time","11":"Full Time","12":"Full Time","13":"Full Time","14":"Full Time","15":"Full Time","16":"Full Time","17":"Full Time","18":"Full Time","19":"Contract W2, 2 Months"},"Location":{"0":"Ottawa","1":"Ottawa","2":"Ottawa, ON","3":"Ottawa","4":"Ottawa","5":"Ottawa","6":"Saint-eustache, QC","7":"Ottawa","8":"Saint-eustache, QC","9":"Ottawa","10":"Ottawa","11":"Ottawa","12":"Ottawa","13":"Ottawa","14":"Saint-eustache, QC","15":"Montreal, QC","16":"Ottawa","17":"Ottawa","18":"Ottawa","19":"Kingston, ON"},"Description":{"0":"## Job Description\n\n**Senior Test & Automation Consultant (OAM) **  \n  \n**Location:**  \n\n  * Ottawa (Preferred)\n\n  \n **Term:** 24 Months Contract  \n  \nAs a Senior Test and Automation Developer you will be a key member of a brand\nnew, built from the ground up, high powered Ottawa R&D team. The team works as\npart of our global 5G R&D organization designing, developing, and implementing\na technology new to the client for addressing the demands of the 5G Radio\nsubsystem for operators, and helping our customers exploit this significant\nmarket evolution. The candidate for this role will be experienced in test and\nverification in a 4G\/5G wireless product development organization.  \n  \n **You will:**  \n\n  * Work as a key member of an agile scrum team, providing guidance on software test best practices for features at the unit, component, and endtoend test levels.\n  * Mentor other test and automation developers helping them to contribute their best work.\n  * Develop and help execute test plans validating the functionality, quality, and performance of the 5G product.\n  * Collaborate with other members of the scrum to achieve the highest possible level of automation for all test cases in support of a stable and efficient continuous integration framework.\n\n  \n **Essential Requirements:**  \n\n  * Experience in a 4G\/5G verification team or performing testing activities at an equivalent level in a development environment.\n  * Organized, goaloriented, selfstarter with a teamfocused mentality.\n  * Experience automating using Python and Robot or similar automation frameworks.\n\n  \n **Desirable Requirements:**  \n\n  * 3 to 10+ years of career experience in wireless telecommunications or equivalent combination of relevant education and work experience.\n\nINDNI  \n#PandoCAPandoLogic.Category: Technology, Keywords: Automation Specialist\n\n","1":"## Job Description\n\nThe recruitment team at Myticas Consulting is looking for an experienced\nNetwork Management Solutions Developer who would be interested in a remote\ncontract opportunity headquartered within the Ottawa, ON region.  \n  \n **Responsibilities:**  \n\n  * Work with customers (internal\/remotely\/onsite) for requirement gathering and project deployments\n  * Create high-level and detailed design, implementation, operational and test documentation\n  * Develop software solutions encompassing specific functions, automation, JavaScript, or custom tools\n  * Adhere to and contribute to the team's best practices and continual improvement initiatives\n  * Deliver customized solution via a workshop and\/or technical training to the customer\n  * Provide support to customers integrating OSS systems with the Network Management products (SDWAN, Optical, IP)\n  * Develop and optimize customer use case scenarios, workflow automation to allow customer day-to-day operations\n\n  \n **Team Skill Set:**  \n\n  * Bsc in Software Engineering, Computer Engineering, Computer Science, or equivalent\n  * Fluent English\n  * At least 4 years' working experience\n  * Proficiency in at least two software languages (Python\/Shell\/Javascript etc)\n  * General understanding of networking technologies and protocols (e.g., IP\/MPLS\/Ethernet, routing, network OAM)\n  * Knowledge of and\/or hands-on experience with web services and interfaces (e.g., SOAP, REST,YANG,NETCONF)\n  * Strong troubleshooting experience\n  * Strong customer orientation and communications skills\n  * Eagerness to learn software development, scripting languages and technologies\n\n  \n **Advantage:**  \n\n  * Knowledge of SDLC in an agile, waterfall, or DevOps environment\n  * Experience with Java (OOP) Object Oriented Programming\n  * Linux based Operating Systems\n  * Knowledge of and\/or hands-on experience with Virtualization, cloud providers, and containers technologies (e.g., VMWare\/KVM)\n  * Knowledge of database systems and hands on experience with SQL (e.g., Oracle, MySQL)\n\n#PandoCAPandoLogic.Category: Technology, Keywords: Programmer\n\n","2":"## Job Description\n\n  \nStefanini is looking for 5G NR RU Software Principal Developer in Ottawa,\nOntario, CanadaThe 5G NR RU Software Development team delivers next-generation\nembedded software for a changing telecom world. Working at the cutting edge,\nwe design and develop software for platforms and products all with the most\nadvanced technologies, tools, software developing methodologies and the\ncollaboration of internal and external partners.Join us to do the best work of\nyour career and make a profound social impact as a Principal Developer on our\n5G Radio Unit team in Ottawa.Responsibilities:Contributes to the design and\narchitecture of new or re-engineered software\/storage environmentsPrepares\nwritten software\/storage specifications for complex products from\narchitectural diagrams and documents Develops and reviews design, functional,\ntechnical and\/or user documentation, as neededDevelops, reviews, analyzes and\nimplements test strategies for software products and systems\/for storage\nproducts and systemsDevelops, tests and integrates code for new or existing\nsoftware of significant complexityProvides sustaining or maintenance support\nto existing software\/storage environment, either by implementation or\nproviding guidance to less senior engineersDesigns and implements source code\nrevision control methods for productsPrepares accurate project status\ndocumentation for leadershipMeasures and analyzes quality metricsDefines and\nimplements actions for departmental or cross-functional process\nimprovementsContributes to resource, schedule and cost sizing for software\ndevelopment projects of medium complexityWhat you will achieve:As a Principal\nDeveloper, you will be responsible for the integrity, flexibility,\nadaptability and maintainability of the RU software stack. You will work with\nProduct and Project Management, Hardware, Software and Systems teams in\nclient's commitment to delivering open 5G telecom solutions.You will:Maintain\nand extend the RU software architecture in conjunction with Systems, Hardware\nand Software teamsMentor and lead discussion of software implementation within\nthe O-RAN RU specification and beyondFoster and develop Intellectual Property\nfor client Telecom Systems to keep our global communities communicatingTake\nthe first step towards your dream careerEvery client team member brings\nsomething unique to the table.We are looking for candidates who are\ncomfortable taking accountability and will adapt to meet the needs of our\nrapidly evolving business.The ideal candidate is customer focused, results\ndriven, innovative, works well on a team, and acts with integrity.  \n  \nEssential Requirements:Expert in Software Systems, Radio Equipment Control,\nSoftware Functional Specification, Software Algorithms to control and optimize\nhardware performanceExperienced in integrating third-party softwareOrganized,\ngoal-oriented technical leader to lead, follow, and effectively collaborate\nwith knowledgeable development peers and business partnersStrong knowledge in\n4G and 5G radio architecture, implementation and ecosystemDesirable\nRequirements:Experienced in interfacing third-party analog and mixed signal\ndevices as well as RF power amplifiersWireless expert with strong hands-on\ntechnical skills and the demonstrated ability to work across disparate groups\nincluding sales, operations, product management, and developingExperience in\nSoftware Requirements Management techniquesUnderstanding of 3GPP\nspecifications, ideally as related to Remote Radio UnitsFamiliarity with\nfront-haul standards, ideally including exposure to O-RAN  \n\n","3":"## Job Description\n\n**Senior, Lead Test and Automation Developer - Telco\/Wireless**  \n **Location:** Ottawa - Remote  \n  \n ** _REQUIRED_**  \n\n  * 5 Years Experience in Python Development\n  * Robot Framework (nice to have)\n  * Linux based Operating System experience\n  * Wireless Experience: 3G, 4G or 5G (should understand some theory of 5G at least)\n  * Telco Automation Experience\n  * Experience with lead roles. (~4-5 People)\n  * Worked with containers in past (I.e. Docker, Kubernetes) - _Nice to have_\n  * Open Source Automation Server experience\n  * AGILE experience. \n\n  \nAs a Senior, Lead Test and Automation Developer, you will be a key member of a\nbrand new, built from the ground up, high powered Ottawa R&D team. The team\nworks as part of our global 5G R&D organization designing, developing, and\nimplementing a technology new to the organization for addressing the demands\nof the 5G Radio subsystem for operators, and helping our customers exploit\nthis significant market evolution. The candidate for this role will be\nexperienced in test and verification in a 4G\/5G wireless product development\norganization.  \n  \n **In this role you will:**  \n\n  * Work as a key member of an agile scrum team, supporting end-to-end automation testing of 5G products.\n  * Mentor junior test and automation developers helping them to contribute their best work.\n  * Develop and help execute test plans validating the functionality, quality, and performance of 5G products.\n  * Collaborate with other members of the scrum to achieve the highest possible level of automation for all test cases in support of a stable and efficient continuous integration framework.\n\n  \n ** _Essential Requirements_**  \n\n  * 5+ year of solid experience in automation using Python and automation frameworks like Robot or similar\n  * Experience in a 4G\/5G verification team or performing testing activities at an equivalent level in a development environment\n  * Excellent debugging and troubleshooting skills\n  * Intermediate knowledge in Linux\n  * Working knowledge of CI tools viz Jenkins\n\n  \n ** _Desirable Requirements_**  \n\n  * 5+ years of career experience in wireless telecommunications or equivalent combination of relevant education and work experience\n\n  \n#PandoCA  \nPandoLogic.Category: Technology, Keywords: Automation Developer\n\n","4":"## Job Description\n\nMyticas Consulting's direct client based within the Ottawa region is looking\nfor an intermediate Network Consultant for a 1-year contract opportunity.  \n\n  * Hybrid-Remote\n  * Must have or be eligible to obtain an Enhanced Reliability Security Clearance.\n\n  \nThe successful candidate must be skilled with Microsoft Visio for network\ndesign. There will be onsite requirements from time to time if needed, mostly\nduring migrations. Most of the work will be to keep documentation and network\ndiagrams up to date and take parts of meetings which can all be done remotely\nif wanted. Here is a list of what we will need that candidate to be able to\ndo:  \n\n  * Assist in the planning, design, development, and deployment of new network infrastructure solutions and enhancements to existing solutions.\n  * Create and maintain documentation as it relates to system configuration, mapping, and processes.\n  * Undertakes complex and elaborate preventative maintenance activities (e.g.: patches; firmware; hotfixes; roll-ups; hardware) and ensures the implementation of required technical documentation updates.\n  * Recommend and execute modifications to the environment to improve efficiency, reliability, and performance.\n  * Work with various project teams to develop infrastructure and cabling requirements.\n  * Develop and revise I.T. related infrastructure construction drawings, detailed designs, and layouts.\n  * Perform site walk-through to understand current state and to review adherence to standards and procedures.\n\n#PandoCAPandoLogic.Category: Technology, Keywords: Network Consultant\n\n","5":"## Job Description\n\nWeb Developer develops, maintains and supports internal and third party web\nand client applications for all areas of the company using .Net (C#, VB)  \n  \n**Key Responsibilities:**  \n\n  * Provides project leadership, analysis, design, coding, testing, documentation, training and maintenance.\n  * Participates in the design, planning and implementation of technology to support companywide IT initiatives.\n  * Provides assistance to the IT services group to solve program, SQL Server or other IT related problems.\n  * Be available for afterhours \"on-call\" support on rotation.\n\n  \n **Knowledge and Skills:**  \n\n  * University degree, College degree with Four (4+) years of development experience in a business environment.\n  * Experience developing large scale web\/database applications.\n  * Ability to innovate and provide functional applications with intuitive interfaces.\n  * Take pride in your work and the performance of the applications you write.\n  * Ability to work on multiple projects with multiple deadlines.\n  * Excellent communication and problem solving skills.\n  * Customer service oriented.\n\n  \n**Job Specific Skills:**  \n\n  * Five (5+) years .NET (C#, VB) programming experience in business applications.\n  * Comfort with both windows desktop and web application development (ASP.NET Forms, ASP.NET MVC)\n  * Expertise in development of data based applications that leverage Microsoft SQL Server.\n  * Experience in creating tables\/views, writing SQL queries and stored procedures\n  * You understand web programming and are comfortable with HTML, CSS and JavaScript in the context of ASP.NET\n\n  \n#otwon  \nPandoLogic.Category: Technology, Keywords: Web Developer\n\n","6":"## Job Description\n\nJob Summary :  \nThe Manager, Enterprise Data Management and Analytics will be on the forefront\nof advancing data driven decisions to accelerate growth. You will play a vital\nrole in defining the Data Analytics vision to unlock the untapped value of\nData. The main mgoal will be to transform Data Management andamp; Analytics\ninto a business unit. The Manager, Enterprise Data Management will bridge the\ngap between business and technical stakeholders, while building sound\nfoundations encompassing all aspects: people, process, and technology. The\nManager will also bring a strong background in IT, Sales and marketing.  \n  \nTasks and Responsabilities :  \nProvide both tactical and strategic leadership to the Data Management team\nincluding managing 3rd party vendors and consultants. Design and implement\ndata strategies, data roadmap, data governance framework and systems in\nalignment with strategic goals;  \nProvide both tactical and strategic leadership ;  \nLead, formally and informally, inter-disciplinary teams, improving and\nstreamlining data systems within the company, and driving innovation ;  \nDevelop data procedures and policies, work closely with various departments to\ncollect, prepare, organize, protect and analyze data assets ;  \nAct as program \/ project manager for complex business systems transformations\nand acquisition integrations (BI\/Data\/Web\/Mobiles Apps) ;  \nGuide, motivate, and grow a team of skilled data practitioners. Identify and\nencourage areas for growth, education and career development for your team ;  \nUnderstand, manage or influence the collection, storage, management,\npipelines, quality and protection of data;  \nImplement data privacy policies and ensure compliance with data protection\nregulations ;  \nEnable data value extraction, for example, efficiencies or increased revenue\nbased on insights derived from data ;  \nEffectively communicate the status, value, and importance of data collection\nand governance to executive members and staff ;  \nCreate a culture that promotes data-driven decisions backed by investigation\nand collaboration around data ;  \nServe as a trusted partner to key business executives focused on the customer,\nenterprise risk management, regulatory compliance and finance ;  \nEstablish and oversee a mechanism to monitor compliance with governance and\nstandards  \nResponsible of the planning, creation and execution of Data Analytics strategy\nand data governance ;  \nOwning Data Management, Data Governance, Data Engineering, Data Integration\nand Data insights.  \n  \nJob Requirements :  \nMaster Degree in Computer Science, Data Science or equivalent experience ; MBA\npreferred.  \nMinimum 10+ years of experience in a data management role.  \nExperience in the distribution industry, with knowledge of supply chain and\nwarehouse operations.  \nBilingual in French andamp; English both verbal andamp; written.  \nProficient in MS Office applications (Word, Excel, PowerPoint) and Visio.  \nPrior experience with one or more \"ERP\" and \"CRM\" systems and related\napplications in a Retail, Finance, MFG, Distribution and supply chain\nenvironment.  \nKnowledge of SQL and NoSQL databases as well as good knowledge and\nunderstanding of modern data systems architecture concepts. (cloud based)  \n  \nDemonstrated Skills :  \nHigh degree of resourcefulness, flexibility, and adaptability.  \nLeadership, staff management, and team building skills.  \nStrong negotiation and prioritization skills.  \nStrong interpersonal communication and relational skills, good organizational\nand project management skills; sound judgment; initiative; detail-oriented.  \nStrong analytical and logical problem-solving skills.  \nAbility to partner effectively with other teams such as business functional\ngroups. (Finance, Marketing, Sales, Operations)  \nExperience managing budgets, building business or investment cases.  \nHigh degree of resourcefulness, flexibility, and adaptability.  \nLeadership, staff management, and team building skills.  \nStrong negotiation and prioritization skills.  \nStrong interpersonal communication and relational skills, good organizational\nand project management skills; sound judgment; initiative; detail-oriented.  \nStrong analytical and logical problem-solving skills.  \nAbility to partner effectively with other teams such as business functional\ngroups. (Finance, Marketing, Sales, Operations)  \nExperience managing budgets, building business or investment cases.  \nExperience with most data governance aspects and master data management.  \nDemonstrated experience analyzing business and technical requirements.  \nAbility to explain technical concepts and theories to non-technical audiences.  \nSolid experience delivering automated dashboards with key KPIs.  \n  \nPandoLogic.Category: Technology, Keywords: Enterprise Data Manager\n\n","7":"## Job Description\n\nThe recruitment team at Myticas Consulting is looking for an experienced IP\nLab Engineer who would be interested in a long-term contract opportunity\noffered within the Ottawa region.  \n  \nThis lab is primarily targeted to support Deployment, Customer Trials and\nTraining venues.  \n  \nResponsibilities:  \n\n  * Supports the various Engineering Teams in support of specific topology rebuilds, hardware changes in the lab\n  * Interprets internal and external business challenges and recommends best practices to improve products, processes and services.\n  * Supports in the design of a test or simulation request based on present hardware availability within the lab\n  * Managing Lab Network changes from Public IP request configurations, troubleshooting outages, adding new services to dealing with I.T.\n  * Has in-depth organizational and relevant market knowledge and uses understanding on how relevant areas can be integrated to achieve objectives.\n  * Becomes the Lab Asset Manager - Tracking of HW growth and HW change as required.\n  * Acts as a professional leader for staff \/ work team \/ taskforces, often the most senior specialist in a team, who serves as best practice resource within own organizational unit and \/ or is recognized as an expert within the same professional area in the business.\n  * Often leads functional teams or projects with moderate resource requirements, risk and complexity, handles day-to-day staff management issues, including resource management and allocation of work\n  * Maintain local team servers (ie, DHCP, PXE, etc) and Local Infrastructure (ie, Routers, Hubs, Switches, etc)\n  * Providing oversight and assistance to local technicians and coops on technical issues they cannot resolve within the lab\n  * Maintains Test Equipment and Assorted licenses\n  * Organizes and help with facilitating infrastructure change as lab evolution occurs. (HVAC, AC\/DC Power, Timing)\n  * Maintains ION security and resolve security vulnerabilities with appropriate patches or fixes\n  * Has Knowledge in VMWare in support for Regional Resident Engineering Teams\n  * Creates & Manages PAR creation and 3d party quote management processes for all lab requirements\n\n  \n **Technical Skills:**  \n\n  * Network Management of IP and WAN networks (includes HP-OV, SNMP, and CLI knowledge).\n  * Knowledge of IP Networking: Security Settings, QoS, Routing Protocols (OSPF, ISIS, BGP), signaling protocols (RSVP, LDP), IP VPN, VLAN, VLL\/VPLS, etc.\n  * Knowledge of Virtualization (compute, storage, network) e.g. VMWare, KVM...\n  * Knowledge of UNIX\/Linux\n  * Knowledge of Cloud Computing Engineering, concepts, service models (IaaS, PaaS, etc), deployment models, practical implementations, operations, security and future trends\n  * Experience working with Cloud Management Systems: OpenStack, Cloudstack, VMware, etc.\n  * Software development experience is an asset, especially Internet based applications using XML, HTTP\/TLS, JSON.\n  * Linux\/Unix operating systems installing servers, creating users, groups, and permissions\n  * Windows Servers, installing DNS and Active Directory, and creating Group Policies\n  * Familiar with networking tools, ie. TFTP, FTP and Wireshark\n\n  \n **Qualifications:**  \n\n  * Bachelor's degree or equivalent experience.\n  * 5+ years relevant work experience with a telecommunications equipment vendor or service provider\n  * Hands-on experience and strong background in Bridging and Routing technologies\n  * Background and experience in IP routing protocols such as BGP, IS-IS, OSPF and RIP\n  * Understanding of QoS models and marking\n  * Strong communication skills\n  * Strong troubleshooting skills\n  * Strong organization and time management skills\n  * Strong sense of ownership and accountability\n  * Candidate must work well within a team and with limited supervision\n  * Basic skills in cable architecture and repair required\n\nINDSA  \n#PandoCAPandoLogic.Category: Engineering, Keywords: Laboratory Engineer\n\n","8":"## Job Description\n\nJob Summary :  \nThe Application Support Technician provides first-level computer applications\nsupport as well as training to users coming from franchise and corporate\nstores for the \"BF Retail,\" \"Navision,\" CRM systems and other applications. He\nalso provides the necessary help for updating and application migrating tests\nto ensure quality control  \n  \nTasks and Responsabilities :  \nProvide first level computer support for users of applications supported by\nthe service;  \nDetermine the impact and urgency of requests submitted by users in order to\nprioritize them;  \nCommunicate and interact with the users experiencing difficulties to\ndetermine, document problems and correct them, by telephone, the internet, or\nany other media or in person if need be;  \nEnsure the support and training necessary during system implementations and\nupdating;  \nKeep Users requests up to date and perform follow-ups;  \nProvide advice and explanations for users in response to the difficulties they\nencounter. Determine and write the necessary documentation to meet clients\nsupport needs;  \nParticipate in writing new documentation for existing or newly implemented\napplications;  \nParticipate in software and information systems quality control evaluations;  \nPerform the applicative tests for upgrades, migrations or production launching\nof new applications, outside regular production hours.  \n  \nJob Requirements :  \nDiploma of Collegial Studies (D.C.S...) in computer technology or in a domain\npertinent to the position.  \n3 to 5 years' experience in business applications support, an asset.  \nKnowledge of Windows and Mac operating systems, asset.  \nKnowledge of applications such as Office 365, an asset.  \n  \nDemonstrated Skills :  \nStrong client service orientation.  \nExcellent oral and written communication skills, in French and English.  \nExcellent listening and interpersonal skills  \nVery strong ability in determining and managing request priorities.  \nStrong analytical and problem-solving skills.  \nAble to learn and integrate new functionalities or applications very quickly.  \nAbility to easily adapt to organizational changes within a dynamic and\nevolving environment.  \n  \nPandoLogic.Category: Technology, Keywords: Application Support Technician\n\n","9":"## Job Description\n\nMyticas Consulting's direct client is looking for an experienced project\nmanager with modern techniques in project management and experience in change\nmanagement will lead a variery of software development, system upgrades and\nCOTS configuration projects for their Corporate Systems product line.  \n  \n **Knowledge and Experience**  \n  \n **Experience**  \n  \nIn addition to the experience requirements stated in the Framework Agreement,\nthe Senior IT Project Manager must possess:  \n\n  * 6 years of experience managing client facing IT projects in the last 12 years, including\n    * Experience working with management and business users to prioritize product features and deliverables;\n    * Experience working with business clients to facilitates meetings, product demos;\n  * Leadership of 2 Agile projects in the last 6 years;\n  * Demonstrated leadership in change management in the context of the delivery of new\/enhanced products;\n\n  \n **Knowledge & Abilities**  \n\n  * Well versed in the latest trends and technique for project management (Agile, Kanban, DevOps);\n  * Excellence in communication, both oral and written.\n  * Ability to present to various audience (clients, steering, managers, executives)\n\n  \n **Asset**  \n\n  * Ability to communicate in both official languages;\n  * Agile certification;\n  * Experience using Microsoft AzureDevOps to manage projects.\n\n  \n#PandoCA  \nPandoLogic.Category: Technology, Keywords: IT Project Manager\n\n","10":"## Job Description\n\nThe recruitment team at Myticas Consulting is looking for an experienced\nEmbedded Software Engineer who would be interested in a full time permanent\nopportunity offered within the Ottawa, ON region.  \n  \n **Ideally you may have:**  \n\n  * Hypervisor Experience and Virtualization Experience in embedded space\n  * Certification D0178 - Aerospace OR ISO26262 Automotive Functional Safety OR ASIL-D (I.e. Control Systems for Steering)\n  * Automotive or AD (Aerospace and Defense) Industries\n\n  \n **Responsibilities:**  \n\n  * Work with product management and system architect to understand customer requirements\n  * Develop product features in accordance with customer requirements\n  * Actively participate in certification of Helix Virtualization Platform\n  * Provide technical leadership to junior members of the team\n  * Take initiatives to improve features and processes\n  * Help keeping team focused and organized for releases\n  * Identify, communicate, and coordinate inter-team dependencies\n  * Seek opportunities to collaborate between teams\n\n  \n **Minimum Qualifications:**  \n\n  * BSc \/ MSc degree (Computer Science, Computer\/Electrical Engineering, or equivalent technical degree).\n  * Solid understanding of software development methodology\n  * Minimum 7 year experience in designing complex software features\n  * Minimum 7 year experience working in a software design and development role\n\n  * Solid programming experience in C and assembly (x86, ARMv8)\n\n  * Ability to work well in a team\n  * Strong technical leadership skills\n  * Good time-management skills\n  * Great interpersonal and communication skills\n  * Strong documentation and writing skills\n  * Familiarity with software configuration management tools and defect tracking tools\n  * Knowledge of DO-178 certification standard and certification experience is an asset\n\n  \n#PandoCA  \nPandoLogic.Category: Technology, Keywords: Embedded Software Engineer\n\n","11":"## Job Description\n\nThe back-end team is the core of our engineering group. We handle many\nconcerns across the organization including building new features in the\nproduct, building APIs to support our mobile applications and our form builder\ntool, site reliability engineering and aiding our support team to help our\ncustomers. The team includes software and QA engineers, and we work closely\nwith UX, product management, front-end and mobile app teams on a regular\nbasis.  \n  \nAs the ideal candidate, you have a strong technical foundation, excellent\ncommunication skills and a thirst for knowledge. You love to learn new things\nand you may even have a cool side project or ten. You're no stranger to\ncollaboration and thrive in a team setting. When faced with challenges, you\nare resourceful and capable of moving the needle forward, leveraging help and\nguidance as needed.  \n  \n **Key Responsibilities:**  \n\n  * Build new roadmap features in a full-stack capacity by contributing to the core ProntoForms product which is written in Java and makes extensive use of the Spring framework \n  * Actively participate in an agile team that deploys to production every few days \n  * Engage in development practices such as pair programming, code reviewing and writing tests that prove your implementation meets its goals \n  * Improve site reliability, security and performance \n  * Use bleeding edge tools that greatly improve our quality of life \n  * Constantly learn new things and deliver impactful changes to our product on a regular basis \n  * Be part of a team that cares deeply about the work we do and the people we work with \n\n  \n**Skills and Qualifications:**  \n\n  * Strong Java skills, knowledge of relational databases and web application development \n  * Experience with the following or similar: Spring framework, JavaScript, MySQL \n  * Experience with any cloud platform; we deploy to the Amazon Web Services cloud \n  * A knack for solving tough problems \n  * A desire to continuously learn and improve \n  * Strong collaboration and communication skills\n\n  \n#PandoCA  \nPandoLogic.Category: Technology, Keywords: Back-End Developer\n\n","12":"## Job Description\n\nMyticas Consulting's direct client has a requirement for a Senior Data\nArchitect to actively participate in the \"Facilitating Access to Valuable ERP\nData\" initiative. The main responsibilities expected are:  \n\n  * Subject matter expert for (in the ERP Project)\n    * Data Analysis Activities\n    * Power BI Report Development\n    * Power BI technology & cloud expert\n  * Coach\/Support for\n    * Data Analysts\n    * Solution\/Data Architect(s)\n    * Power BI Report Developers\n\n  \nThe Senior Data Architect will have expertise with the following list of\nrequirements:  \n  \n **80- day contract over a 1 year term**  \n **Must live in the Ottawa Region**  \n **Must be double Vacc**  \n **May be asked to work onsite on occasion**  \n **Experience and Knowledge**  \n  \n **Experience**  \n  \nIn addition to the experience requirements stated in the Framework Agreement,\nthe Senior Data Architect must possess:  \n\n  * Business intelligence and Data Analytics (Mandatory)\n  * Over 15 years of recent experience in Data Analysis (Mandatory)\n    * Experience interpreting data, analyzing results using statistical techniques and providing ongoing reports\n    * Experience working with Business Users to understand the data and extract valuable information for use by the business\n    * Data modeling (Mandatory)\n  * Over 5 years of experience working with Power BI and 10+ years creating reporting solutions\n    * Experience building dynamic data driven reports\n    * Experience in performance tuning power BI reports\n    * Experience using shared power BI datasets\n    * Experience with Power BI in the cloud\n    * Expert knowledge of data visualization best practices\n    * Experience in implementing row-level security with Power BI\n    * Experience in reporting\/dashboard development\n  * Experience with guiding clients from an on Premise architecture into a Cloud Architecture\n  * Experience with a reporting solution that contains Data Security restrictions\n  * Experience with Data Architecture (data lake, data warehouse, big data, APIs, ETL)\n\n  \n **Knowledge & Abilities**  \n\n  * Well versed in the latest trends and techniques for report and dashboard development\n  * Excellent communicator, oral and written\n  * Experience conducting a workshop with clients and developers\n\n  \n **Asset**  \n\n  * Experience with ERP domain (Finance and HR)\n  * Knowledge of analytics data pipeline design and development\n  * Recent experience working in an agile team\/mindset\n  * Experience with database development\n  * Bilingual in English and French\n\n  \nThe intent of this engagement is to provide the project team with expert\nguidance in the design and implementation of the optimal reporting solution\nfor our client. The Senior Data Architect will ensure that the work above is\ndone in the best interests of our client and with approval from the initiative\nlead.  \n  \n#PandoCA  \nPandoLogic.Category: Technology, Keywords: Data Architect\n\n","13":"## Job Description\n\nThe recruitment team at Myticas Consulting is looking for an experienced\nEmbedded Software Developer who would be interested in a full-time permanent\nopportunity offered within the Ottawa, ON region.  \n  \n **We have a wealth of growth opportunities which include:**  \n\n  * Embedded platform OS \/ driver (64 bit SMP)\n  * Linux (Yocto, KVM, QEMU, libvirt, python3)\n  * Data path (including proprietary network processor, 3rd party, and virtualized)\n  * Control plane protocols (IP\/MPLS)\n  * OAM (CFM, EFM, TWAMP, Performance Monitoring)\n  * Timing (PTP, NTP, SyncE, SETS, BITS, and GNSS)\n  * PHY and Optics (Ethernet PHY, MAC, SerDes, Clock Recovery, 100\/400G Optical Transceivers)\n  * Deep Packet Inspection (Application Assurance)\n  * Management interfaces (SNMP, NETCONF, YANG)\n  * Network Function Virtualization (VSR)\n\n  \n **Your skills and experience**  \n\n  * Minimum BS Degree in Computer engineering, Computer Science, equivalent, or better.\n  * Excellent working knowledge of C and\/or C++.\n  * Experience in embedded development.\n  * Demonstrated track record of excellence.\n  * Hands-on experience with IP routers and\/or IP test tools is appealing.\n\n#PandoCAPandoLogic.Category: Technology, Keywords: Senior Real Time (RT)\nEmbedded Software Developer\n\n","14":"## Job Description\n\nJob Summary :  \nThe business analyst analyzes changes in business needs, evaluates the impacts\nas well as the potential technological stakes. The analyst helps users with\ncompleting feasibility studies, defining the scope of the project and\npreparing analyses of business cases, or business opportunity studies. The\nAnalyst works in collaboration with the personnel of the head office, the\nplants, corporate stores and franchises.  \n  \nTasks and Responsabilities :  \nTo be part of an agile team and when needed, act as SCRUM Master;  \nLead the capture and review of needs as well as preparing detailed\nrequirements;  \nOrganize meetings with clients and coordinate communications concerning the\ndevelopment tasks and tests;  \nWork with clients to establish approval test criteria;  \nParticipate in defining integration, user approval and regression tests;  \nEnsure requirement traceability for version deliveries (sprint mode);  \nCarry out functional analyses to identify information, procedures and decision\nflows;  \nTranslate the business needs into technical objectives for the development\nteams;  \nEvaluate the procedures and exit methods and propose improvements;  \nIn cases of integrating systems: define and document interfaces and\nintegration points.  \nProject Coordination  \nManage short term projects (2-3 weeks);  \nCoordinate development team and client requests;  \nInform all stakeholders of any changes brought to the different processes and\nsystems;  \nComplete all the documentation by using the project scope definition model and\nensure its tracking;  \nParticipate in system approval tests.  \n  \nJob Requirements :  \nBachelor's degree in Business administration or in computer sciences.  \n5 to 8 years of experience as a business analyst.  \nExperience with Microsoft's Dynamics CRM project, an asset.  \nExperience with Microsoft Dynamics Nav project, an asset.  \nExperience in case management or risk management.  \nExperience with the business analysis model (BMA) and the organizational\nprocess documentation.  \nSolid knowledge of retail sales systems management and\/or of manufacturing.  \nProfessional accreditation in business analysis, an asset.  \nCRM Certification, an asset.  \n  \nDemonstrated Skills :  \nExcellent listening skills and interpersonal relations to understand the end\nusers' needs.  \nExcellent communication skills in both speaking and in writing French and\nEnglish.  \nAble to influence, convince and initiate changes.  \nStrong analytical sense and synthesizing skills  \nProblem resolution and innovative abilities.  \nEasily establish priorities, meet deadlines and work inside a rapidly changing\nenvironment.  \nCapable of working in collaboration with different sectors of the enterprise\nand ITs.  \nAptitude for teamwork.  \nTechnologies  \nProficiency with MS Office applications (Word, Excel, PowerPoint) and Visio\n(BPMN formalism).  \nUnderstanding of CRM and ERP systems.  \nExperience with the Atlassian suite.  \nVery good understanding of interactions between systems.  \n  \nPandoLogic.Category: Technology, Keywords: Business Systems Analyst\n\n","15":"## Job Description\n\nOne of Myticas Consultin's Montreal based client is looking for an SAP IBP\nConsultant to join their expanding IBP Practice.  \n  \nThe candidate must have the following:  \n\n  * Related functional experience in areas of Supply Chain Planning ( SAP, Kinaxis, Anaplan etc.) IBP, APO, 09 Cloud SC experience\n  * End 2 End Supply Chain \/ Integrated Business Planning Processes knowledge\/experience preferred\n  * Experience in APO core interface integration\n  * Design and build integration models using cloud data services\n  * Advanced using BI (cubes) is an asset\n  * Ability to create, troubleshoot, and test integration models\n  * Plan and prepare detailed process test scenarios for end-user acceptance signoff\n  * Post go-live issue resolution methodology\n  * French speaking an asset\n  * Strong communications skills;\n  * Client facing and strong collaboration skills\n\n  \n#PandoCA  \nPandoLogic.Category: Technology, Keywords: SAP Consultant\n\n","16":"## Job Description\n\nMyticas Consulting's direct client continues to build their 5G wireless O-RAN\nteam from scratch and is looking for a passionate software development manager\nto lead a team.  \n  \nIf you enjoy working on a new product, new software, new team, deep desire to\nlearn and collaborate with others, then we want to hear from you. Join us as a\n5G NR Software Development Manager to do the best work of your career and make\na profound social impact.  \n  \n **Duties:**  \n\n  * Accountability for all product deliverables, cost, and schedule, and WBS\n  * Directing, leading, and managing an 5G embedded software dev team\n  * Agile methodologies and product quality and focus on automation\n  * Collaboration with HW and SW teams in development and innovation\n  * Interviewing, partaking in hiring and maintenance of team' HR management \n  * Coordination of 3 rd party deliverables\n  * Experience managing a multi-site development team\n  * Technical leadership with proficiency in 5G Layer two\n  * Contribute to the development and implementation of test strategies for 5G products and systems\n\n  \n **Looking for:**  \n\n  * Proven record of successfully running a software development program for wireless products, preferably 5G, and delivering commercial products to market\n  * Fosters empathy, open-ness and curiosity with their team\n  * Working with wireless technologies, 4G, 5G, and particularly DU\n  * Knowledge with 3GPP and ORAN protocols\n  * Experience with development lab setups and factory production introduction, a practitioner of CICD and experience in Embedded Software Development in C\/C++.\n\n  \n **Ideally would have:**  \n\n  * Typically requires 2+ years managerial\/leadership experience\n  * Ideally, 8+ years of experience or equivalent combination of education and work experience\n\n  \n#PandoCA  \nPandoLogic.Category: Technology, Keywords: Software Development Manager\n\n","17":"## Job Description\n\nThe recruitment team at Myticas Consulting is looking for an experienced Front\nEnd (Angular) Developer who would be interested in a remote contract\nopportunity offered within the Ottawa, ON region.  \n  \n **Must-have**  \n\n  * Capability to understand software design concepts and ideas into reality using front-end technology\n  * 3+ yrs of hands-on development experience using the Angular Framework (Angular 8+)\n  * Very Strong knowledge and working experience with JavaScript, Typescript, Angular 8\/9, NGRX, Bootstrap, HTML5, CSS3 and Git\n  * Hands-on experience consuming APIs \/ service integration\n  * Knowledge on Agile framework and scrum\n  * Comfortable working in a remote Teams environment\n  * Very strong skills to work on all aspects of an application platform covering the front-end, with an understanding of back-end, database, cloud services, tools, and frameworks.\n\n  \n **Nice-to-have**  \n\n  * Experience with cloud environments (AWS)\n  * Knowledge of XML (DITA if possible)\n\n  \n **Other Skills and Abilities**  \n\n  * Exceptional communication and interpersonal skills.\n  * Ability to communicate ideas in both technical and user-friendly language\n\n  \n#PandoCA  \nPandoLogic.Category: Technology, Keywords: GUI Application Developer\n\n","18":"## Job Description\n\nThe recruitment team at Myticas Consulting is looking for an experienced\nDrupal Developer who would be interested in a long-term contract opportunity\noffered within the Ottawa, Ontario region.  \n  \n **Responsibilities:**  \n\n  * Support the modernization of the clients web content management tools and workflows, as well as design and implement Drupal 8 replacements for legacy applications and identify new opportunities for development of new Drupal 8 applications.\n\n  \n **Qualifications:**  \n\n  * Five (5) years of experience with Drupal development\n  * Three (3) years of experience with reactive JavaScript frameworks (angular, Vue, React)\n  * Five (5) years of experience with CSS\n  * Three (3) years of experience with CSS preprocessor (SASS, LESS, Stylus)\n  * Three (3) years of experience with JSON APIs\n  * One (1) year of experience with automated tools such as Jenkins, Jest, BackstopJS, PHPUnit\n  * Experience with the Bootstrap 4 and 3 frameworks\n  * Experience with Drupal 8 module and theme development\n  * Experience with the Acquia Lightning Drupal distribution\n  * Experience with the following Drupal APIs, libraries and components currently being used by the City: o Entity API\n  * Three (3) years of experience using issue tracking tools like GitHub and Jira\n  * Knowledge and experience building WCAG 2.0 AA compliant websites\n  * Strong English oral and written communications skills\n  * Strong technical writing skills\n\n#PandoCA  \nPandoLogic.Category: Technology, Keywords: Drupal Developer\n\n","19":"## Job Description\n\nNOW HIRING a Level 2 Desktop Support Specialist. Grow your resume and make a\ndifference.\n\nOpportunities to provide white glove executive support.\n\n**Required**\n\n  * 3+ years of onsite desktop support experience\n  * Strong people skills and a desire to grow and learn\n  * Passion for solving IT challenges and for helping others\n  * Positive and professional demeanor\n\n"},"Salary":{"0":null,"1":null,"2":"$150,000 - $160,000 \/yr","3":null,"4":null,"5":null,"6":null,"7":null,"8":null,"9":null,"10":null,"11":null,"12":null,"13":null,"14":null,"15":null,"16":null,"17":null,"18":null,"19":"Depends on Experience"}}