[{"id":"haruL","Title":"Specialty Developer","Entreprise":"Global Technical Talent","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nJob Description  \n  \n**Specialty Developer**  \n  \n**About Client:**\n\n  * As a top 1 0 North American bank, our client aims to stand out from its peers by having a differentiated brand - anchored in a proven business model and rooted in a desire to give its customers, communities, and colleagues the confidence to thrive in a changing world. \n  * Our client engages in providing financial products and services. \n  * They offer various financial products and services, as well as telephone, Internet, and mobile banking services, retail and commercial banking services, as well as wealth management services. \n  * The Wholesale Banking segment provides capital markets, investment banking, corporate banking products, and investment needs to companies, governments, and institutions in financial markets. \n\n  \n**Summary:**\n\n  * The main function of a Developer (Other Specialty) is to design, develop, and implement applications using in-demand languages and technologies \n\n  \n**Education-**\n\n  * Bachelor's degree in Computer Science, Information Systems, or similar relevant degree. \n  * An undergraduate degree in Computer Science is preferred \n\n  \n**Core technical competency requirement:**\n\n  * 7+ years experience in Angular with Responsive Design (Desktop and Mobile responsive) \n  * 7+ years experience in CSS development, Accessibility Standards. \n  * 5+ years of REST API integration and testing \n  * 5+ years of Agile development \/ Business feature development experience \n  * Current working experience (1.5-2yrs) of Angular 7+ development is a Must \n\n  \n**Other technical skill requirements:**\n\n  * NodeJS \n  * Typescript \n  * npm builds \n  * Selenium \/ Jasmine testing \n  * RESTful API integration \n  * workflow coordination between Angular development, CSS developer, and digital experience (client UX designer) \n  * **Tools:** BitBucket (Git), npm-build, Maven \n\n  \n**Nice to Have:**\n\n  * Highcharts \n\n  \n**Note:** Agile, UI specific to Angular 7 + version  \n  \n#LI-GW1  \n#LI-Hybrid  \n#tech\n\n","Salary":null},{"id":"mLxpR","Title":"Senior iOS Engineer","Entreprise":"Motion Recruitment","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\n**Senior iOS Engineer**  \n  \nJob Description  \n  \nMy client is relied upon by governments and trusted agencies across the world.\nThey build security technology that makes it possible for millions of\nindividuals, and government agencies to secure data. With offices in around\nthe world, they're eager to take on new employees to grow and strengthen their\nteam today!  \n  \nRequired Skills and Experience  \n\n  * At least 5 years building & shipping commercial mobile software for the iOS platform,\n  * Proficiency with Swift and a deep knowledge\/usage of the iOS SDK.\n  * Working knowledge of Objective C and the XCode tool set.\n  * Proficient in Object Oriented Programming, Data Modeling and Design Patterns.\n  * Proven track record of developing highly scalable designs.\n  * Demonstrated track record of developing clean and maintainable code.\n  * Ability to break complex problems down into smaller components that are loosely coupled and testable\n  * Discipline for testing and automation - unit, functional, integration, etc.\n  * Stellar communication skills; able to work well with a smart, passionate and growing team\n  * Preference for working in a dynamic startup environment where everyday offers new challenges\n  * BS in Computer Science or related field\n\n  \nDesired Skills and Experience  \n\n  * Understanding of networking terminology & protocols.\n  * Experience with Security.\n  * Experience developing on Android platforms\n  * Personal apps available on Appstore.\n\n  \nWhat you will be doing  \n\n  * Build an incredible iOS product suite, including designing, estimating, and delivering high quality solutions that secure hundreds of millions of users.\n  * Champion the great mobile architecture and good software design paradigms.\n  * Work closely with product management & design teams to take an idea from concept to delivery using excellent software design, coding, & processes.\n\n  \n  \nBenefits  \n\n  * 170k\n  * 4 weeks vacation\n  * Competitive benefits\n\n  \n  \nApplicants must be currently authorized to work in Canada on a full-time basis\nnow and in the future. Accommodation will be provided in all parts of the\nhiring process as required under Motion Recruitment's Employment Accommodation\npolicy. Applicants need to make their needs known in advance.\n\n","Salary":null},{"id":"OxvIw","Title":"C++, software optimization engineer","Entreprise":"Jobot","Type_Employ":null,"Location":"Toronto,","Description":null,"Salary":null},{"id":"DRFn2","Title":"Senior Software Engineer (Frontend)","Entreprise":"KBS Solutions LLC","Type_Employ":"Full Time","Location":"Toronto, ON","Description":"## Job Description\n\n**Position: Senior Software Engineer (Frontend)** **Location: TORONTO, ON,\nCANADA(REMOTE\/ ONSITE\/HYBRID)** **Duration: Fulltime**\n\n **RESPONSIBILITIES**\n\nDesign, implement, and unit test web applications.  \nParticipate in scrum processes.  \nReview and analyze requirements during sprint planning.  \nCreate necessary design documentation.  \nWorking with scrum teams to come up with the best solutions.  \nParticipate in code and design reviews.  \nDebugging and resolving technical problems that arise.  \nAssist with evaluation and testing of software products.  \nProvide technical guidance to more junior staff, and review and oversee their\nwork.\n\nQUALIFICATIONS\n\n5+ years of web-based application development experience.  \nExperienced with TypeScript, JavaScript, Angular, RxJS, ReactJs\/React Native,\nNPM, HTML, CSS, and other related technologies.  \nExperience in building Single Page Applications (SPA) and component-based\narchitecture knowledge.  \nExperience and familiarity with web application security.  \nExperience participating in design reviews and code reviews.  \nExperience working with CI\/CD processes and tools such as Jira, etc.  \nExperience in troubleshooting production issues, analyzing thread\/heap dumps.  \nExcellent verbal and written communication skills.  \nExcellent time management and organizational skills.  \nAbility to keep current with the constantly changing technology industry.\n\n","Salary":"Depends on Experience"},{"id":"b243S","Title":"Java Full Stack Developer","Entreprise":"Cynet Systems","Type_Employ":null,"Location":"Toronto, ON","Description":null,"Salary":null},{"id":"700Wr","Title":"Software Developer","Entreprise":"Global Technical Talent","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nJob Description  \n  \n**Software Developer**  \n  \n**Summary of Day-to-Day Responsibilities:**  \n  \n\n  * Client API Program is the Bank's organizational unit charged with helping the Bank build, integrate and transition to using Web RESTful APIs. \n  * The API Program provides Frameworks for building APIs; Portfolio Management, Standards and Governance Services; API Development Consulting, and 1-time project implementation services. \n  * The Program serves all segments of the Bank. Additionally, the Team is creating an API Development Centre of Excellence to accelerate our ability to build APIs for our stakeholders. \n  * Our clients are key players in the Enterprise DevOps and Azure Cloud migration initiatives on behalf of the Enterprise Enabling Technology Solution (EETS) Segment. \n  * We are a very active part of the client Applications and Systems Development Community. \n\n  \n**Key Accountabilities include:**\n\n  * Technical ownership of all API Management platforms, oversight of design\/development activities, and is the escalation point for execution and production issues \n  * API Management product roadmap development and identifying new business opportunities \n  * The Software Developer will facilitate strategic business and technology discussions providing thought leadership to varying audiences \n  * Engage executive stakeholders, line of business partners, and technology project team to facilitate decision making, identify risks, and examine the potential impact \n  * Cooperation with Architecture and Security governance partners to develop policy and establish processes and patterns \n  * Financial oversight through management of technology costs including estimates, execution, maintenance, and run cost planning (Total Cost of Ownership) \n  * The Software Developer will establish, drive, and deliver on committed objectives, timelines, and budget \n  * Management and oversight of developers operating in client Agile development pods \n  * The Software Developer will grow team expertise to align with business\/enterprise demand and direction \n\n  \n**Qualifications \/ Experience**\n\n  * Undergraduate Degree \n  * Experience working in a corporate environment navigating enterprise practices and processes at the client or similar institution \n  * Experience leading projects\/programs from both a technical and delivery standpoint \n  * Experience in the platform and product development \n  * Experience communicating effectively in oral and written form including executive communication, technical communication, and artifact creation\/review. \n  * Leadership \/ People management experience \n  * Solution Design and\/or Architectural background focusing on system integration, networking, security, orchestration, cloud services, etc. \n  * Relevant technologies include but are not limited to RESTful APIs, web services, Datapower, AuthZ, AuthN, OAuth, Azure cloud, Kubernetes, Containers, JIRA, NodeJS, JBoss, Spring Boot, etc. \n  * Having a strong vision for the API management platform at the client is an asset \n\n  \n**Must-Have:**\n\n  * Senior Software Developer experience \n  * API design and development \n  * Writing code, building API's \n  * JAVA & NodeJS \n  * Technical Lead\/Delivery Lead experience \n  * Computer science or software engineering degree \n\n  \n**Nice to have:**\n\n  * Python \n  * API tools understanding - ECHO system, platforms, and capabilities \n\n  \n**About the Company:**  \nAs a top 10 North American bank, our client aims to stand out from its peers\nby having a differentiated brand - anchored in a proven business model and\nrooted in a desire to give its customers, communities, and colleagues the\nconfidence to thrive in a changing world.  \nOur client engages in providing financial products and services. They offer\nvarious financial products and services, as well as telephone, Internet, and\nmobile banking services, retail and commercial banking services, as well as\nwealth management services. The Wholesale Banking segment provides capital\nmarkets, investment banking, corporate banking products, and investment needs\nto companies, governments, and institutions in financial markets.  \n  \n#tech  \n#LI-GW1  \n#LI-Hybrid\n\n","Salary":null},{"id":"z6vsL","Title":"Senior Software Developer","Entreprise":"Jobot","Type_Employ":null,"Location":"Edmonton","Description":null,"Salary":null},{"id":"ITelF","Title":"React Native Engineer ( Mobile)","Entreprise":"Motion Recruitment","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nJob Description  \nNorth Americas leading enterprise app developer is looking for Senior React\nNative Engineers to onboard to their team as they work with world renowned\nbrands like PayPal, USA Today, Sunwing and many more. They excel in developing\nhigh impact mobile applications and with over 250 releases, their clients are\nempowered to capitalize on the momentum of today's digital consumer! If you\nare looking to have high impact and contribute to applications with large user\nbases, in a collaborative, supportive team environment with the credentials\nbelow, please apply! This is a remote role, open to candidates currently\nlocated and eligible to work on a full-time basis in Canada!  \nRequired Skills & Experience\n\n  * Bachelor's Degree in computer science, Engineering, Mathematics or equivalent field of discipline\n  * 3+ years in React Native Mobile Application Development \n  * Agile environment experience \n\nDesired Skills & Experience\n\n  * Successfully launched applications to App store\n  * Excellent written and verbal communication \n  * Swift or Java\/ Kotlin development is a plus\n\nWhat You Will Be Doing  \nTech Breakdown  \n\n  * 100% React Native\n\n  \nDaily Responsibilities  \n\n  * 70% Hands On\n  * 30% Team Collaboration\n\nThe Offer\n\n  * Competitive Pay: Up to $75\/hour, DOE\n  * Contract Duration: 6 MONTHS\n\n  \nYou will receive the following benefits:  \n\n  * Statutory Vacation\n\n  \nApplicants must be currently authorized to work in the Canada on a full-time\nbasis now and in the future.\n\n","Salary":null},{"id":"rzTOx","Title":"Software Developer","Entreprise":"Global Technical Talent","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nJob Description  \n  \n **Software Developer - Java**  \n  \n**Summary Of Day-To-Day Responsibilities:**\n\n  * The API Program is the Bank's organizational unit charged with helping the Bank build, integrate and transition to using Web RESTful APIs.\n  * The API Program provides Frameworks for building APIs; Portfolio Management, Standards, and Governance Services; API Development Consulting, and 1-time project implementation services.\n  * The Program serves all segments of the Bank. Additionally, the Team is creating an API Development Centre of Excellence to accelerate our ability to build APIs for our stakeholders.\n  * Our client is a key player in the Enterprise DevOps and Azure Cloud migration initiatives on behalf of the Enterprise Enabling Technology Solution (EETS) Segment.\n  * Our client is a very active part of the Applications and Systems Development Community.\n  * Our client Applications & Systems Development covers technical planning, integration, systems analysis, design, development, unit and component systems testing, support maintenance, and more.\n  * Meaningful, effective relationship-building is part of what these highly-skilled experts do best as they work together with technology project managers, delivery partners, business and systems analysts, testing and quality assurance teams, sponsors and so many other stakeholders to clarify requirements.\n\n  \n**Key Technologies and Capabilities:**  \nFrom a technical point of view, the API program is responsible for:\n\n  * Introducing and building enterprise API (Web Restful) technology framework.\n  * Building and maintaining an API gateway to allow the Bank to externalize APIs - i.e. create APIs and capabilities that can be used by external partners.\n  * The Software Developer will be developing, maintaining, governing, and rolling out API Specification (RAML\/OAS), API frameworks (Nodejs and Java), and API Security standards in the Bank.\n  * Creating the migration strategy on legacy technologies including ESB to API & Micro Services architecture and technology in the Bank.\n  * The Software Developer will be supporting LOB API development teams to help them through the full project life-cycle, from design to development to deployment.\n  * Partnering with Infrastructure Technologies Services to speed the adoption of new platforms and technologies (e.g. Azure, Kubernetes).\n  * Defining and rolling out the API Security (OAuth 2.0) strategy and unified authentication platform for authentication and authorization across every enterprise API and all the consuming applications\n  * Building and maintaining the Bank's API management applications for metrics collection, book of records, governance, API inventory, simulators, etc.\n  * Certifying APIs for compliance with architectural and non-functional requirements.\n  * Building and operating an API Development Centre of Excellence - This is a capability to allow us to offer full lifecycle API Development capabilities to other segments in the Bank.\n  * The Software Developer will be monitoring and Supporting migration from legacy integration technologies like Web Services\n\n  \n**Must-Have:**\n\n  * Computer science or software engineering degree\n  * Software developer experience\n  * API design and development\n  * Writing code, building APIs\n  * JAVA & NodeJS\n\n  \n**Nice To Have:**\n\n  * Python\n  * API tools understanding - ECHO system, platforms, and capabilities\n\n  \n**About the Company:**  \nAs a top 10 North American bank, our client aims to stand out from its peers\nby having a differentiated brand - anchored in a proven business model and\nrooted in a desire to give its customers, communities, and colleagues the\nconfidence to thrive in a changing world.  \n  \nOur client engages in providing financial products and services. They offer\nvarious financial products and services, as well as telephone, Internet, and\nmobile banking services, retail and commercial banking services, as well as\nwealth management services. The Wholesale Banking segment provides capital\nmarkets, investment banking, corporate banking products, and investment needs\nto companies, governments, and institutions in financial markets.  \n  \n#tech  \n#LI-Hybrid  \n#LI-GW1\n\n","Salary":null},{"id":"JaSEp","Title":"Business Analyst","Entreprise":"Cynet Systems","Type_Employ":null,"Location":"Toronto, ON","Description":null,"Salary":null},{"id":"xU7zC","Title":"Site Reliability Engineer","Entreprise":"Caresoft","Type_Employ":"Full Time","Location":"Montreal, QC","Description":"## Job Description\n\n**Title: Site Reliability Specialist \/ Network Automation Developer**\n**Duration: Fulltime\/Permanent** **Location: Montreal, Canada**\n\n **Responsibilities:**  \nDaily duties include IP Systems and Network Operations, Operations and\nSecurity.\n\n **Qualification & Experience:**  \nStrong experience in Site Reliability \/ Network Automation field is required.  \nPossesses good analytical, diagnostic, and problem-solving skills, customer\ncentricity, dealing with ambiguity and pressure.  \nProven ability to simultaneously manage multiple tasks in a quickly evolving\nISP environment, Scripting capabilities.  \nIdeal candidate is expected to know technologies such as:  \nLinux & familiarity with at least one programming language - Python, Go, C (or\nC++);  \nIP routing and Networking in general.  \nSoftware packaging (i.e. deb, rpm);  \nContainerization (i.e. podman, k8s);  \nSQL;  \nSSL\/TLS;  \nREST and\/or gRPC.\n\n","Salary":"Depends on Experience"},{"id":"EpJ5I","Title":"CTO - App Development","Entreprise":"Jobot","Type_Employ":null,"Location":"Montreal","Description":null,"Salary":null},{"id":"ofsBB","Title":"AWS Tech Lead and Sr. Developer","Entreprise":"Symphony Enterprises","Type_Employ":"Contract W2, Contract Independent","Location":"Mississauga, ON","Description":"## Job Description\n\n**Job Title: AWS Tech Lead and Sr. Developer**\n\n **Location: Mississauga, CAD (Initially Remote)**\n\n ****\n\n**Description**\n\nThe AWS Tech Lead and Sr. Developer, will provide technical expertise to the\nteam supporting the Patient Engagement Network. This position focuses on the\ncontinuing evolution, implementation, and support of existing and new vendor-\nbased systems to support critical business processes. The Tech Lead will work\nwith our teams in Europe and North America as well as local contractors in\nMississauga to complete the deliverables assigned.\n\n ****\n\n**Requirements**\n\n· Provide leadership and guidance to the development team.\n\n· Participate in business process analysis, use case creation, and\nrequirements definition.\n\n· Responsible for designing, prototyping, developing and unit testing\nsolutions for projects\n\n· and maintenance and enhancement releases.\n\n· Create and maintain technical specifications, system interface diagrams,\nunit testing\n\n· scenarios and system support documentation.\n\n· Follow best practices and standards to ensure technical compliance.\n\n· Adhere to high quality software development lifecycle (e.g., Agile,\nWaterfall).\n\n· Provide root cause analysis to resolve complex issues as part of support.\n\n· Work on multiple priorities at the same time and manage the work\/time\neffectively.\n\n· Demonstrates accountability by contributing to the completion of assigned\ntasks.\n\n· Participate in projects as assigned.\n\n **Skills**\n\n· Experience in BioTech\/Pharmaceutical industries desirable though not\nrequired\n\n· Minimum of 8 years’ experience working with Cloud Data Platforms especially\nAWS\n\n· Expertise with Amazon Web Services (AWS) – EC2, EMR, S3, Athena, Glue,\nRedshift, etc.\n\n· Excellent communication, presentation skills and people Interactions within\ntheir own team or department at the operational level.\n\n· Effectively use programming languages like Python and DevOps experience\n\n· AWS Certifications are a plus\n\n","Salary":"Depends on Experience"},{"id":"54Qgw","Title":"French English SolidWorks","Entreprise":"Forar Tech, LLC.","Type_Employ":"Contract Independent, 12 Months","Location":"Plessisville, QC","Description":"## Job Description\n\nRole: Liaise between French speaking client team and outsourced team in India\n\nPRIMARY REQUIREMENT: Fluent written and spoken French and English (Canada QC\nversion of French)\n\nMust: 5+ years CAD SolidWorks experience (will consider other CAD experience)\n\nEducation: Engineering Bachelors or Associate Degree\n\nPreferred: Candidate local to Plessisville QC area, candidate with prior CAD\nexperience in India\n\nResponsibilities:\n\n  * Liaise between client team and outsourced team in India\n  * Ensure outsourced team in India meets or exceeds client expectation at all times\n  * Explore opportunities to provide additional service to client\n\nWork Authorization: Canadian citizen of Canadian holders only. Client does not\nsponsor visas.\n\n","Salary":"Depends on Experience"},{"id":"JFaER","Title":"Lead Angular Developer","Entreprise":"Motion Recruitment","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nWe are working with an established tech forward company in the digital\nengineering industry. This client Is looking to build intuitive web interfaces\nto cloud applications. Your team will interface with back-end engineers where\nyou will exchange data contracts optimized throughput, scalability, and\nsecurity They are looking to expand one of their core products and need an\nAngular, Typescript senior developer to lead the charge. Expertise in\nHTML\/3S6.HTML, CSS\/SCSS are an asset. This is a full time, 100% remote\nposition offering up to $60\/HR DOE. This company is based in Toronto, Ontario.  \n  \nThis opportunity is ideal for someone with leadership experience who is ready\nto challenge and develop their technical skills while working with team\nmembers, product managers, UI designers, architects and other development\nleads your team will work across the board with multiyear projects- for long\nterm work.  \n  \nRequired Skills & Experience  \n\n  * 8+ years of professional experience in software\n  * Professional experience working as a Tech Lead or equivalent\n  * 2-4+ years leading software development teams\n  * Experience with design and consuming REST APIs\n  * Knowledge with Rx\/JS,Git,Jira,Bitbucket \n  * B.S. in Computer Science or related field\n\n  \nDesired Skills & Experience  \n\n  * Passion for technology \n  * Attention to detail\n  * Team Lead experience \n\n  \nWhat You Will Be Doing  \n  \nTech Breakdown  \n\n  * 100% Front End (Angular 2.0 +,TypeScipt)\n\n  \nDaily Responsibilities  \n\n  * 20% Hands On\n  * 65% Leadership Responsibilities\n  * 25% Team Collaboration\n\n  \nThe Offer  \n\n  * Competitive Salary: Up to $60\/HR, DOE\n\n  \nYou will receive the following benefits:  \n\n  * Medical, Dental, Vision Insurance\n  * Travel Reimbursement \n  * Company Lunches and Activities \n  * RRSP Plan\n  * Life Insurance \n  * Option Gap Coverage\n  * PTO\/Holidays\n  * Gym Reimbursement \n  * Flexible working hours (within your team)\n\n  \nApplicants must be currently authorized to work in the Canada on a full-time\nbasis now and in the future.\n\n","Salary":null},{"id":"C86kK","Title":"Functional Tester","Entreprise":"Cynet Systems","Type_Employ":null,"Location":"Toronto, ON","Description":null,"Salary":null},{"id":"l2zj6","Title":"Senior Guidewire, Software Engineer","Entreprise":"Travelers","Type_Employ":null,"Location":"Toronto, ON","Description":null,"Salary":null},{"id":"mYnSv","Title":"Senior UX\/UI Designer","Entreprise":"KBS Solutions LLC","Type_Employ":"Full Time","Location":"Toronto, ON","Description":"## Job Description\n\n**Position: Sr. UX\/UI Designer** **Location: TORONTO, ON, CANADA(REMOTE \/\nONSITE \/ HYBRID)** **Duration: Fulltime**\n\nAs the Sr. UX\/UI Designer, you'll be:  \n· Leading the visual styling, graphics, and layout of web & mobile products.  \n· Working with existing brand systems and simultaneously evolving the systems\nvia buttons, fonts, tables, icons, and other data visualization sets.  \nWe are looking for a Sr. UI\/UX Designer to join our team on a full-time basis.\nThis is an exciting opportunity to design highly important and technical web &\nmobile products for high growth industry.  \n**RESPONSIBILITIES**  \n· Agile mindset, used to Scrum\/Kanban models  \n· Raise the skill capacity in the team, by coaching through reviews and\nfeedback  \n· Facilitate client's product vision by means of researching, conceiving,\nsketching, prototyping and user-testing experiences for digital products  \n· Propose best practices for delivering digital products, based on industry's\nbest practices and experience  \n· Comfortable in working with images and translating them into fully workable\ndesigns and prototypes  \n· Creating wireframes in an iterative and incremental, user centric, mobile\nfirst design process  \n· Team player, inside IT and across departments  \n· Responsible for the delivery of the designs, offering guidance to the\ndevelopment team\n\n","Salary":"Depends on Experience"},{"id":"SVvvq","Title":"Mobile Manager","Entreprise":"Motion Recruitment","Type_Employ":"Full Time","Location":"Toronto","Description":"## Job Description\n\nMobile Manager  \n  \nMy client is an icon and one of the most recognized media brands in our\ncountry. Used daily across the country with over millions of readers a year.\nRecognized with awards for data visualization, design, and creative\nstorytelling.  \n  \nPOSITION OVERVIEW:  \n  \nWe are looking for a talented QA Analyst to join our team. Working alongside\nvarious team members and development teams to ensure we continue to lead the\nway for our countries citizens.  \n  \nKEY RESPONSIBILITIES:  \n  \n• Collaborate with the QA team on building, maintaining and enhancing test\nautomation framework and test suites  \n  \n• Review QA requirements per user story with product managers and other teams,\nparticipate in creating and reviewing accept criteria  \n  \n• Research and learn new technologies and share knowledge with the team  \n  \nPERKS  \n  \n\n  * weeks vacation\n  * MDV\n  * 6% performance based bonus\n  * 5% RRSP matching\n\n","Salary":null},{"id":"L5Ge1","Title":"QA Analyst","Entreprise":"Global Technical Talent","Type_Employ":"Full Time","Location":"Markham","Description":"## Job Description\n\nJob Description  \n  \n**QA Analyst**  \n  \n**Role Description**\n\n  * The QA Analyst position requires a dedicated, driven individual who can identify issues, analyze problems and propose solutions independently of management guidance. \n  * The type of person suitable for this role is someone who has experience in QA and Automation, with at least three years in automation testing groups performing a range of testing tasks. \n  * The ideal candidate is results-oriented and forward-thinking and can help drive our long-term plans. \n\n  \n**Job Responsibilities:**\n\n  * The QA Analyst will define and execute the automation, testing, and QA processes used in the infrastructure group from smoke testing through final acceptance testing \n  * Define and execute an automation strategy working with external groups \n  * Execute QA and automation processes on all Engineering projects with direction from a team manager \n  * Ensure we meet deliverable deadlines without compromising the quality of the deliverables \n  * Establish a culture of quality and testing within the ITS group \n  * Work with our Customer base to understand their needs and ensure the team delivers high-quality products that meet end-user requirements \n  * Design and develop automation architecture & scripts to interface with additional scripts for a startup, cleanup, logging, reporting, and reduce maintenance \n  * Ensure that the scripts are complete, executable, reusable, and maintainable Responsible for setting standards for scripting and the environment that best suit the production \n  * Responsible to ensure that all planned activities are implemented, executed, and completed in accordance with the planned timeline \n  * Responsible for progress reporting and ensuring that problems and issues are raised for prompt corrective action \n  * Manage short term & long-term objectives and effectively scope projects within schedule constraints \n  * Work with other QA teams, Business Analysts, and Solution Analysts to validate requirements and incorporate the requirements for the design and development of the automation test scripts \n  * Attend QA team meetings and articulate any concerns and findings as well as report those concerns using standard problem reporting tools \n  * Participate in test strategy, test estimation, and planning discussions \n  * Candidate must be able to read Requirement Specification documents and produce Test Plans and Test Cases \n  * Candidate must be able to define Automation Strategies that will verify the operation of new services or products while tracking to project schedule \n  * 5-7 years of experience \n\n  \n**Must-Have skills**\n\n  * Ability to understand data flow logic \n  * Exposure to financial reporting \n  * Accounting practices and base knowledge of accounting \n  * Experience with designing test case scenarios \n\n  \n**Nice to have**\n\n  * Good knowledge of insurance \n  * Understanding of Guidewire policy center \n\n  \n**About the Company**  \nAs a top 10 North American bank, our client aims to stand out from its peers\nby having a differentiated brand - anchored in a proven business model and\nrooted in a desire to give its customers, communities, and colleagues the\nconfidence to thrive in a changing world.  \n  \nOur client engages in providing financial products and services. They offer\nvarious financial products and services, as well as telephone, Internet, and\nmobile banking services, retail and commercial banking services, as well as\nwealth management services. The Wholesale Banking segment provides capital\nmarkets, investment banking, corporate banking products, and investment needs\nto companies, governments, and institutions in financial markets.  \n  \n#tech  \n#LI-GW1  \n#LI-Hybrid\n\n","Salary":null}]